{
  "success": true,
  "url": "https://www.codewars.com/api/v1/code-challenges/56e4339293c3d94b09000d50",
  "data": {
    "id": "56e4339293c3d94b09000d50",
    "name": "Cold War Book Codes",
    "slug": "cold-war-book-codes",
    "category": "algorithms",
    "publishedAt": "2016-03-12T16:14:15.123Z",
    "approvedAt": null,
    "languages": [
      "javascript"
    ],
    "url": "https://www.codewars.com/kata/56e4339293c3d94b09000d50",
    "rank": {
      "id": null,
      "name": null,
      "color": null
    },
    "createdAt": "2016-03-12T15:19:46.395Z",
    "createdBy": {
      "username": "filip.jaskiewicz",
      "url": "https://www.codewars.com/users/filip.jaskiewicz"
    },
    "description": "You are a top secret spy, during cold war. USA and USSR spent bilions, developing arms, and try to spy on each other. They execute the ones found guilty of traitory so you must be very careful. You and your contact, must exchange info you gathered, and you have to use some sort of code to do that. You decide to use book code - a method of encryption that utilises specific books and words in them to pass information to one and another. Two persons exchanging information must own two sets of books, which are exact copies of each other. Then, they can write down a number of the book, followed by a number of the page in that book, followed by a number of the word on that page. This way they can turn words into numbers. As long as set of books remain secret, the code is hard to break. Your task is to create a function to encrypt messages, based on given text, so normal words are converted into sets of numbers like so:\n\n[1, 127, 302], [1, 4, 18], [2, 10, 30]\n\n[book number, page number, word number]\n\n2 books are provided (arrays) with pages (index numbers) - those arrays are called:\n\nBook_1 and Book_2.\n\nYour function must turn text into sets of numbers. Messages you and your contact encode must NOT include commas, punctation, brackets etc (that's what you agree upon).\n\nPhrase: \"The animal world will never sleep\"\n\nshould return:\n\n[0 0 5], [1 0 10], [1 0 137], [1 3 1], [0 1 181], [0 1 204]\n\nempty string should return [undefined undefined undefined]\n\nand if a word is not in the book it should return [undefined undefined undefined]\n\nParts of books used are under Creative Commons license:\n\n* \"Decision\" by Frank M. Robinson\n* \"Stories of the Universe: Animal Life\" by B. Lindsay\n\nBelow is contents of books we use for encrytpion. This is top secret.\n\n```Book_1[0] = 'DECISION BY FRANK M. ROBINSON The captain had learned to hate. It was his profession—and his personal reason for going on. But even hatred has to be channeled for its maximum use, and no truths exist forever.';```\n\n```Book_1[1] = 'The battle alarm caught him in the middle of a dream, a dream that took place in a white house in a small town in Ohio, when both he and Alice had been very young and the grown adults he now called his children had really been little more than babies. He rolled out of his bed immediately on hearing the gong, as any good sailor would, and slipped into his pants and shoes and felt around the bulkhead for his life jacket. He slipped into it and tightened the buckles, then put on his cap with the captain\\'s insignia. He opened the hatch and stepped out into the passageway, blinking for a moment in the unaccustomed light and trying to shake away the remnants of his dream. Officers were boiling up the passageway and up the ladder, some eager ensigns dressed only in their shorts and their life jackets. It was more wise than funny, he thought slowly. Ships had gone down in a matter of seconds and anybody who spent precious moments looking for his pants or his wallet never got out. Harry Davis, the Exec, a portly man in his fifties, burst out of his stateroom, still trying to shake the sleep from gummy lids. The Captain shook his head, trying to alert his mind to the point where it could make sensible evaluations, and started up the corridor. \"Any idea what it is, Harry?\" Davis shook his head. \"Not unless it\\'s what we\\'ve been expecting.\" What we\\'ve been expecting. The Captain grasped the iron piping that served for railings and jogged up the ladder. Fifty miles north, lolling in the North Sea and holding maneuvers, was the Josef Dzugashvili, a hundred thousand tons of the finest aircraft carrier the Asiatic Combine had produced, carrying close to a hundred Mig-72\\'s and perhaps half a dozen light bombers.';```\n\n```Book_1[2] = 'The Josef had been operating there for nearly a week. The Oahu had been detached from the Atlantic Fleet only a few days ago, to combat the possible threat. Maybe the ships were only acting as stake-outs for the politicians, the Captain thought slowly. The tinder waiting for the spark. And it wouldn\\'t take much. A curious pilot who might venture too close, a gunner with a nervous temperament ... And now, maybe, this was it. It had to come some day. You couldn\\'t turn the other cheek forever. And he, for one, was glad. He had spent almost all his life waiting for this. A chance to get even ... Davis opened the hatch to the wheelhouse and the Captain slipped in, closing it tight behind him. It was pitch black and it took his eyes a few moments to adjust to it. When they had, he could make out the shadowed forms of the OD, the first class quartermaster at the wheel, and the radarman hunched over the repeater, the scope a phosphorescent blur in the darkness. The ports were open in violation of GQ—it was a hot summer night—and the slight breeze that blew off the swelling sea smelled clean and cool. It was the only kind of air for a man to breathe, the Captain mused abstractly. He glanced sharply through the ports. There was nothing that bulked on the dark horizon, and so far as he could tell, all the stars were fixed—there were none of the tell-tale flashes of jet exhausts. He walked over to where the OD stood by the radar scope, seemingly fascinated by the picture on it. McCandless had the watch, a young lieutenant of not more than twenty-five but one with good sense and sound judgment nonetheless. A man who wasn\\'t prone to panic, the Captain thought. \"What\\'s the situation, Lieutenant?\"';```\n\n```Book_1[3] = 'McCandless\\' voice was nervous. \"I\\'m not exactly sure, sir. Not ... yet.\" A brief regret at an interrupted dream of Ohio flickered in the back of the Captain\\'s mind. \"What do you mean, you\\'re not sure?\" His voice was a little sharper than he intended, a little more querulous than he had meant it to be. It was, he thought, the voice of an old man, annoyed at having his sleep disturbed. The younger man wasn\\'t disturbed by the sharpness and the Captain\\'s estimation of McCandless went up another notch. \"Ten minutes ago CIC reported an object approaching us from the south at an altitude of fifty miles.\" Approaching from the south, the Captain thought. So it couldn\\'t have been from the Josef. And fifty ... miles ... up. That was two hundred and fifty thousand feet. A guided missile, perhaps? But whose? There were only friendly countries to the south. \"It\\'s passed directly overhead,\" McCandless continued, consciously trying to make his voice sound factual, \"and continued in the direction of Josef. It settled towards sea level, then stopped a mile up.\" \"Stopped, Lieutenant?\" \"Yes, sir. It\\'s hovering over the Josef now.\" McCandless paused. When he started again, his voice was shaking. It was funny he hadn\\'t noticed it before, the Captain thought. You could almost smell the fear in the wheelhouse. \"CIC estimated its speed overhead as being in excess of a thousand miles an hour and its size about that of the Josef itself.\"';```\n\n```Book_1[4] = 'The Captain felt the sweat gather on his temples and ran his hand half angrily over his forehead and through his thinning silver hair. He was too old a man to let fear affect him any more and he was too tired a man to waste his energy mopping his forehead every few minutes in a gesture that would show his feelings to the crew. Maybe it was only vanity, he thought, but when your muscles went soft and started pushing back against your belt and your hair turned gray and started a strategic retreat, you tended to take more care of your reputation. It wasn\\'t as fragile as the rest of you, it didn\\'t tarnish with the gold of your braid or sag with your muscles. And he had enjoyed a reputation as a fearless man of sound judgment. \"Did you order up a drone plane?\" McCandless nodded in the dark. \"It went up a few minutes ago, sir. The television picture should be coming in any moment.\" It would be an infra-red picture, the Captain thought. It wouldn\\'t show too much, provided the plane could get close enough to get anything at all, but it would show something.';```\n\n```Book_2[0] = 'If the microscope had never been invented, the Story of Animal Life, as it is related by modern science, could never have been told. It is to the microscope that we owe our knowledge of innumerable little animals that are too small to be seen by the unassisted eye; and it is to the microscope that we owe the most important part of our knowledge about the bodies of larger animals, about the way in which they are built up, and the uses of their different parts. The earlier opticians who toiled, one after another, to bring the microscope to perfection, never dreamed, in their most ambitious moments, of the value of the gift that their labour was to confer upon mankind. For the microscope alone has made it possible for men of science to study the world of living things. This is the value of honest and thorough work in almost every department of intellectual labour; that it builds a firm and sure though perhaps hidden foundation for the loftier and more perfect work of after days.';```\n\n```Book_2[1] = 'The microscope has shown us the intimate structure of every organ of the animal body; and [10] thus, in most cases, the uses of the organ, and the steps by which it performs its tasks, have been made clear. The microscope has also shown the true nature of the sexual functions, and all the steps of the processes of growth in young animals. None of these things could ever have been rightly understood without the microscope, for all their most important details are invisible to the naked eye. To the microscope, too, we owe our knowledge of the essential kinship between plants and animals; to it, also, our understanding of the oneness, the \"solidarity,\" as the French would say, of the animal kingdom, for it is in the structure of microscopic parts that resemblances are revealed under the most strikingly different circumstances of outward form.';```\n\n```Book_2[2] = 'Let us inquire a little into the history of the animals that can only be seen by the aid of the microscope. Most of them live in water, especially dirty water, containing decaying remains of plants or animals. The naturalists who first discovered them studied them in \"infusions\" of hay, and so on, and hence these little creatures were named Infusoria—a name that has since been somewhat restricted in its application. By an \"infusion\" is meant that water is poured on some substance and allowed to stand; the more ancient and evil-smelling the infusion becomes, the more of these little animals do you find living in it. Nature provides dirty water ready made, in ditches and in ponds, and these are full of microscopic animals. And not only do they appear in dirty water, but kindred kinds appear in clean water also, and many in the waters of the sea.';```\n\n```Book_2[3] = 'It will easily be understood that when the existence of microscopic animals was discovered, [11] zoologists had greatly to modify their ideas of the animal world. Still more was this the case afterwards, when it was found that all animals were built up of minute parts much resembling these microscopic animals in their main features. To these unit parts, of which all animal bodies are composed, the term \"cell\" is applied. The name of cell is not very descriptive of these units in the animal body, but correctly describes the unit of plant structure. In certain important essential particulars both, however, are alike. Nowadays we are not content to describe the grouping and external features of cells; their minute structure also is made a subject of research and inquiry, and affords a field for most of the fashionable speculations of our own day.';```\n\n```Book_2[4] = 'But in spite of the labour necessary to master such detailed lessons, the study of the animal world is far from prosaic. The Story of Animal Life, indeed, bids fair to be the only element of romance left in the modern world for those who stay at home in their own land. The traveller of days of yore, when he ventured into the woods and fields, or upon the water, expected to meet with all sorts of strange things—fairies and elves and ugly gnomes; giants, ogres, and dragons; mermaids and water-witches. With the spread of education all these things have vanished now; it is quite certain that no Board-School-boy has ever met any of them: and one\\'s walks abroad would be in these days as prosaic as they are safe, but for the world of animal life. If you have eyes for this, every field has its inhabitants, and every hedge its marvels. Instead of a fairy, you may be well contented to meet a dragon-fly with shining wings; instead of an ogre you will find the fierce spider, which not only makes away with every harmless fly that blunders into her net, but in many cases destroys her own kind also. Many a plant may be met with which has its own special caterpillar or other dependent insect, with ways of its own, which may amuse your idle hours. As for the change of a caterpillar or a tadpole into its adult form, it would be taken for a miracle if it were observed for the first time.';```\n",
    "totalAttempts": 231,
    "totalCompleted": 17,
    "totalStars": 4,
    "voteScore": 6,
    "tags": [
      "Algorithms"
    ],
    "contributorsWanted": true,
    "unresolved": {
      "issues": 2,
      "suggestions": 1
    }
  },
  "error": null,
  "isValid": false,
  "validationErrors": [
    {
      "path": "approvedBy",
      "message": "Required field 'approvedBy' is missing"
    },
    {
      "path": "rank.id",
      "message": "Expected integer, got object (not integer)"
    },
    {
      "path": "rank.name",
      "message": "Expected type 'string', got 'object'"
    },
    {
      "path": "rank.color",
      "message": "Expected type 'string', got 'object'"
    },
    {
      "path": "approvedBy",
      "message": "Required field 'approvedBy' is missing"
    },
    {
      "path": "approvedAt",
      "message": "Expected type 'string', got 'object'"
    }
  ]
}