{
  "success": true,
  "url": "https://www.codewars.com/api/v1/code-challenges/57b2f63cd2a31cf4f600026d",
  "data": {
    "id": "57b2f63cd2a31cf4f600026d",
    "name": "Caesar hieroglyphics",
    "slug": "caesar-hieroglyphics",
    "category": "games",
    "publishedAt": "2016-08-17T09:42:03.007Z",
    "approvedAt": null,
    "languages": [
      "javascript"
    ],
    "url": "https://www.codewars.com/kata/57b2f63cd2a31cf4f600026d",
    "rank": {
      "id": null,
      "name": null,
      "color": null
    },
    "createdAt": "2016-08-16T11:17:16.650Z",
    "createdBy": {
      "username": "MicahWoldu",
      "url": "https://www.codewars.com/users/MicahWoldu"
    },
    "description": "The Battle of the Nile in 47 BC saw the combined Roman-Egyptian armies of Julius Caesar and Cleopatra VII defeat those of rival Queen Arsinoe IV and King Ptolemy XIII and secure the throne of Egypt.\n\nLegend has written that upon this victory Caesar commissioned the building of several pyramids as an ostentious show of triumph. To ensure the pyramids could not be replicated, Caesar wanted the blueprints for the pyramids to be written using a caesar cypher. \n\nPeculiarly Caesar had a fascination with the triangular numbers; the pyramids were subsequently designed that every layer represented the next sequential triangular number.\n\nWithin the directives given by Caesar were included the base value of the pyramid from which the architects knew the corresponding height Caesar wanted for the pyramid.\n\nAs anthropologists and Egyptologists have grown interested in these blueprints, many have attempted to deceive for financial reward, by creating blueprints which mimic the structure of those written for Caesar's pyramids. However,they did not appreciate Caesar's preoccupation with triangular numbers.\n\nThe task is to decypher the blueprints given, find the base value for the pyramid and work out whether it is a genuine blueprint for a Caesar pyramid or an imitation. Once that has been discovered, state the height of the pyramid.\n\nHINT: within all the encrypted instructions is Caesar's name. Finding this will assist in discovering the key for the cypher.\n\nDue to logistical constraints the pyramids could only be a maximum height of one hundred.\n\nSolution should be in format: [key, height, base];\n\nFor Example:\n\nBlueprint: \"e geiwev tcveqmh sj fewi xairxc sri\"\n\nDecode Blueprint: \"a caesar pyramid of base twenty one\"\n\nKey: To decode the pyramid required a key of value 4\n\nWritten number: 21 is the base of the pyramid;\n\nHeight: Through knowing the base of the pyramid you can workout whether it is a triangular number and therefore a Caesar pyramid. Workout height is 6.\n\nTherefore, solution: [4, 21, 6];\n\nSimilarly:\n\nBlueprint: \"rgkc rm dmmj rfc Cewnrmjmegqrq ylb Aycqyp mlc fslbpcb\"\n\nDecode Blueprint: \"time to fool the Egyptologists and Caesar one hundred\"\n\nKey = 24;\n\nHowever, 100 is not a triangular number\n\nTherefore, solution: [24, 100, \"This is not one of Caesar's commissioned pyramids\"];\n\nFor an understanding of Caesar cipher's: http://practicalcryptography.com/ciphers/caesar-cipher/\n",
    "totalAttempts": 78,
    "totalCompleted": 7,
    "totalStars": 3,
    "voteScore": 2,
    "tags": [
      "Puzzles"
    ],
    "contributorsWanted": true,
    "unresolved": {
      "issues": 2,
      "suggestions": 0
    }
  },
  "error": null,
  "isValid": false,
  "validationErrors": [
    {
      "path": "approvedBy",
      "message": "Required field 'approvedBy' is missing"
    },
    {
      "path": "rank.id",
      "message": "Expected integer, got object (not integer)"
    },
    {
      "path": "rank.name",
      "message": "Expected type 'string', got 'object'"
    },
    {
      "path": "rank.color",
      "message": "Expected type 'string', got 'object'"
    },
    {
      "path": "approvedBy",
      "message": "Required field 'approvedBy' is missing"
    },
    {
      "path": "approvedAt",
      "message": "Expected type 'string', got 'object'"
    }
  ]
}