{
  "success": true,
  "url": "https://www.codewars.com/api/v1/code-challenges/585045d84457afc6640000ec",
  "data": {
    "id": "585045d84457afc6640000ec",
    "name": "Heroes of the Arena, Part 1 - Simple Gladiators",
    "slug": "heroes-of-the-arena-part-1-simple-gladiators",
    "category": "reference",
    "publishedAt": "2016-12-13T19:03:10.550Z",
    "approvedAt": null,
    "languages": [
      "java"
    ],
    "url": "https://www.codewars.com/kata/585045d84457afc6640000ec",
    "rank": {
      "id": null,
      "name": null,
      "color": null
    },
    "createdAt": "2016-12-13T19:02:48.536Z",
    "createdBy": {
      "username": "akrammon",
      "url": "https://www.codewars.com/users/akrammon"
    },
    "description": "Note: This is my first Kata, so I'm really new to this :) Please vote and give feedback! Thanks, and have a fun time coding!\n\nMy friend Tim and I are huge fans of gladiators. We also really like games, so I thought to myself that we should have a game where we can create our own Gladiators and then make them fight against each other! Can you help us make this game?\n\nA Gladiator has 5 important stats:\n\n- The name of the Gladiator, `String`\n- The health of the Gladiator, `double`\n- The damage of the Gladiator, `int`\n- The defense of the Gladiator, `int`\n- The initiative of the Gladiator, `int`\n\nAll the stats are really simple:\n\n- The `initiative` determines whether a gladiator will attack first in a battle. The gladiator with the higher initiative attacks first!\n- The `health` of a Gladiator represents how much life points he has left. If it drops to zero or below, the gladiator is defeated!\n- The `damage` of the gladiator determines how much health points a gladiator can remove <i>with a single attack</i>.\n- The `defense` stat allows a gladiator to ignore a certain amount of damage. With a `defense` of 10, he can ignore 10% of all incoming damage!\n\nLets see an example!\n```\nSpartacus: health 100, damage 30, defense 25, initiative 60\nGannicus: health 100, damage 40, defense 10, initiative 50\n/* Spartacus has higher initiative, so he starts */\nRound 1: Spartacus does 30 damage, 10% of which Gannicus ignores. Gannicus has 73 health left.\nRound 2: Gannicus does 40 damage, 25% of which Spartacus ignores. Spartacus has 70 health left.\nRound 3: Spartacus does 30 damage, 10% of which Gannicus ignores. Gannicus has 46 health left.\n...\nRound 7: Spartacus does 30 damage, 10% of which Gannicus ignores. Gannicus has zero or less health --> Spartacus wins!\n```\n\nEasy, right? Now, for the technicalities...\nI would like to be able to create a Gladiator in the following way:\n```Java\nGladiator(String name, double health, int damage, int defense, int initiative)\n```\n\nI would also like to be able to not specify the initiative. In this case, it should be zero.\n\nThe Gladiator should have getter methods for all 5 members, so we can check on our gladiators whenever we wish.\n\nThe Gladiator class should also have a static method which takes 2 gladiators, competes them in the above mentioned way, and returns the winning Gladiator!\n```Java\npublic static Gladiator fight(Gladiator gladiator1, Gladiator gladiator2)\n```\n\nMy friend Tim is a cheeky pal, I'm sure he will try to make Gladiators that make absolutely no sense just to make fun of my program, so we need to check the input parameters of the constructors. Make sure the constructors' arguments are valid, and if not, then throw an ```IllegalArgumentException```.\n\n- `name` is invalid if empty or null\n- `health` is invalid if not positive - no sense in creating a dead gladiator, right?\n- `damage` should also be above zero - what's the point in a gladiator who can't do any damage? Not to mention one who does negative damage?\n- `defense` should be non-negative but smaller than 100. Not much fun playing against an invincible gladiator, right? Remember, 0 defense is valid!\n\nNote:\n\n- If the initiative of both gladiators is the same in \n```\npublic static Gladiator fight(Gladiator gladiator1, Gladiator gladiator2)\n```\nthen the gladiator passed as the first argument (`gladiator1`) should begin.\n- `Initiative` determines who begins the fight, but afterwards the gladiators simply take turns attacking, as you can see in the example above!\n- When testing the `fight` method, only the name of the winner will be asserted\n- Though the base damage is an `int`, keep in mind that non-integer damages are possible because of the defense!\n \nHave fun solving this Kata! Don't forget to vote and rank this Kata! Also, any feedback in the comments section is highly appreciated! ;)\n",
    "totalAttempts": 909,
    "totalCompleted": 67,
    "totalStars": 10,
    "voteScore": 40,
    "tags": [
      "Object-oriented Programming",
      "Games",
      "Fundamentals"
    ],
    "contributorsWanted": false,
    "unresolved": {
      "issues": 2,
      "suggestions": 0
    }
  },
  "error": null,
  "isValid": false,
  "validationErrors": [
    {
      "path": "approvedBy",
      "message": "Required field 'approvedBy' is missing"
    },
    {
      "path": "rank.id",
      "message": "Expected integer, got object (not integer)"
    },
    {
      "path": "rank.name",
      "message": "Expected type 'string', got 'object'"
    },
    {
      "path": "rank.color",
      "message": "Expected type 'string', got 'object'"
    },
    {
      "path": "approvedBy",
      "message": "Required field 'approvedBy' is missing"
    },
    {
      "path": "approvedAt",
      "message": "Expected type 'string', got 'object'"
    }
  ]
}