{
  "success": true,
  "url": "https://www.codewars.com/api/v1/code-challenges/59409680cda33a496700000a",
  "data": {
    "id": "59409680cda33a496700000a",
    "name": "Code Fantasy 1: The Beginning",
    "slug": "code-fantasy-1-the-beginning",
    "category": "reference",
    "publishedAt": "2017-06-14T07:21:26.240Z",
    "approvedAt": null,
    "languages": [
      "java",
      "javascript"
    ],
    "url": "https://www.codewars.com/kata/59409680cda33a496700000a",
    "rank": {
      "id": null,
      "name": null,
      "color": null
    },
    "createdAt": "2017-06-14T01:50:56.836Z",
    "createdBy": {
      "username": "Kiliosvita",
      "url": "https://www.codewars.com/users/Kiliosvita"
    },
    "description": "   The world of the Coderion is not born without bloodshed. 2000 years ago, 18 different kingdoms competed for the sole controller of this planet. Many kingdoms were toppled and Code Warrior's lives were lost until the the war finally reached a stalemate. Only three powers were left and they cannot invade one without the other backdooring. They are the Code Federation located in the north-west, the Holy City of the Code Gods (HCCG) in the north-east, and the Code Empire in the south. With no other options, the three powers signed a treaty and peace finally settled upon Coderion.\n   \n   That is until 600 years ago, Code Demons appeared in the Central City of the Code Empire and due to be taken from surprise, the empire fell within one single night. All of their territories, by the next day, were flooded with multitudes of demons, and the Code Warriors from the other two powers struggled to push them back. War is still being fought to this date trying to send the demons back to where they came from.\n\n   Your name is Draken, born close to the southern border of the HCCG in a small village. The village is attacked by Code Demons almost every day and you grew up knowing the horrors of bloodshed and war. Your parents are both from a respected linage of Code Warriors and you are expected by everyone to follow the footsteps of your parents.\n   \n---------------------------------------------------------------------------------\n   \n   \"Alright, lets do this.\" \n   \n   You slap yourself a few times infront of a large mirror to get rid of the drowsiness from sleep. Today is not only your 18th birthday, but also your first chance to challenge the Code Warrior Initiation Test. To this date, you've been preparing yourself for this test. Everyday, you've been staying at the village library, The Internet. Through digging into some piles of old books, you found a ancient book titled \"Stack Overflow\"; however, dispite you hard work, you could only understand 5% of the syntax used within the book. Even that 5% is enough for you to have a high percentage to pass the Initiation Test.\n   \n   \"Finally, it's time to go!\"\n   \n   You grab your book and your backpack and head out the door.\n   \n   The Initiation Test is located in the Holy Temple at the heart of the village. You house is in the northern part of the village where most of the Code Warrior's decendents are settled at. The northern part of the village is the safest part out of all the others since most of the demons are in the south. All of the decendents are to be protected because they are the future to the resistance against demons.\n   \n   As you tred down the path to the Holy Temple, you see many familiar faces but not close enough to talk to. Most of them are also headed for the Initiation Test. Some of them looks nervous enough to puke any second now, others looks confident enough to breeze past the test. You are sure you belong the latter catagory as you have the support of Stack Overflow.\n   \n   Reaching the end of the path, you can see the Holy Temple right in front of you. The Holy Temple is a huge piece of building almost five times the size of your house. People varie from Code Warriors to common villagers are pacing in and out of the temple as they spectate for the Initiation Test. You walk up to a desk has the sign, \"Regestration Here\", and see a grumpy old man with a stack of forms.\n   \n   \"Name?\"\n   \n   \"Draken.\"\n   \n   \"Age?\"\n   \n   \"18.\"\n   \n   \"Alright, touch this crystal here.\"\n   \n   The old man pointed at the glowing white crystal with the size of a small pallet. The white crystal is a Age Crystal used to confirm the age of whoever touches it. It will glow white when no one or someone under 18 touches it. Yellow between the age of 18 to 45, Green beween 45 and 100, and red with anyone over the age of 100. As you touch the crystal, it glows faintly yellow.\n   \n   \"Just reached 18 I see. Listen here, take this registration paper to one of the examiners wearing a white uniform and a holy cross symbol and then you can begin your test.\"\n   \n   You took the paper and walked up the stairs while squeezing past many people that are spectating. Once inside, you can see multiple tables with a crystal orb on top. All of the examinees are seemingly dazed while one of their hands are placed on the orb. Above them is a screen showing their attempt at finishing a code model.\n   \n   You saw one of the people that the old man mentioned and handed him your paper. The examiner looked over the paper and pointed to one of the orbs that wern't occupied. \n   \n   \"Well, here I go.\"\n   \n   You walked to the table and placed your right hand onto the crystal orb.\n   \n   Lights flashed in front of your eyes as you are seemingly transported into another world.\n   \n   \"Welcome challenger #89 to your initiation test. Your task is to find the first index of an integer array where three times the number is greater than the next one. If there aren't any, return -1\"\n   \n   Now it's the time to demonstrate your knowledge!\n   \n   Example 1: {7,8,7} returns 0 since 3x7 = 21 and 21 > 8\n   Example 2: {1,3,8} returns 1 since 3x3 = 9 and 9 > 8\n   Example 3: {9,37,199} returns -1 ",
    "totalAttempts": 35,
    "totalCompleted": 13,
    "totalStars": 0,
    "voteScore": 0,
    "tags": [
      "Fundamentals"
    ],
    "contributorsWanted": true,
    "unresolved": {
      "issues": 1,
      "suggestions": 3
    }
  },
  "error": null,
  "isValid": false,
  "validationErrors": [
    {
      "path": "approvedBy",
      "message": "Required field 'approvedBy' is missing"
    },
    {
      "path": "rank.id",
      "message": "Expected integer, got object (not integer)"
    },
    {
      "path": "rank.name",
      "message": "Expected type 'string', got 'object'"
    },
    {
      "path": "rank.color",
      "message": "Expected type 'string', got 'object'"
    },
    {
      "path": "approvedBy",
      "message": "Required field 'approvedBy' is missing"
    },
    {
      "path": "approvedAt",
      "message": "Expected type 'string', got 'object'"
    }
  ]
}