{
  "success": true,
  "url": "https://www.codewars.com/api/v1/code-challenges/60281f6d8d96330012d4f384",
  "data": {
    "id": "60281f6d8d96330012d4f384",
    "name": "Native gibberish",
    "slug": "native-gibberish",
    "category": "games",
    "publishedAt": "2021-02-14T00:51:00.865Z",
    "approvedAt": null,
    "languages": [
      "python"
    ],
    "url": "https://www.codewars.com/kata/60281f6d8d96330012d4f384",
    "rank": {
      "id": null,
      "name": null,
      "color": null
    },
    "createdAt": "2021-02-13T18:50:21.389Z",
    "createdBy": {
      "username": "davilla",
      "url": "https://www.codewars.com/users/davilla"
    },
    "description": "Compare the following sentences:\n```\nThe only languages which do not change are dead ones.\nNah oato thnlgysne ahaer in eod egolde eug acds wnhc.\n```\nTo any English speaker, the second sentence is complete gibberish, even though this jumble, with the same letters reordered, is identically spaced and punctuated. In fact, this randomness would be apparent to many who don't speak English.\n\nHere are similar examples in various languages, one sentence readable and the next one not:\n```\nUne langue qui meurt, c’est une vision du monde qui disparaît.\nQne igudcm eto edoni, r’qau îum neisun su tusdi ipr lateeauvn.\n\nDie Grenzen meiner Sprache bedeuten die Grenzen meiner Welt.\nUre Eirtegn znnene Dnhebpr ceaemnie ide Tgwnedz elreem Seir.\n\nΣκεφτείτε όπως σκέφτονται οι σοφοί, αλλά μιλήστε όπως λένε απλοί άνθρωποι.\nΤφωωταπνό εσσπ ρίοίαήάιόκ οι οτθτν, ίσφφ μεοσιοπ λάνέ εςτω λικπλ ςαλελεέο.\n\nव्यक्ति अपने विचारों से निर्मित प्राणी है, वह जो सोचता है वही बन जाता है।\nतानचने सेप्रों णीतिरा चा हैपहीब सोवह जो, हैजा व अर्है क् व्मि तता यनि वि।\n```\n_(Note how modifiers like accent marks were not decoupled from the letter they modify. These categories are defined in Unicode.)_\n\nYour program will be provided such an excerpt. The test cases use various forms of ancient writing, often in a language that's no longer spoken. The sentences will be either completely legitimate, or completely scrambled gibberish based on some original text, possibly one carved into stone and sitting in a museum halfway across the world. In a few cases the ancient text is not yet deciphered and its meaning a true mystery.\n\nYour task is to determine if the excerpt you receive is the unmodified original.\n\nBest of luck! `:~)`",
    "totalAttempts": 1054,
    "totalCompleted": 13,
    "totalStars": 9,
    "voteScore": 16,
    "tags": [
      "Puzzles"
    ],
    "contributorsWanted": true,
    "unresolved": {
      "issues": 2,
      "suggestions": 3
    }
  },
  "error": null,
  "isValid": false,
  "validationErrors": [
    {
      "path": "approvedBy",
      "message": "Required field 'approvedBy' is missing"
    },
    {
      "path": "rank.id",
      "message": "Expected integer, got object (not integer)"
    },
    {
      "path": "rank.name",
      "message": "Expected type 'string', got 'object'"
    },
    {
      "path": "rank.color",
      "message": "Expected type 'string', got 'object'"
    },
    {
      "path": "approvedBy",
      "message": "Required field 'approvedBy' is missing"
    },
    {
      "path": "approvedAt",
      "message": "Expected type 'string', got 'object'"
    }
  ]
}