{
  "success": true,
  "url": "https://www.codewars.com/api/v1/code-challenges/62a0b5ce4e2c240031d0ed13",
  "data": {
    "id": "62a0b5ce4e2c240031d0ed13",
    "name": "Supply and Demand",
    "slug": "supply-and-demand",
    "category": "reference",
    "publishedAt": "2022-06-15T21:57:37.910Z",
    "approvedAt": null,
    "languages": [
      "python"
    ],
    "url": "https://www.codewars.com/kata/62a0b5ce4e2c240031d0ed13",
    "rank": {
      "id": null,
      "name": null,
      "color": null
    },
    "createdAt": "2022-06-08T14:44:30.245Z",
    "createdBy": {
      "username": "ColderThanSeptember",
      "url": "https://www.codewars.com/users/ColderThanSeptember"
    },
    "description": "'In microeconomics, supply and demand is an economic model of price determination in a market. It postulates that, holding all else equal, in a competitive market, the unit price for a particular good, or other traded item such as labor or liquid financial assets, will vary until it settles at a point where the quantity demanded (at the current price) will equal the quantity supplied (at the current price), resulting in an economic equilibrium for price and quantity transacted. It forms the theoretical basis of modern economics.' - Wikipedia\n\n![Supply and Demand](https://www.economicshelp.org/wp-content/uploads/2009/09/sd.png.webp)\nDiagram Credit goes to www.economicshelp.org\n\n\nThe D or Demand Curve implies that the cheaper the price of something the more of it that will be bought, and the more expensive something is the less that will be bought. Which is fairly intuitive if you think it over. It can be mathematically described as PED x Q + DYI = P \n\nThe S or Supply Curve on the other hand implies that the higher the price of something, the more the supplier will be willing to supply of the good. This is because when prices rise, it becomes more profitable for a supplier to produce a good, so they produce more. Similarly, when prices fall it becomes less profitable for a supplier to produce a good, so they produce less. It can be mathematically descibed as PES x Q + SYI = P\n\nWhere these two lines meet is called equilibrium. This is because the price and quantity produced is stable and producers and consumers buy and sell for the same price and the same quantity. \n\nYour task is to find the equilibrium based off the gradient (or price elasticities) and y axis intercept of the Supply and Demand Curve.\n\nThe inputs will be the Price Elasticity of Supply (or gradient of the supply curve), Supply Curve Y Intercept, Price Elasticity of Demand (or gradient of the demand Curve) and the Demand Curve Y Intercept.\n\nReturn None if the quantity is less than or equal to zero. This is because suppliers do not see it worth while to supply the good at all. However it is possible for there to be a negative price. See https://en.wikipedia.org/wiki/Negative_pricing\n\nNote that PED will always be negative and PES will always be positive, therefore you don't have to worry about ZeroDivisionError for your solution.",
    "totalAttempts": 91,
    "totalCompleted": 19,
    "totalStars": 2,
    "voteScore": 14,
    "tags": [
      "Graphs",
      "Mathematics"
    ],
    "contributorsWanted": true,
    "unresolved": {
      "issues": 1,
      "suggestions": 0
    }
  },
  "error": null,
  "isValid": false,
  "validationErrors": [
    {
      "path": "approvedBy",
      "message": "Required field 'approvedBy' is missing"
    },
    {
      "path": "rank.id",
      "message": "Expected integer, got object (not integer)"
    },
    {
      "path": "rank.name",
      "message": "Expected type 'string', got 'object'"
    },
    {
      "path": "rank.color",
      "message": "Expected type 'string', got 'object'"
    },
    {
      "path": "approvedBy",
      "message": "Required field 'approvedBy' is missing"
    },
    {
      "path": "approvedAt",
      "message": "Expected type 'string', got 'object'"
    }
  ]
}