{
  "id": "525fbff0594da0665c0003a3",
  "name": "Conway's Game of Life",
  "slug": "conways-game-of-life",
  "category": "games",
  "publishedAt": "2013-10-17T16:08:00.333Z",
  "approvedAt": "2013-12-26T02:02:54.255Z",
  "languages": [
    "javascript",
    "python",
    "ruby",
    "php",
    "c",
    "cobol",
    "julia"
  ],
  "url": "https://www.codewars.com/kata/525fbff0594da0665c0003a3",
  "rank": {
    "id": -5,
    "name": "5 kyu",
    "color": "yellow"
  },
  "createdAt": "2013-10-17T10:46:08.593Z",
  "createdBy": {
    "username": "ssineriz",
    "url": "https://www.codewars.com/users/ssineriz"
  },
  "approvedBy": {
    "username": "jhoffner",
    "url": "https://www.codewars.com/users/jhoffner"
  },
  "description": "<p>In this finite version of <a href=\"http://en.wikipedia.org/wiki/Conway's_Game_of_Life\">Conway's Game of Life</a>  (here is an excerpt of the rules) ... </p>\n<p>\n<i>\nThe universe of the Game of Life is an infinite two-dimensional orthogonal grid of square cells, each of which is in one of two possible states, alive or dead. \nEvery cell interacts with its eight neighbours, which are the cells that are horizontally, vertically, or diagonally adjacent. At each step in time, the following transitions occur:\n<ul>\n<li>Any live cell with fewer than two live neighbours dies, as if caused by under-population.</li>\n<li>Any live cell with two or three live neighbours lives on to the next generation.</li>\n<li>Any live cell with more than three live neighbours dies, as if by overcrowding.</li>\n<li>Any dead cell with exactly three live neighbours becomes a live cell, as if by reproduction.</li>\n</ul>\nThe initial pattern constitutes the seed of the system. The first generation is created by applying the above rules simultaneously to every cell in the seed—births and deaths occur simultaneously, and the discrete moment at which this happens is sometimes called a tick (in other words, each generation is a pure function of the preceding one)\n</i>\n</p>\n...implement your own method which will take the initial state as an NxM array of 0's (dead cell) and 1's (living cell) and return an equally sized array representing the next generation. Cells outside the array must be considered dead.\nCells that would born out of the array boundaries should be ignored (universe never grows beyond the initial NxM grid).<br/> N.B.: for illustration purposes, 0 and 1 will be represented as ░ and ▓ blocks (PHP: basic black and white squares) respectively. You can take advantage of the 'htmlize' function to get a text representation of the universe:<br/>eg:\n\n```javascript\nconsole.log(htmlize(cells));\n```\n```python\nprint htmlize(cells)\n```\n```ruby\nputs htmlize(cells)\n```\n```php\necho htmlize($cells) . \"\\r\\n\";\n```\n```julia\nprint(htmlize(cells))\n```",
  "totalAttempts": 31170,
  "totalCompleted": 2382,
  "totalStars": 365,
  "voteScore": 371,
  "tags": [
    "Games",
    "Graphics",
    "Puzzles",
    "Cellular Automata"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}