{
  "id": "52761ee4cffbc69732000738",
  "name": "Good vs Evil",
  "slug": "good-vs-evil",
  "category": "algorithms",
  "publishedAt": "2013-11-03T11:20:12.449Z",
  "approvedAt": "2013-11-19T22:01:37.737Z",
  "languages": [
    "javascript",
    "python",
    "ruby",
    "csharp",
    "swift",
    "rust",
    "java",
    "scala",
    "lua"
  ],
  "url": "https://www.codewars.com/kata/52761ee4cffbc69732000738",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2013-11-03T10:01:08.796Z",
  "createdBy": {
    "username": "Frzy",
    "url": "https://www.codewars.com/users/Frzy"
  },
  "approvedBy": {
    "username": "jhoffner",
    "url": "https://www.codewars.com/users/jhoffner"
  },
  "description": "# Description\n\nMiddle Earth is about to go to war.  The forces of good will have many battles with the forces of evil. Different races will certainly be involved.  Each race has a certain `worth` when battling against others. On the side of good we have the following races, with their associated `worth`:\n\n* Hobbits: 1\n* Men: 2\n* Elves: 3\n* Dwarves: 3\n* Eagles: 4\n* Wizards: 10\n\nOn the side of evil we have:\n\n* Orcs: 1\n* Men: 2\n* Wargs: 2\n* Goblins: 2\n* Uruk Hai: 3\n* Trolls: 5\n* Wizards: 10\n\nAlthough weather, location, supplies and valor play a part in any battle, if you add up the worth of the side of good and compare it with the worth of the side of evil, the side with the larger worth will tend to win.\n\nThus, given the count of each of the races on the side of good, followed by the count of each of the races on the side of evil, determine which side wins.\n\n# Input:\n\nThe function will be given two parameters.  Each parameter will be a string of multiple integers separated by a single space.  Each string will contain the count of each race on the side of good and evil.\n\nThe first parameter will contain the count of each race on the side of good in the following order:\n\n* Hobbits, Men, Elves, Dwarves, Eagles, Wizards.\n\nThe second parameter will contain the count of each race on the side of evil in the following order:\n\n* Orcs, Men, Wargs, Goblins, Uruk Hai, Trolls, Wizards.\n\nAll values are non-negative integers. The resulting sum of the worth for each side will not exceed the limit of a 32-bit integer.\n\n# Output:\n\nReturn `\"Battle Result: Good triumphs over Evil\"` if good wins, `\"Battle Result: Evil eradicates all trace of Good\"` if evil wins, or `\"Battle Result: No victor on this battle field\"` if it ends in a tie.",
  "totalAttempts": 142029,
  "totalCompleted": 28166,
  "totalStars": 910,
  "voteScore": 2514,
  "tags": [
    "Algorithms"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 2,
    "suggestions": 2
  }
}