{
  "id": "52962fcbdbad8fa3c900076a",
  "name": "Sting like a bee, float like a sponge?",
  "slug": "sting-like-a-bee-float-like-a-sponge",
  "category": "games",
  "publishedAt": "2013-11-27T19:50:44.251Z",
  "approvedAt": "2018-02-20T08:25:36.779Z",
  "languages": [
    "ruby",
    "python"
  ],
  "url": "https://www.codewars.com/kata/52962fcbdbad8fa3c900076a",
  "rank": {
    "id": -4,
    "name": "4 kyu",
    "color": "blue"
  },
  "createdAt": "2013-11-27T17:45:47.916Z",
  "createdBy": {
    "username": "acsellers",
    "url": "https://www.codewars.com/users/acsellers"
  },
  "approvedBy": {
    "username": "ZED.CWT",
    "url": "https://www.codewars.com/users/ZED.CWT"
  },
  "description": "You and your friend created the next great FaceSpace game, SpongeSqueezer! Now if the users would only discover the game and keep playing it, you would be a multi-millionaire. \n\nAfter an argument with your friend/partner over the game's quality after the lackluster first day statistics became apparent, you go to sleep for the night while your partner works on some mysterious project. The next morning, you find an email from your partner giving you some bad news. \n\n\nHey buddy,\n\nAfter last night, I went back and checked the stats for who was putting in the work over the last 2 months, and was fairly disgusted by your numbers. However I'm willing to chalk it up to burnout and your breakup with Rachel.\n\nAccording to our contract and the current commit statistics, I'll get 100% of SpongeSqueezer if we have to break up. I'll have to buy you out, but at the moment, I could do it anytime in the next week for $20. Again, I'm giving you the chance to prove your skills, so please take this seriously.\n\nAll of our players have a credit amount in the database that they can use to buy new sponges.  Just a simple integer value, limited to a few thousand. I've obfuscated the values, but the values are 100% recoverable. I've sent 10 examples with this email for you to puzzle out. If you can puzzle out the mechanism I've used to obfuscate the values, I'm willing to give our partnership more time to grow.\n\nJoe\n\nP.S. One zero is worth up to 8.\n\n| Original Credit | Obfuscated Value |\n|-----------------|------------------|\n| -750            | \"803BC4\"         |\n| -10             | \"20C1\"           |\n| 0               | \"0\"              |\n| 5               | \"A040\"           |\n| 8               | \"41\"             |\n| 10              | \"2041\"           |\n| 15              | \"7041\"           |\n| 70              | \"8C42\"           |\n| 100             | \"C842\"           |\n| 750             | \"803B44\"         |\n\n  ",
  "totalAttempts": 4529,
  "totalCompleted": 63,
  "totalStars": 28,
  "voteScore": 24,
  "tags": [
    "Puzzles"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}