{
  "id": "52d9b893b2fcb0b76c000029",
  "name": "Movie Agent",
  "slug": "movie-agent",
  "category": "algorithms",
  "publishedAt": "2014-01-17T23:11:31.032Z",
  "approvedAt": "2014-10-07T18:48:39.196Z",
  "languages": [
    "javascript"
  ],
  "url": "https://www.codewars.com/kata/52d9b893b2fcb0b76c000029",
  "rank": {
    "id": -5,
    "name": "5 kyu",
    "color": "yellow"
  },
  "createdAt": "2014-01-17T23:11:15.300Z",
  "createdBy": {
    "username": "jlordiales",
    "url": "https://www.codewars.com/users/jlordiales"
  },
  "approvedBy": {
    "username": "jhoffner",
    "url": "https://www.codewars.com/users/jhoffner"
  },
  "description": "You are a hollywood agent who has several high profile stars to manage. Because of your high reputation and the quality of your actors, you receive tons of different offers.\n\nEach offer specifies the name of the movie, the start date and the end date of filming. For simplicity, in this kata all dates are just integers and follow the natural order. This means that a movie with start date of 15 starts before a movie with start date of 18 for example.\n\nBecause these offers are coming from different studios, some of them may overlap on their starting and ending dates. Since they film the entire day, an actor can never work on two overlapping movies at the same time.\n\nYour actors are willing to work on any of those movies because they all pay the same. Your job as their agent is to make sure that they work on as many films as possible to maximize their earnings and, in turn, yours.\n\nWrite a function 'schedule' that takes an array of movies and returns the maximum amount of movies that an actor could take considering that he can not work on two overlapping movies.\n\nYou already have the following function to represent the movie information:\n\n``` javascript\nfunction Movie(name,start,end) {\n  this.name = name;\n  this.start = start;\n  this.end = end;\n}\n```\nYou can assume that all input values are valid. That is, every movie has a 'start' and 'end' and the former is always smaller than the latter.\n\nFor instance, given the movies:\n```\nJava Joe => start 0, end 60\nLooking for Clojure => start 1, end 5\nI C You => start 6, end 10\nRuby Park => start 11, end 14\n```\n\nThe first movies overlaps with the remaining ones. The function should return 3 because the best option would be for the actor to work on the last three films.\n\nThe function should return 0 if no movies are passed and 1 if only one movie is present.",
  "totalAttempts": 1414,
  "totalCompleted": 191,
  "totalStars": 17,
  "voteScore": 48,
  "tags": [
    "Scheduling",
    "Algorithms"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}