{
  "id": "5416d02d932c1df3a3000492",
  "name": "Simple AKS Primality Test",
  "slug": "simple-aks-primality-test",
  "category": "reference",
  "publishedAt": "2014-09-16T12:50:39.513Z",
  "approvedAt": "2014-12-08T16:49:17.244Z",
  "languages": [
    "python",
    "javascript",
    "ruby"
  ],
  "url": "https://www.codewars.com/kata/5416d02d932c1df3a3000492",
  "rank": {
    "id": -5,
    "name": "5 kyu",
    "color": "yellow"
  },
  "createdAt": "2014-09-15T11:40:29.143Z",
  "createdBy": {
    "username": "user3482173",
    "url": "https://www.codewars.com/users/user3482173"
  },
  "approvedBy": {
    "username": "jhoffner",
    "url": "https://www.codewars.com/users/jhoffner"
  },
  "description": "The AKS algorithm for testing whether a number is prime is a polynomial-time test based on the following theorem: \n\nA number p is prime if and only if all the coefficients of the polynomial expansion of `(x − 1)^p − (x^p − 1)` are divisible by `p`.\n\nFor example, trying `p = 3`:\n\n     (x − 1)^3 − (x^3 − 1) = (x^3 − 3x^2 + 3x − 1) − (x^3 − 1) = − 3x^2 + 3x \n    \nAnd all the coefficients are divisible by 3, so 3 is prime.\n\nYour task is to code the test function, wich will be given an integer and should return true or false based on the above theorem. You should efficiently calculate every coefficient one by one and stop when a coefficient is not divisible by p to avoid pointless calculations. The easiest way to calculate coefficients is to take advantage of binomial coefficients: http://en.wikipedia.org/wiki/Binomial_coefficient and pascal triangle: http://en.wikipedia.org/wiki/Pascal%27s_triangle . \n\nYou should also take advantage of the symmetry of binomial coefficients. You can look at these kata: http://www.codewars.com/kata/pascals-triangle and http://www.codewars.com/kata/pascals-triangle-number-2\n\nThe kata here only use the simple theorem. The general AKS test is way more complex.  The simple approach is a good exercie but impractical. The general AKS test will be the subject of another kata as it is one of the best performing primality test algorithms.\n\nThe main problem of this algorithm is the big numbers emerging from binomial coefficients in the polynomial expansion. As usual Javascript reach its limit on big integer very fast. (This simple algorithm is far less performing than a trivial algorithm here). You can compare the results with those of this kata: http://www.codewars.com/kata/lucas-lehmer-test-for-mersenne-primes Here, javascript can barely treat numbers bigger than 50, python can treat M13 but not M17.\n\n\n\n",
  "totalAttempts": 4596,
  "totalCompleted": 309,
  "totalStars": 52,
  "voteScore": 18,
  "tags": [
    "Mathematics",
    "Algorithms",
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 2,
    "suggestions": 0
  }
}