{
  "id": "546d15cebed2e10334000ed9",
  "name": "Find the unknown digit",
  "slug": "find-the-unknown-digit",
  "category": "games",
  "publishedAt": "2014-11-20T05:25:08.613Z",
  "approvedAt": "2016-11-05T15:00:55.672Z",
  "languages": [
    "java",
    "csharp",
    "javascript",
    "python",
    "php",
    "groovy",
    "coffeescript",
    "elixir",
    "scala",
    "rust",
    "lua"
  ],
  "url": "https://www.codewars.com/kata/546d15cebed2e10334000ed9",
  "rank": {
    "id": -4,
    "name": "4 kyu",
    "color": "blue"
  },
  "createdAt": "2014-11-19T22:12:30.057Z",
  "createdBy": {
    "username": "JJ-Bug",
    "url": "https://www.codewars.com/users/JJ-Bug"
  },
  "approvedBy": {
    "username": "user5036852",
    "url": "https://www.codewars.com/users/user5036852"
  },
  "description": "To give credit where credit is due: This problem was taken from the ACMICPC-Northwest Regional Programming Contest. Thank you problem writers.\n\nYou are helping an archaeologist decipher some runes. He knows that this ancient society used a Base 10 system, and that they never start a number with a leading zero. He's figured out most of the digits as well as a few operators, but he needs your help to figure out the rest.\n\nThe professor will give you a simple math expression, of the form\n\n```\n[number][op][number]=[number]\n```\n\nHe has converted all of the runes he knows into digits. The only operators he knows are addition (`+`),subtraction(`-`), and multiplication (`*`), so those are the only ones that will appear. Each number will be in the range from -1000000 to 1000000, and will consist of only the digits 0-9, possibly a leading -, and maybe a few ?s. If there are ?s in an expression, they represent a digit rune that the professor doesn't know (never an operator, and never a leading -). All of the ?s in an expression will represent the same digit (0-9), and it won't be one of the other given digits in the expression. No number will begin with a 0 unless the number itself is  0, therefore 00 would not be a valid number. \n\nGiven an expression, figure out the value of the rune represented by the question mark. If more than one digit works, give the lowest one. If no digit works, well, that's bad news for the professor - it means that he's got some of his runes wrong. output -1 in that case.\n\nComplete the method to solve the expression to find the value of the unknown rune. The method takes a string as a paramater repressenting the expression and will return an int value representing the unknown rune or -1 if no such rune exists.\n\n~~~if:php\n**Most of the time, the professor will be able to figure out most of the runes himself, but sometimes, there may be exactly 1 rune present in the expression that the professor cannot figure out (resulting in all question marks where the digits are in the expression) so be careful ;)**\n~~~",
  "totalAttempts": 122585,
  "totalCompleted": 8813,
  "totalStars": 1018,
  "voteScore": 996,
  "tags": [
    "Mathematics",
    "Algorithms",
    "Puzzles"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 4,
    "suggestions": 7
  }
}