{
  "id": "55332880e679dd9cb3000081",
  "name": "Bocce",
  "slug": "bocce",
  "category": "algorithms",
  "publishedAt": "2015-04-19T04:01:12.207Z",
  "approvedAt": "2018-10-18T20:30:55.120Z",
  "languages": [
    "ruby",
    "javascript",
    "python"
  ],
  "url": "https://www.codewars.com/kata/55332880e679dd9cb3000081",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2015-04-19T04:01:05.065Z",
  "createdBy": {
    "username": "dnolan",
    "url": "https://www.codewars.com/users/dnolan"
  },
  "approvedBy": {
    "username": "FArekkusu",
    "url": "https://www.codewars.com/users/FArekkusu"
  },
  "description": "## Bocce Description\n\nBocce is a game played by two competing teams, with three types of balls. Each team has its own set of balls (in this kata `red` and `black`) and there is a neutral ball called the `jack`. The jack is thrown at the beginning of each round, followed by the players trying to throw their balls as closely to it as possible. The team with their balls closest to the jack wins the round! \n\nThe number of points the winning team scores equals the number of their balls being closer to jack than any of the other team's balls: if the red team has 3 balls closer to jack than any of the black team's balls, they will win scoring 3 points. Equidistant balls on opposing teams will cancel out and neither team will score beyond that point. \n\nFor more information on Bocce [see here](http://en.wikipedia.org/wiki/Bocce).\n\n___\n\n## Your task\n\nImplement a function that will return a message indicating the winner of the round. If there's no winner, return the string `\"No points scored\"`.\n\nIt takes an array of `balls` that are hash tables (depending on your language). Each ball has 2 properties: `type` and `distance`. \n\nThe `type` will be `\"red\"`, `\"black\"`, or `\"jack\"`. For all test cases, **the jack will be the last element** on the `balls` array. The `distance` property will be an array with two integer values. The first value is the distance thrown forward, the second value is the distance thrown left or right (negative values indicate distance to the left). For the purposes of this Kata, all balls are thrown from the same initial point.",
  "totalAttempts": 2787,
  "totalCompleted": 254,
  "totalStars": 14,
  "voteScore": 92,
  "tags": [
    "Puzzles",
    "Algorithms"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}