{
  "id": "55d1d06def244b18c100007c",
  "name": "Shop Inventory Manager",
  "slug": "shop-inventory-manager",
  "category": "bug_fixes",
  "publishedAt": "2015-08-17T13:19:00.131Z",
  "approvedAt": "2016-03-18T20:44:21.611Z",
  "languages": [
    "javascript",
    "python",
    "ruby",
    "haskell",
    "java"
  ],
  "url": "https://www.codewars.com/kata/55d1d06def244b18c100007c",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2015-08-17T12:15:41.580Z",
  "createdBy": {
    "username": "GiacomoSorbi",
    "url": "https://www.codewars.com/users/GiacomoSorbi"
  },
  "approvedBy": {
    "username": "raulbc777",
    "url": "https://www.codewars.com/users/raulbc777"
  },
  "description": "Hi and welcome to team Gilded Rose.\n\nYou are asked to fix the code for our store management system.\n\nAll items have a `sell_in` value which denotes the number of days we have left to sell the item and a `quality` value which denotes how valuable the item is. (For Java specifics see ** Java Notes ** below)\n\nAt the end of each day our software should lower both values for every item.\n\nPretty simple, right? Well this is just the general rule with some exception:\n\n* once the sell_in days is less then zero, quality degrades twice as fast;\n* the quality of an item can never be negative or increase beyond 50;\n* the _\"Aged Brie\"_ goods actually increases in quality each passing day;\n* _\"Sulfuras\"_ goods, being legendary items, never change their sell_in or quality values;\n* _\"backstage passes\"_, like aged brie, increases in quality as it's sell_in value decreases;\n* not just that: for _\"backstage passes\"_ quality increases by 2 when there are 10 days or less and by 3 when there are 5 days or less but quality drops to 0 after the concert (sell_in 0 or lower).\n\nComplicated enough, now? Well, there is a new item category that we would like to see added to the inventory management system:\n\n* _\"Conjured\"_ items degrade in quality twice as fast as normal items.\n\nYou can change the update_quality method, add any new code, but you should NOT edit the item constructor/class: it belong to the goblin in the corner who will insta-rage and one-shot you as he doesn't believe in shared code ownership.\n\nJust for extra clarification, an item can never have its quality increase above 50, however \"Sulfuras\" is a legendary item and as such its quality is 80 and it never alters.\n\nYou won't find mixed categories (like a \"Conjured Sulfuras Backstage pass of Doom\"), but the category name may be not in the first position (ie: expect something like \"SuperUberSword, Conjured\" or \"Mighty Sulfuras Armour of Ultimate Awesomeness\").\n\n** Java Notes **\n\n* `sell_in` value can be accessed using `getSellIn()` and `setSellIn()` methods\n* `quality` value can be accessed using `getQuality()` and `setQuality()` methods\n\n***************************\n\nPersonal note: I was recently asked during an interview to solve a relatively simple, yet interesting problem, original taken from [here](https://github.com/emilybache/GildedRose-Refactoring-Kata).\n\nAs I was apparently scouted thanks to CodeWars, I think the bare minimum I could do to give back to the community was to turn this idea into a bug-fixes kata, with some small twists added to the original they showed me :)",
  "totalAttempts": 12647,
  "totalCompleted": 295,
  "totalStars": 92,
  "voteScore": 44,
  "tags": [
    "Debugging"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 5,
    "suggestions": 2
  }
}