{
  "id": "55fc061cc4f485a39900001f",
  "name": "Strange principal",
  "slug": "strange-principal",
  "category": "reference",
  "publishedAt": "2015-09-18T12:40:02.322Z",
  "approvedAt": "2015-10-11T00:08:13.864Z",
  "languages": [
    "javascript",
    "ruby",
    "python",
    "coffeescript",
    "haskell",
    "cobol",
    "sql",
    "c"
  ],
  "url": "https://www.codewars.com/kata/55fc061cc4f485a39900001f",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2015-09-18T12:39:57.281Z",
  "createdBy": {
    "username": "bereket2015",
    "url": "https://www.codewars.com/users/bereket2015"
  },
  "approvedBy": {
    "username": "GiacomoSorbi",
    "url": "https://www.codewars.com/users/GiacomoSorbi"
  },
  "description": "A high school has a strange principal. On the first day, he has his students perform an odd opening day ceremony:\n\nThere are number of lockers \"n\" and number of students \"n\" in the school. The principal asks the first student to go to every locker and open it. Then he has the second student go to every second locker and close it. The third goes to every third locker and, if it is closed, he opens it, and if it is open, he closes it. The fourth student does this to every fourth locker, and so on. After the process is completed with the \"n\"th student, how many lockers are open?\n\nThe task is to write a function which gets any number as an input and returns the number of open lockers after last sudent complets his activity. So input of the function is just one number which shows number of lockers and number of students. For example if there are 1000 lockers and 1000 students in school then input is 1000 and function returns number of open lockers after 1000th student completes his action.\n\nThe given input is always an integer greater than or equal to zero that is why there is no need for validation.\n",
  "totalAttempts": 6369,
  "totalCompleted": 1460,
  "totalStars": 71,
  "voteScore": 152,
  "tags": [
    "Mathematics",
    "Algorithms",
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 1
  }
}