{
  "id": "55fce4dd28b5cb780000006d",
  "name": "Find me the names",
  "slug": "find-me-the-names",
  "category": "reference",
  "publishedAt": "2015-09-21T04:03:09.210Z",
  "approvedAt": "2017-11-08T08:20:47.871Z",
  "languages": [
    "javascript"
  ],
  "url": "https://www.codewars.com/kata/55fce4dd28b5cb780000006d",
  "rank": {
    "id": -5,
    "name": "5 kyu",
    "color": "yellow"
  },
  "createdAt": "2015-09-19T04:30:22.085Z",
  "createdBy": {
    "username": "JMurphyWeb",
    "url": "https://www.codewars.com/users/JMurphyWeb"
  },
  "approvedBy": {
    "username": "smile67",
    "url": "https://www.codewars.com/users/smile67"
  },
  "description": "#Overview\n\nThis function is supposed to take a string input containing 0 or more names as well as some text. It should locate all of the names and return them in the form of an array.\n\nEach person's name will be listed in the form \"Name: sub-name1 sub-name2 sub-name3;\".  There will be between 1 and 3 sub-names for each person's \"Name:\" and the final subname will always be followed by a \";\".\n\n##A person's Name:\n\n* Can be located in the input text by: \"Name: name-here;\"\n* A name is made up of 1 to 3 subnames\n\n* A sub-name is made up of one or more upper or lowercase letters\n\n* However, a sub-name may be double barralled and can therefore contain a dash \"-\" between two sub-strings of alphabetic characters only. So \"Name: Tony-Joe anDy robERT;\" has first sub-name \"Tony-Joe\" and last sub-name \"Robert\"\n\n* If a sub-name begins or ends with a dash \"-\", it should be considered a mistake and removed from the returned name. So \"Name: -barack -obaMa-;\" has first sub-name \"Barack\" and last sub-name \"Obama\"\n\n##To be returned:\nAn array whose elements correspond to each person's first sub-name and, if they have more than one sub-name, then also their last sub-name.\n\n* One array element represents one person's name\n* Each element should be of the form: \"Last sub-name, first sub-name\"\n* If a person's name is made up of just one sub-name, the element should simply be \"first sub-name\"\n* Capitalize first letter of each sub-name including double barralled names\n* The rest of the letters should be lower case\n* If there are no legitimate names in the input, then an empty array should be returned \n\n\n##Some examples:\n\n\n```javascript\ngetNames(\"Here is one person. Name: MarilYN MONroe;\") \n=> [\"Monroe, Marilyn\"]\n\ngetNames(\"Now we have 2 people.. Name: john fitzgerald kennedy; Name: STING;\") \n=> [\"Kennedy, John\", \"Sting\"]\n\ngetNames(\"Here is one name. Name: -voldemort-; and then we can add two more names. Name: ian BAKER-finch; Name: -Tara -jess -Palmer-Thompkinson;\")\n=> [\"Voldemort\", \"Baker-Finch, Ian\", \"Palmer-Thompkinson, Tara\"]\n```",
  "totalAttempts": 936,
  "totalCompleted": 116,
  "totalStars": 14,
  "voteScore": 59,
  "tags": [
    "Regular Expressions",
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}