{
  "id": "570564e838428f2eca001d73",
  "name": "Chuck Norris I - Push Ups",
  "slug": "chuck-norris-i-push-ups",
  "category": "algorithms",
  "publishedAt": "2016-04-09T09:59:17.100Z",
  "approvedAt": "2016-06-08T14:52:46.699Z",
  "languages": [
    "javascript",
    "coffeescript",
    "julia",
    "python",
    "cpp",
    "lua"
  ],
  "url": "https://www.codewars.com/kata/570564e838428f2eca001d73",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2016-04-06T19:35:05.586Z",
  "createdBy": {
    "username": "PG1",
    "url": "https://www.codewars.com/users/PG1"
  },
  "approvedBy": {
    "username": "donaldsebleung",
    "url": "https://www.codewars.com/users/donaldsebleung"
  },
  "description": "Chuck Norris loves push ups. That's just a fact. It has been said that when Chuck Norris does a push up, he isn't pushing himself up, he's pushing the world down!\n\nToday, Chuck got home from work 10 minutes earlier than his wife. Naturally he decided to bang out some push ups. By the time she arrives home he can have smashed out at least 1000 and barely broken a sweat. He counts them in binary, because he thinks coding is cool, and because he is a massive Badass.\n\nWhen his wife arrives home, she starts talking to Chuck, spoiling his count! Your job is to write a function to isolate Chuck's count, and then work out how many push ups he has done! Return your answer as a number.\n\nCareful Chuck doesn't lose count! Even if he does, always return the highest number he counted to! If Chuck's wife has left a list of jobs for him he won't be able to do any push ups... if there is no sign of a count, simply return \"CHUCK SMASH!!\"\n\nIn the event someone dares to provide Chuck with something other than a string, return 'FAIL!!'\n\nin [C++] when numbers not exists in input string then return `-1` all time.\n\nYour code should still pass in the case that the binary is mixed up with other characters - maybe Chuck has a cough... \ne.g.: \"1ee1gf00t10h1011tr00\" -> \"110010101100\" -> 3244.\n\nFeel the burn!!",
  "totalAttempts": 15916,
  "totalCompleted": 1150,
  "totalStars": 50,
  "voteScore": 148,
  "tags": [
    "Fundamentals",
    "Binary",
    "Regular Expressions",
    "Algorithms"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 2,
    "suggestions": 2
  }
}