{
  "id": "571d0c80eed4a1c850000ef2",
  "name": "Pete's inappropriate speech",
  "slug": "petes-inappropriate-speech",
  "category": "algorithms",
  "publishedAt": "2016-04-24T19:41:42.647Z",
  "approvedAt": "2016-08-08T08:33:22.478Z",
  "languages": [
    "javascript",
    "ruby",
    "python",
    "csharp"
  ],
  "url": "https://www.codewars.com/kata/571d0c80eed4a1c850000ef2",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2016-04-24T18:12:16.415Z",
  "createdBy": {
    "username": "GiacomoSorbi",
    "url": "https://www.codewars.com/users/GiacomoSorbi"
  },
  "approvedBy": {
    "username": "user5036852",
    "url": "https://www.codewars.com/users/user5036852"
  },
  "description": "Our friendly friend Pete is really a nice person, but he tends to be rather... Inappropriate.\n\nAnd possibly loud, if given enough ethanol and free rein, so we ask you to write a function that should take its not always \"clean\" speech and cover as much as possible of it, in order not to offend some more sensible spirits.\n\nFor example, given an input like\n```\nWhat the hell am I doing here? And where is my wallet? PETE SMASH!\n```\nYou are expected to turn it into something like:\n```\nW**t t*e h**l am i d***g h**e? A*d w***e is my w****t? P**e s***h!\n```\nIn case you didn't figure out the rules yet: any words longer than 2 characters need to have its \"inside\" (meaning every character which is not the first or the last) changed into `*`;  as we do not want Pete to scream too much, every uppercase letter which is not at the beginning of the string or coming after a punctuation mark among `.!?` needs to be put to lowercase; spaces and other punctuation marks can be ignored.\n\n\nConversely, you need to be sure that the start of each sentence has a capitalized word at the beginning. Sentences are divided by the aforementioned punctuation marks.\n\nFinally, the function will take an additional parameter consisting of an array/list of allowed words (upper or lower case) which are not to be replaced (the match has to be case insensitive).\n\nExtra cookies if you can do it all in some efficient way and/or using our dear regexes ;)\n\n**Note:** Absolutely not related to [a certain codewarrior I know](http://www.codewars.com/users/petegarvin1) :p",
  "totalAttempts": 5592,
  "totalCompleted": 388,
  "totalStars": 50,
  "voteScore": 129,
  "tags": [
    "Regular Expressions",
    "Strings",
    "Algorithms"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 1,
    "suggestions": 0
  }
}