{
  "id": "574c51aa3e4ea6de22001363",
  "name": "Sir , showMe  yourID ",
  "slug": "sir-showme-yourid",
  "category": "reference",
  "publishedAt": "2016-06-06T10:30:03.445Z",
  "approvedAt": "2016-06-12T08:20:05.972Z",
  "languages": [
    "javascript",
    "python",
    "ruby",
    "coffeescript"
  ],
  "url": "https://www.codewars.com/kata/574c51aa3e4ea6de22001363",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2016-05-30T14:43:54.252Z",
  "createdBy": {
    "username": "gomesalexandre",
    "url": "https://www.codewars.com/users/gomesalexandre"
  },
  "approvedBy": {
    "username": "donaldsebleung",
    "url": "https://www.codewars.com/users/donaldsebleung"
  },
  "description": "There's a new security company in Paris, and they decided to give their employees an algorithm to make first name recognition faster. In the blink of an eye, they can now detect if a string is a first name, no matter if it is a one-word name or an hyphenated name. They're given this documentation with the algorithm: \n\n*In France, you'll often find people with hyphenated first names. They're called \"prénoms composés\".\nThere could be two, or even more words linked to form a new name, quite like jQuery function chaining ;). \nThey're linked using the - symbol, like Marie-Joelle, Jean-Michel, Jean-Mouloud. \nThanks to this algorithm, you can now recognize hyphenated names quicker than Flash !* \n(yeah, their employees know how to use jQuery. Don't ask me why)\n\n\nYour mission if you accept it, recreate the algorithm.\nUsing the function **showMe**, which takes a **yourID** argument, you will check if the given argument is a name or not, by returning true or false. \n\n*Note that*\n\n- String will either be a one-word first name, or an hyphenated first name , its words being linked by \"-\". \n- Words can only start with an uppercase letter, and then lowercase letters (from a to z)\n\n\nNow is your time to help the guards !",
  "totalAttempts": 9136,
  "totalCompleted": 1375,
  "totalStars": 39,
  "voteScore": 221,
  "tags": [
    "Regular Expressions",
    "Strings",
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 2,
    "suggestions": 1
  }
}