{
  "id": "575eac1f484486d4600000b2",
  "name": "Statistics in Kata 1: OR case - Unfair dice",
  "slug": "statistics-in-kata-1-or-case-unfair-dice",
  "category": "games",
  "publishedAt": "2016-06-22T08:28:54.990Z",
  "approvedAt": "2017-01-13T14:58:26.783Z",
  "languages": [
    "javascript",
    "python",
    "ruby"
  ],
  "url": "https://www.codewars.com/kata/575eac1f484486d4600000b2",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2016-06-13T12:50:39.747Z",
  "createdBy": {
    "username": "powderham",
    "url": "https://www.codewars.com/users/powderham"
  },
  "approvedBy": {
    "username": "tachyonlabs",
    "url": "https://www.codewars.com/users/tachyonlabs"
  },
  "description": "The purpose of this series is developing understanding of statistical problems in AS and A level maths. Let's get started with a simple concept in statistics: Mutually exclusive events.\n\nThe probability of an OR event is calculated by the following rule:\n\n`P(A || B) = P(A) + P(B) - P(A && B)`\n\nThe probability of event A or event B happening is equal to the probability of event A plus the probability of event B minus the probability of event A and event B happening simultaneously.\n\nMutually exclusive events are events that cannot happen at the same time. For example, the head and tail results of a coin toss are mutually exclusive because they can't both happen at once. Thus, the above example for a coin toss would look like this:\n\n`P(H || T) = P(H) + P(T) - P(H && T)`\n\nNote that the probability of tossing a coin and the result being both heads and tails is 0.\n\n`P(H || T) = (0.5) + (0.5) - (0)`\n`P(H || T) = 1`\n\nThus the probability of a coin toss result being a heads or a tails is 1, in other words: certain.\n\n\nYour task:\n\nYou are going to have to work out the probability of one roll of a die returning two given outcomes, or rolls. Given that dice rolls are mutually exclusive, you will have to implement the above formula. To make this interesting (this is a coding challenge after all), these dice are not fair and thus the probabilities of receiving each roll are different.\n\nYou will be given a two-dimensional array containing the number of each of the results (1-6) of the die and the probability of that roll for example `[1 , 0.23]` as well as the two rolls, for example `1` and `5`. \n\nGiven the two roll probabilities to calculate, return the probability of a single roll of the die returning <i>either</i>. If the total probability of the six rolls doesn't add up to one, there is a problem with the die; in this case, return null. \n<i>Return your result as a string to two decimal places.</i>\n\nExample below:\n\n`1 : 1/6`\n\n`2 : 1/6`\n\n`3 : 1/6`\n\n`4 : 1/6`\n\n`5 : 1/6`\n\n`6 : 1/6`\n\nIf asked for the rolls `1` and `2` then you would need to sum the probabilities, both `1/6` therefore `2/6` and return this. As above, you will need to return it as a decimal and not a  fraction.\n\n",
  "totalAttempts": 1433,
  "totalCompleted": 384,
  "totalStars": 22,
  "voteScore": 54,
  "tags": [
    "Probability",
    "Statistics"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 2,
    "suggestions": 1
  }
}