{
  "id": "57b64d9eb69bfc8209000160",
  "name": "Hello Kitty",
  "slug": "hello-kitty",
  "category": "reference",
  "publishedAt": "2016-08-19T13:30:47.902Z",
  "approvedAt": "2018-07-10T10:31:28.036Z",
  "languages": [
    "javascript"
  ],
  "url": "https://www.codewars.com/kata/57b64d9eb69bfc8209000160",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2016-08-19T00:06:54.732Z",
  "createdBy": {
    "username": "pjcevans",
    "url": "https://www.codewars.com/users/pjcevans"
  },
  "approvedBy": {
    "username": "e.mihaylin",
    "url": "https://www.codewars.com/users/e.mihaylin"
  },
  "description": "Elia and Lyanna decided that keeping a kitty, or communal wallet, would be a good idea to help them share their finances while they were travelling. \n\nThey made equal financial contributions into the kitty during their trip and used the shared money to easily pay for things that they shared without having to split the costs every time.\n\nThis worked brilliantly for a while but unfortunately things quickly got complicated as sometimes the communal kitty was used to pay for something that wasn't shared or an individual's money was used to pay for a communal expense.\n\nLuckily they kept track of these expenditures and could feed them into a simple function to work out who owes what to whom.\n\n---\n\nGiven four variables:\n\n+ `eliaShared` - being the total amount that Elia spent on shared costs out of her own money.\n+ `eliaBorrowed` - being the total amount that Elia spent from the kitty on her own personal expenses.\n+ `lyannaShared` - being the total amount that Lyanna spent on shared costs out of her own money.\n+ `lyannaBorrowed` - being the total amount that Lyanna spent from the kitty on her own personal expenses.\n\nReturn one of three string formatted outcomes:\n\n+ `\"Elia owes Lyanna x\"`\n+ `\"Lyanna owes Elia y\"`\n+ `\"The kitty is already even\"`\n\nThe result should not be formatted into a currency as the kitty may be used in lots of different places and friends don't worry about subdivisions - so result values such as `\"Elia owes Lyanna 50.5\"` or `\"Lyanna owes Elia 6000\"` are expected.\n",
  "totalAttempts": 913,
  "totalCompleted": 223,
  "totalStars": 7,
  "voteScore": 53,
  "tags": [
    "Fundamentals",
    "Strings"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 1,
    "suggestions": 0
  }
}