{
  "id": "57dc0ffed8f92982af0000f6",
  "name": "AD2070: Help Lorimar troubleshoot his robots-Search and Disable",
  "slug": "ad2070-help-lorimar-troubleshoot-his-robots-search-and-disable",
  "category": "algorithms",
  "publishedAt": "2016-09-17T20:32:18.250Z",
  "approvedAt": "2016-11-27T17:02:36.186Z",
  "languages": [
    "python",
    "ruby",
    "javascript",
    "typescript"
  ],
  "url": "https://www.codewars.com/kata/57dc0ffed8f92982af0000f6",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2016-09-16T15:30:06.887Z",
  "createdBy": {
    "username": "user8476848",
    "url": "https://www.codewars.com/users/user8476848"
  },
  "approvedBy": {
    "username": "myjinxin2015",
    "url": "https://www.codewars.com/users/myjinxin2015"
  },
  "description": "The year is 2070 and intelligent connected machines have replaced humans in most things. There are still a few critical jobs for mankind including machine software developer, for writing and maintaining the AI software, and machine forward deployed engineer for controlling the intelligent machines in the field. Lorimar is a forward deployed machine engineer and at any given time he controls thousands of BOT robots through real time interfaces and intelligent automation software.\n\nWhile Lorimar remains highly skilled in the art of computer programming the people in general have fallen away from their technical roots. Much of the innovation leading to the development of the machines was done by the early pioneers. Today the people are relying on past success to prop up their machine dependant society. There are bugs, flaws, vulnerabilities and BOT robots in need of update, patching and maintenance. In some cases the BOT is isolated and siloed with no human interaction. When this happens it must be located and disabled. Lorimar is on the hunt and tracking an infected non-responsive and dangerous BOT originally commissioned for automated security services in highly hostile urban battlefield settings. This particular BOT is very unpredictable as its operating environment is not understood by modern developers who have become reliant on extreme abstraction without fully understanding the inner workings of the system.\n\nYour task is to search through a string of integers related to BOT system internals found during a recent scan of communication systems searching for a pattern.\n\n```\n100 ≤ log ≤ 100000\n1 ≤ n ≤ 10000\n  \nInteger is Prime\n\nInteger is 4 digits long such as 1031\n\nInteger third digit is either 2 or 3 such as 1021 or 1031\n                                               ^       ^\n                                               |       |\nThe count of the integer in the log is > 3\n\nIf there are > 50 integers in the log matching this pattern the BOT at this location should be disabled\n\nHere is an example\n\nAll the integers below are prime:\n\nlog= ['8923', '5639', '2423', '3929', '7723',\n      '8923', '5639', '2423', '3929', '7723',\n      '8923', '5639', '2423', '3929', '7723', \n      '8923', '5639', '2423', '3929', '7723', \n      '8923', '5639', '2423', '3929', '7723',\n      '8923', '5639', '2423', '3929', '7723',\n      '8923', '5639', '2423', '3929', '7723', \n      '8923', '5639', '2423', '3929', '7723', \n      '8923', '5639', '2423', '3929', '7723', \n      '8923', '5639', '2423', '3929', '7723',\n      '8923']\n\nHere is the Count\n\n({'2423': 10, '3929': 10, '5639': 10, '7723': 10, '8923': 11})\n\nCount = 51\nCount > 50\n\nReturn \"match disable bot\"\n   \nIf these rules do not hold \n  \nReturn \"no match continue\"\n\n```\nPlease also try the other Kata in this series..\n\n* [AD2070:Help Lorimar troubleshoot his robots- ultrasonic distance analysis](https://www.codewars.com/kata/57102bbfd860a3369300089c)\n",
  "totalAttempts": 2426,
  "totalCompleted": 272,
  "totalStars": 25,
  "voteScore": 72,
  "tags": [
    "Data Structures",
    "Mathematics",
    "Algorithms",
    "Data Science"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 1,
    "suggestions": 1
  }
}