{
  "id": "57de36c721bc491a54000178",
  "name": "myjinxin's Fairy tales #002 : Ali Baba and the Forty Thieves I",
  "slug": "myjinxins-fairy-tales-number-002-ali-baba-and-the-forty-thieves-i",
  "category": "games",
  "publishedAt": "2016-09-18T08:28:56.247Z",
  "approvedAt": "2017-03-13T01:49:16.539Z",
  "languages": [
    "javascript"
  ],
  "url": "https://www.codewars.com/kata/57de36c721bc491a54000178",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2016-09-18T06:40:07.425Z",
  "createdBy": {
    "username": "myjinxin2015",
    "url": "https://www.codewars.com/users/myjinxin2015"
  },
  "approvedBy": {
    "username": "kazk",
    "url": "https://www.codewars.com/users/kazk"
  },
  "description": "### Story\n\nIn a town in Persia there dwelt two brothers, one named Cassim, the other Ali Baba. Ali Baba is a poor man , he had to maintain his wife and children by cutting wood in a neighboring forest and selling it in the town.\n\nOne day, when Ali Baba was in the forest, he saw a troop of men on horseback, coming toward him in a cloud of dust. He was afraid they were robbers, and climbed into a tree for safety. When they came up to him and dismounted, he counted forty of them. They unbridled their horses and tied them to trees.\n\nThe finest man among them, whom Ali Baba took to be their captain, went a little way among some bushes, and said, \"Open, Sesame!\" so plainly that Ali Baba heard him.\n\nA door opened in the rocks, and having made the troop go in, he followed them, and the door shut again of itself. They stayed some time inside, and Ali Baba, fearing they might come out and catch him, was forced to sit patiently in the tree. At last the door opened again, and the Forty Thieves came out. As the Captain went in last he came out first, and made them all pass by him; he then closed the door, saying, \"Shut, Sesame!\"\n\nEvery man bridled his horse and mounted, the Captain put himself at their head, and they returned as they came.\n\nThen Ali Baba climbed down and went to the door concealed among the bushes, and trying to shout, \"Open, Sesame!\" and it flew open. The Alibaba found here is the place where the robbers collect their treasures. He took out a lot of treasures.\n\nUsing the words, \"Shut, Sesame!\" he closed the door and went home. Because he knew that if he did not close the door, the robbers would soon find someone to take away their treasures, and he would be killed.\n\n### Descrption\n\nBelow, you will see a forgetful Ali Baba. He can only remember the name of a plant in the words of the robber. But... Millet? Maize? Soybean? Damn! He needs to try again and again...\n\nPlease predict the fate of Ali Baba:\n\nIf he opens the door and closes the door successfully:\n\n```\n [\"Open, Millet!\",\"Open, Maize!\",\"Open, Soybean!\",\n \"Oh, Damn! I'm going to smash you into pieces!\",\n \"Open, Sesame!\",\"God bless! A lot of treasures!\",\n \"Why do I have only two hands?\",\"Shut, Maize!\",\n \"Shut, Soybean!\",\"Please shut! Dear Mr. door!\",\n \"Shut, Sesame!\",\"Haha, I'm so smart!\"]\n```\n\nReturn the forecast result:\n \n`Ali Baba got a lot of treasures and he lived a rich life.`\n\nIf he opens the door successfully but he did not closes the door:\n\n```\n [\"Open, Millet!\",\"Open, Maize!\",\"Open, Soybean!\",\n \"Oh, Damn! I'm going to smash you into pieces!\",\n \"Open, Sesame!\",\"God bless! A lot of treasures!\", \n \"Why do I have only two hands?\",\"Shut, Maize!\",\n \"Shut, Soybean!\",\"Please shut! Dear Mr. door!\"]\n```\n\nReturn the forecast result:\n\n`Ali Baba got a lot of treasure and he was finally killed by the robbers.`\n\nIf he did not open the door successfully:\n\n```\n [\"Open, Millet!\",\"Open, Maize!\",\"Open, Soybean!\",\n \"Oh, Damn! I'm going to smash you into pieces!\",\n \"Open, Millet!\",\"Open, Maize!\",\"Open, Soybean!\",\n \"Oh, Damn! I'm going to smash you into pieces!\"]\n```\n\nReturn the forecast result:\n\n`Ali Baba didn't get the treasure and he was still a poor man.`\n \n\n### Task\n\nComplete function `aliBaba` that accepts 1 arguments `trying`. Returns the result in accordance with the rules above.\n\nNote: You can assume that the  `\"Open, Sesame!\"` and `\"Shut, Sesame!\"` will not appear many times. If `\"Shut, Sesame!\"` is in front of the `\"Open, Sesame!\"`, `\"Shut, Sesame!\"` is invalid. Please don't care about the semantics of other strings.",
  "totalAttempts": 250,
  "totalCompleted": 127,
  "totalStars": 5,
  "voteScore": 58,
  "tags": [
    "Puzzles"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 1,
    "suggestions": 0
  }
}