{
  "id": "57df83328a8b8d004600039a",
  "name": "myjinxin's Fairy tales #005 : The little match girl ",
  "slug": "myjinxins-fairy-tales-number-005-the-little-match-girl",
  "category": "reference",
  "publishedAt": "2016-09-19T07:17:33.862Z",
  "approvedAt": "2017-03-13T13:54:51.453Z",
  "languages": [
    "javascript"
  ],
  "url": "https://www.codewars.com/kata/57df83328a8b8d004600039a",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2016-09-19T06:18:26.808Z",
  "createdBy": {
    "username": "myjinxin2015",
    "url": "https://www.codewars.com/users/myjinxin2015"
  },
  "approvedBy": {
    "username": "smile67",
    "url": "https://www.codewars.com/users/smile67"
  },
  "description": "### Story\n\n On a cold New Year’s Eve, a poor girl tries to sell matches in the street. She is freezing badly, but she is afraid to go home because her father will beat her for not selling any matches. She takes shelter in a nook and lights the matches to warm herself.\n \n In their glow, she sees several lovely visions including a Christmas tree and a holiday feast. The girl looks skyward and sees a shooting star, then she remembers her dead grandmother saying that such a falling star means someone has died and is going into Heaven. As she lights the next match, she sees a vision of her grandmother, the only person to have treated her with love and kindness. She strikes one match after another to keep the vision of her grandmother alive for as long as she can.\n \n Running out of matches, the child dies and her grandmother carries her soul to Heaven. The next morning, passers-by find the child dead in the nook and take pity on her, not knowing that she had left this world and will not be cold or hungry any more.\n \n The ending is so sad, why don't we have a happy ending? such as the little girl sold her matches, and then buy some lottery tickets and winning $1000000? Or the little girl and the guy who sold the lighter fell in love, and then held a grand wedding? I hate Andersen.\n \n### Descrption\n\nThe little match girl in the corner of the street. There are some `matches` in her hands:`\"i1!111ii!i1!111ii!i1!111ii!i1!111ii!\"`. `i` is a match that did not burn. You can see the match head on the top of `i`. `!` is also a match that did not burn, The match head is at the bottom of the `!`. `1` is a burnt match.\n\n Here is the little match girl's `action`:\n\n```\n[\"Sell:2\",\"Burn:1\",\"Sell:3\",\"Burn:2\",\"Burn:1\",\"Burn:1\",\"Burn:1\"]\n```\nWe want to know: To the last, What's in the little girl's hand? The above example should return:\n```\n\"$1$1111$$$1111111111!111ii!i1!111ii!\"\n\nSell: i/!-->$  Burn: i/!-->1\n```\nThe little match girl always sell or burn the match from left side.\n\n### Task\nComplete function `poorGirl` that accepts 2 argument `matches` and `action`. Returns the result in accordance with the rules above.\n\nNote: If the action requires more than the actual number of matches, please ignore the additional action.\n",
  "totalAttempts": 289,
  "totalCompleted": 107,
  "totalStars": 6,
  "voteScore": 50,
  "tags": [
    "Puzzles",
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 2,
    "suggestions": 1
  }
}