{
  "id": "5839cd780426f5d0ec00009a",
  "name": "[Minecraft Series #1] Steve wants to build a beacon pyramid",
  "slug": "minecraft-series-number-1-steve-wants-to-build-a-beacon-pyramid",
  "category": "algorithms",
  "publishedAt": "2016-11-26T17:59:24.930Z",
  "approvedAt": "2017-10-22T09:35:01.324Z",
  "languages": [
    "ruby",
    "javascript",
    "python"
  ],
  "url": "https://www.codewars.com/kata/5839cd780426f5d0ec00009a",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2016-11-26T17:59:20.906Z",
  "createdBy": {
    "username": "arwengu",
    "url": "https://www.codewars.com/users/arwengu"
  },
  "approvedBy": {
    "username": "ZED.CWT",
    "url": "https://www.codewars.com/users/ZED.CWT"
  },
  "description": "Just another day in the world of Minecraft, Steve is working on his new project -- building a beacon pyramid in front of his house.\n\n![Beacon pyramid](http://www.minecraft101.net/reference/images/beacon_pyramid_thb.jpg)\n\nSteve has already obtained the beacon (the glass wrapped blue thingy on the top), he just needs to build the pyramid. Each level of the pyramid is built using one of the following four kinds of block: gold, diamond, emerald, and iron. Since these four kinds of blocks are relatively hard to collect, Steve needs to know exactly how many of each kind is required to build a pyramid of level N.\n\nAssume that the top level of the pyramid uses gold blocks, the second level uses diamond blocks, the third level uses emerald blocks, the fourth level uses iron blocks, and the fifth level uses gold blocks, etc. (if you are a Minecraft player, you know it's not neccessary the right way to build the pyramid. Let's just assume it is for the sake of this kata ;-))\n\nImplement a function that takes one argument which is the number of levels of the pyramid, and returns an object of the form: `{total: 9, gold: 9, diamond: 0, emerald: 0, iron: 0}`.\n\n---\n\nTo all the Minecraft players out there: \nfeel free to expand this series or let me know if you have any ideas related to Minecraft that can be turned into codewars puzzles. Some ideas I have that might potentially be turned into katas:\n\n* distance traveled in real world vs. in Nether\n* shortest path problems related to mining diamonds/gold/goodies that appears in different levels under ground\n* growth of animal population from breeding\n* redstone stuff?!\n\nIf you do end up expanding this series, please send me a link of your kata so I can check it out and include a link to your kata here :-)\n\n* [Minecraft Series #2: Minimum amount of fuel needed to get some iron ingots](https://www.codewars.com/kata/minecraft-series-number-2-minimum-amount-of-fuel-needed-to-get-some-iron-ingots/ruby)\n* [Minecraft Series #3: Lava is amazing! ](https://www.codewars.com/kata/583a23d40cf946ec380002c2)\n* [Minecraft Series #4: Lava is amazing, however...](https://www.codewars.com/kata/583a6b0b171f3a3c3f0003e3)\n",
  "totalAttempts": 2405,
  "totalCompleted": 443,
  "totalStars": 17,
  "voteScore": 128,
  "tags": [
    "Algorithms"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 1,
    "suggestions": 0
  }
}