{
  "id": "58bee820e9f98b215200007c",
  "name": "Selective memory",
  "slug": "selective-memory",
  "category": "reference",
  "publishedAt": "2017-03-07T17:04:56.156Z",
  "approvedAt": "2017-04-12T03:25:35.603Z",
  "languages": [
    "php",
    "javascript",
    "ruby",
    "python"
  ],
  "url": "https://www.codewars.com/kata/58bee820e9f98b215200007c",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2017-03-07T17:04:32.646Z",
  "createdBy": {
    "username": "cyril-lemaire",
    "url": "https://www.codewars.com/users/cyril-lemaire"
  },
  "approvedBy": {
    "username": "docgunthrop",
    "url": "https://www.codewars.com/users/docgunthrop"
  },
  "description": "_A mad sociopath scientist just came out with a brilliant invention! He extracted his own memories to forget all the people he hates! Now there's a lot of information in there, so he needs your talent as a developer to automatize that task for him._\n\n> You are given the memories as a string containing people's surname and name (comma separated). The scientist marked one occurrence of each of the people he hates by putting a '!' right before their name.\n\n**Your task is to destroy all the occurrences of the marked people.\nOne more thing ! Hate is contagious, so you also need to erase any memory of the person that comes after any marked name!**\n\n---\nExamples\n---\n---\nInput:\n```\n\"Albert Einstein, !Sarah Connor, Marilyn Monroe, Abraham Lincoln, Sarah Connor, Sean Connery, Marilyn Monroe, Bjarne Stroustrup, Manson Marilyn, Monroe Mary\"\n```\nOutput:\n```\n\"Albert Einstein, Abraham Lincoln, Sean Connery, Bjarne Stroustrup, Manson Marilyn, Monroe Mary\"\n```\n=> We must remove every memories of Sarah Connor because she's marked, but as a side-effect we must also remove all the memories about Marilyn Monroe that comes right after her! Note that we can't destroy the memories of Manson Marilyn or Monroe Mary, so be careful!",
  "totalAttempts": 5468,
  "totalCompleted": 588,
  "totalStars": 41,
  "voteScore": 191,
  "tags": [
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 1,
    "suggestions": 1
  }
}