{
  "id": "58c1446b61aefc34620000aa",
  "name": "How many eggs? ",
  "slug": "how-many-eggs",
  "category": "algorithms",
  "publishedAt": "2017-03-09T13:12:22.865Z",
  "approvedAt": "2018-03-15T22:38:21.388Z",
  "languages": [
    "javascript",
    "crystal",
    "ruby",
    "python"
  ],
  "url": "https://www.codewars.com/kata/58c1446b61aefc34620000aa",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2017-03-09T12:02:51.236Z",
  "createdBy": {
    "username": "kkavita92",
    "url": "https://www.codewars.com/users/kkavita92"
  },
  "approvedBy": {
    "username": "adrian.eyre",
    "url": "https://www.codewars.com/users/adrian.eyre"
  },
  "description": "Ronald's uncle left him 3 fertile chickens in his will. When life gives you chickens, you start a business selling chicken eggs which is exactly what Ronald decided to do. \n\nA chicken lays 300 eggs in its first year. However, each chicken's egg production decreases by 20% every following year (rounded down) until when it dies (after laying its quota of eggs). \n\nAfter his first successful year of business, Ronald decides to buy 3 more chickens at the start of each year.  \n\n<br>\n\n<p><b>Your Task: </b></p>\n\nFor a given <u><i>year</i></u>, and life span of chicken <u><i>span</i></u>,  calculate how many eggs Ronald's chickens will lay him that year, whereby <i>year=1</i> is when Ronald first got his inheritance and <i>span>0</i>.\n\nIf <i>year=0</i>, make sure to return \"No chickens yet!\".\n\n<br>\n<p><b>Note: </b></p>\n1. All chickens have the same life span regardless of when they are bought. \n<p>2. Let's assume all calculations are made at the end of the year so don't bother taking eggs laid per month into consideration. \n<p>3. <b><u>Each</u></b> chicken's egg production goes down by 20% each year, NOT the total number of eggs produced by each 'batch' of chickens. While this might appear to be the same thing, it doesn't once non-integers come into play so take care that this is reflected in your kata! ",
  "totalAttempts": 2255,
  "totalCompleted": 427,
  "totalStars": 50,
  "voteScore": 76,
  "tags": [
    "Algorithms"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 3
  }
}