{
  "id": "58d5f464ba74621747000068",
  "name": "Mission: Hidden Message",
  "slug": "mission-hidden-message",
  "category": "games",
  "publishedAt": "2017-03-29T16:16:13.198Z",
  "approvedAt": "2017-11-07T13:02:59.677Z",
  "languages": [
    "javascript"
  ],
  "url": "https://www.codewars.com/kata/58d5f464ba74621747000068",
  "rank": {
    "id": -5,
    "name": "5 kyu",
    "color": "yellow"
  },
  "createdAt": "2017-03-25T04:39:00.156Z",
  "createdBy": {
    "username": "Rafa Mel",
    "url": "https://www.codewars.com/users/Rafa%20Mel"
  },
  "approvedBy": {
    "username": "smile67",
    "url": "https://www.codewars.com/users/smile67"
  },
  "description": "# Story\nFor many years, The Foundation has been encoding their messages in inconspicuous letters. Now, they are looking for a function that will solve the decoding of the messages for them.\n\n# Rules of decoding\n\nYou will receive a string containing several sentences (the “letter”).\n\n- The length of each word of the first sentence signals the word we must take for each of the following sentences. So if the first sentence has two words of 3 and 7 letters in it, we should pick the third word of the second sentence, and the seventh of the third. We would then be done with the first sentence of the hidden message.\n- If there is another sentence in our letter after we are done picking the words signaled by the first sentence, we’ll treat it as we did the first. In our example, if there was a fourth sentence, we would count the lengths of its words as we did with the first, and pick the words in those positions in the following sentences; that would give us the second sentence of the hidden message - and we would go on like that indefinitely. \n- Dots, question and exclamation marks (.?!) are the valid delimiters of the end of a sentence.\n- Punctuation marks (such as those above, commas, quotes, and apostrophes) don’t go into the word count.\n- Punctuation marks, except apostrophes, don’t transfer into the decoded message (so apostrophes do).\n- Words with apostrophes count as one word (`I’m` would count as a word of two letters).\n\n# Expected Output\n\n- Each sentence of the decoded hidden message must have its first word capitalised (the rest should be in lowercase) and end with a dot `.`.\n- Any sentence after a dot must be preceded by a space.\n- There should be no spaces at the beginning or the end of the decoded message.\n- For an empty string, return a empty string.\n\n# Example\n```javascript\n'Yesterday, we bumped into Laura. It had to happen, but you can\\'t deny the timing couldn\\'t be worse. The \"mission\" to try and seduce her was a complete failure last month. By the way, she still has the ring I gave her. Anyhow, it hasn\\'t been a pleasurable experience to go through it. I wanted to feel done with it first.'\n```\nShould return:\n```javascript\n'The mission has been done.'\n```",
  "totalAttempts": 1954,
  "totalCompleted": 123,
  "totalStars": 21,
  "voteScore": 58,
  "tags": [
    "Games",
    "Regular Expressions",
    "Puzzles"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}