{
  "id": "5964e8fcfc9cf7749000005e",
  "name": "Back to the Future?",
  "slug": "back-to-the-future",
  "category": "reference",
  "publishedAt": "2017-07-11T20:32:56.842Z",
  "approvedAt": "2017-07-17T18:56:25.968Z",
  "languages": [
    "javascript",
    "ruby"
  ],
  "url": "https://www.codewars.com/kata/5964e8fcfc9cf7749000005e",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2017-07-11T15:04:28.629Z",
  "createdBy": {
    "username": "Jocode",
    "url": "https://www.codewars.com/users/Jocode"
  },
  "approvedBy": {
    "username": "Blind4Basics",
    "url": "https://www.codewars.com/users/Blind4Basics"
  },
  "description": "Oh no!  Marty McFly was taking the DeLorean for a drive and accidentally time travelled to approximately 50 years in the past.    \n\nThe last thing he remembers is Doc Brown shouting \"Marty, you must only attempt to travel back on the same day and date as you arrive, otherwise the space-time continuum will unravel!  The month doesn't matter, but if you arrive on Monday 1st, you must leave on a Monday 1st or the consequences will be disastrous.  The flux capacitor is only going to last until the end of the year, so if you can't travel before then, you'll be stuck in the past forever!\".\n\nMarty doesn't have a calendar but he remembers that the days and dates for some months of the year match other months.  For example if the 1st of January falls on a Monday then the 1st of October will also fall on a Monday in the same year. This is because the number of days between the two months is divisible by 7.\n\nHe works out all the matching months in the year (note: it is not a leap year):\n\n- January & October  \n- April & July  \n- September & December  \n- February & March & November\n\nWrite a function to help Marty send a message to Doc.  \n\nThe input is a string of the date he arrived in the past: \"Monday 1 January\"  \nIf there is a matching day/date you will need to return the following string: \"I'm leaving here on Monday 1 October!\"\n\nIf there is no matching day/date that year, Marty is stuck in the past and you will need to return the following string: \"Doc, I can't get back to the future!\" \n\nIf there are two possible return dates, return the soonest.\n",
  "totalAttempts": 2232,
  "totalCompleted": 401,
  "totalStars": 21,
  "voteScore": 89,
  "tags": [
    "Puzzles",
    "Logic",
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}