{
  "id": "5977b5bcfd72c6a99f0000c4",
  "name": "Robozzle simulator",
  "slug": "robozzle-simulator",
  "category": "reference",
  "publishedAt": "2017-07-25T23:18:37.395Z",
  "approvedAt": "2018-04-07T11:28:53.860Z",
  "languages": [
    "ruby",
    "coffeescript",
    "javascript"
  ],
  "url": "https://www.codewars.com/kata/5977b5bcfd72c6a99f0000c4",
  "rank": {
    "id": -4,
    "name": "4 kyu",
    "color": "blue"
  },
  "createdAt": "2017-07-25T21:18:52.370Z",
  "createdBy": {
    "username": "Korrigan",
    "url": "https://www.codewars.com/users/Korrigan"
  },
  "approvedBy": {
    "username": "cyril-lemaire",
    "url": "https://www.codewars.com/users/cyril-lemaire"
  },
  "description": "## Introduction\n\nRobozzle is a puzzle game which requires the player to write programs to get a robot through a maze, collecting all stars on it.\n\nThe best way to understand the game is probably to play it, please have a try on http://www.robozzle.com/\n\nYour ultimate goal in the life is now to write a Robozzle simulator.\n\n## The task\n\nYou'll write a robozzle function which will take the board, the robot initial state and the program in paramters.\n\nThe board will be a 2 dimensions array containing cells. A cell is a Hash containing 2 elements:\n- color: the color of the cell (one of `blue`, `green` or `red`)\n- star: a boolean indicating if the cell contains a star\n\nThe robot will be a Hash containing the following elements:\n- x: the x position of the robot on the board\n- y: the y position on the roboat board\n- direction: one of `right`, `left`, `up`, `down`\n\nCoordinates start at 0; 0 at the top left, the y axix goes \"down\" and the x axis goes to the \"right\", so if the robot is moving `down`, it's y coordinate will increase.\n\nThe program will be an array of subprograms, containing at least one subprogram.\nEach subprogram is a list of actions, an action is a hash containing the following elements:\n- action: the instruction to perform (see below for the possible instructions)\n- if (optional): the color condition to perform the action (see \"conditionals\")\n\nYour simulator will run turn by turn, until the end of the game, popping an action from the stack and executing it.\n\nAt the end of the game (see \"end of the game\" section), you will return a 2 elements array containg the final state of the board and the final state of the robot.\n\nYour function might need to abort prematurely if there is an error (see \"end of the game\")\n\n## Instructions\n\nYour simulator will support the following instructions:\n- `forward`: move the robot 1 cell forward, following it's current direction\n- `turn_right`: turn the robot to the right\n- `turn_left`: turn the robot to the left\n- `paint_blue`: change the color of the current cell to blue\n- `paint_green`: change the color of the current cell to green\n- `paint_red`: change the color of the current cell to red\n- an integer: stack the instructions of the subprogram at the integer's index in the given program\n\n## Conditionals\n\nActions can be conditional, meaning they will be executed only if the current cell is of the same color as their `if` element.\n\nIf an action does not fulfil the conditional, it's skipped.\n\n## The stack\n\nYour simulator will use a stack to store the instructions to execute.\nYou will initialize it with the instructions of the first subprogram.\n\nThe stack is Last-in, First-out, that means the last inserted instruction will be executed next.\n\nEach turn, you'll have to pop the most recently inserted action from the stack and execute it.\n\nPlease note the subprogams are meant to be executed in the same order as given, so take care when putting their instructions on the stack.\n\n## End of the game\n\nThe game ends when the robot has collected all the stars on the board or if an error occurs.\n\nYou have to take care of the following errors:\n- There is no more instructions to execute on the stack\n- The robot moved out of the board (either outside of the board array boudaries or on a `nil` cell)\n\nYou have to raise an exception to signal it with a meaningful error message if any errors occurs.\n\n## Other remarks\n\nThe requirements might be harder to understand if you haven't yet play the game (and the game is really fun to play, you should really give it a try).\n\nI have included 2 sample puzzles in the test cases so you can check how the simulator is expected to work, especially about dealing with the inputs and outputs.\n\nFeel free to let me know in the comments if anything is unclear or if there is an issue with the Kata.\n\nHappy coding!\n",
  "totalAttempts": 975,
  "totalCompleted": 94,
  "totalStars": 43,
  "voteScore": 43,
  "tags": [
    "Puzzles",
    "Interpreters",
    "Game Solvers"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 4,
    "suggestions": 1
  }
}