{
  "id": "59827d0c197a17d4cf000028",
  "name": "Convert Sentences to New York, my guy.",
  "slug": "convert-sentences-to-new-york-my-guy",
  "category": "reference",
  "publishedAt": "2017-08-03T01:56:05.971Z",
  "approvedAt": "2017-10-16T23:18:20.039Z",
  "languages": [
    "javascript"
  ],
  "url": "https://www.codewars.com/kata/59827d0c197a17d4cf000028",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2017-08-03T01:31:56.851Z",
  "createdBy": {
    "username": "K-Calderon-ASC",
    "url": "https://www.codewars.com/users/K-Calderon-ASC"
  },
  "approvedBy": {
    "username": "Voile",
    "url": "https://www.codewars.com/users/Voile"
  },
  "description": "One of the most famous and often used phrases in the lexicon of New Yorkers is \"my guy\". For this challenge, create a function that adds \"my guy\" at the end of every sentence. \n\nExamples:\n```javascript\nnewYorker(\n`Bees are flying insects closely related to wasps and ants, known for their \nrole in pollination and, in the case of the best-known bee species, the \nEuropean honey bee, for producing honey and beeswax. Bees are a monophyletic \nlineage within the superfamily Apoidea and are presently considered a clade, \ncalled Anthophila. There are nearly 20,000 known species of bees in seven \nrecognized biological families. They are found on every continent except \nAntarctica, in every habitat on the planet that contains insect-pollinated \nflowering plants.` )\n\n/* => Bees are flying insects closely related to wasps and ants, known for \ntheir role in pollination and, in the case of the best-known bee \nspecies, the European honey bee, for producing honey and beeswax my \nguy. Bees are a monophyletic lineage within the superfamily Apoidea and \nare presently considered a clade, called Anthophila my guy. There are \nnearly 20,000 known species of bees in seven recognized biological \nfamilies my guy. They are found on every continent except Antarctica, \nin every habitat on the planet that contains insect-pollinated \nflowering plants my guy.\n*/\n\nnewYorker(\n`The FitnessGram™ Pacer Test is a multistage aerobic capacity test that \nprogressively gets more difficult as it continues. The 20 meter pacer test \nwill begin in 30 seconds. Line up at the start. The running speed starts \nslowly, but gets faster each minute after you hear this signal. [beep] A \nsingle lap should be completed each time you hear this sound. [ding] Remember \nto run in a straight line, and run as long as possible. The second time you \nfail to complete a lap before the sound, your test is over. The test will \nbegin on the word start. On your mark, get ready, start.` )\n\n/* => The FitnessGram™ Pacer Test is a multistage aerobic capacity test that \nprogressively gets more difficult as it continues my guy. The 20 meter pacer \ntest will begin in 30 seconds my guy. Line up at the start my guy. The \nrunning speed starts slowly, but gets faster each minute after \nyou hear this signal my guy. [beep] A single lap should be completed each \ntime you hear this sound my guy. [ding] Remember to run in a straight line, \nand run as long as possible my guy. The second time you fail to complete a \nlap before the sound, your test is over my guy. The test will begin on the \nword start my guy. On your mark, get ready, start my guy.\n*/\n```",
  "totalAttempts": 1140,
  "totalCompleted": 259,
  "totalStars": 2,
  "voteScore": 87,
  "tags": [
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}