{
  "id": "59cbb97d1a68b74482000135",
  "name": "Sonic the Hedgehog Ring Counter",
  "slug": "sonic-the-hedgehog-ring-counter",
  "category": "reference",
  "publishedAt": "2017-09-27T19:47:35.232Z",
  "approvedAt": "2017-10-18T08:14:07.982Z",
  "languages": [
    "javascript"
  ],
  "url": "https://www.codewars.com/kata/59cbb97d1a68b74482000135",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2017-09-27T14:45:17.999Z",
  "createdBy": {
    "username": "SamiSha_",
    "url": "https://www.codewars.com/users/SamiSha_"
  },
  "approvedBy": {
    "username": "Voile",
    "url": "https://www.codewars.com/users/Voile"
  },
  "description": "Rings are the most distinct item in the Sonic the Hedgehog franchise, Rings are considered as a health system where the sole purpose to protect Sonic from all damage (except crushing) no matter how strong and powerful in shape or form, today you are making a Ring counter which stores your Rings in Sonic's Ring Bank.\n\nIn Sonic the Hedgehog games, most thing Sonic will encounter are rings, collecting a ring will add to Sonic's Ring Bank 1 ring and protects him from all damage, getting hit will cause Sonic to lose all rings and start back to 0, having a shield which can be found in monitors around the level will cause Sonic to lose the shield instead of all his rings.\n\nRing currencies in this Kata are based over Sonic 3 & Knuckles Ring Counter which goes with the following:\n\nRing = ```1```, Monitor Ring = ```10```, Giant Ring = ```50```\n\nIf Sonic doesn't have 7 Chaos Emeralds, Giant Rings do NOT count so basically if Sonic already collected 7 Chaos Emeralds, any Giant Ring collected is now worth 50 rings.\n\n\nUse the function below to solve the kata:\n\n```javascript\nfunction ringBank(rings, monitors, giantrings, chaosEmeralds, sonicHit, sonicShield){\n\n}\n```\nGood luck! and remember to use the Example Tests if you ever got stuck! ;)",
  "totalAttempts": 231,
  "totalCompleted": 132,
  "totalStars": 3,
  "voteScore": 46,
  "tags": [
    "Fundamentals"
  ],
  "contributorsWanted": false,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}