{
  "id": "59fd52b032b8b9abb200001d",
  "name": "High-Stakes Binary Blackjack",
  "slug": "high-stakes-binary-blackjack",
  "category": "games",
  "publishedAt": "2017-11-04T10:34:17.989Z",
  "approvedAt": "2024-11-08T07:16:52.516Z",
  "languages": [
    "ruby"
  ],
  "url": "https://www.codewars.com/kata/59fd52b032b8b9abb200001d",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2017-11-04T05:40:00.625Z",
  "createdBy": {
    "username": "ajLapid718",
    "url": "https://www.codewars.com/users/ajLapid718"
  },
  "approvedBy": {
    "username": "dfhwze",
    "url": "https://www.codewars.com/users/dfhwze"
  },
  "description": "Binary blackjack is a game that adopts some, but not all, of the rules and objectives from the standard blackjack card game. This is a high-stakes game by nature. Therefore, some of the rules are a bit extreme, making it slightly more difficult for participants at the table to cheat or calculate the risk. It comes down to whether a person is lucky or unlucky.\n\nUnfortunately, the players cannot read binary numbers. Fortunately, there are people available to help them out.\n\nThere will be two decks the dealer will deal from. One deck (X) contains cards with values from 1 up to and including 11. The other deck (Y) contains cards with values from 1 up to and including 100.\n\nA player may be dealt either two cards or three cards from the dealer, no more and no less. If a player receives two cards, then the first card will come from X and the second card will come from Y. If a player receives three cards, then the first card will come from X, the second card will come from X, and the third card will come from Y. In other words, the last card of a player's hand will always originate from Y.\n\nOne twist involves the values of the cards. The cards are written in an integer's binary representation, so it is the responsibility of the player to convert the integer to its base-ten representation. Please test out your code at this point to ensure everything is going according to plan.\n\nFrom there, another twist unfolds. The player has to figure out if his or her hand results in: Classic Blackjack!, Remixed Blackjack!, Super Blackjack!, Bust!, 21! or Unlucky!\n\n- A hand that achieves the outcome of Classic Blackjack! means that the first two cards of the hand have added up to the value of 21 the way it is calculated in traditional blackjack, with a 10 and an 11. This can only happen in a two-card hand, much like the way it happens in traditional blackjack.\n\n- A hand that achieves the outcome of Remixed Blackjack! means that the first two cards of the hand have added up to the value of 21 in a way that differs from the classical way.\n\n- A hand that achieves the outcome of Super Blackjack! means that the first two cards result in either a classical or remixed blackjack and the sum of the three cards is an even value.\n\n- A hand that achieves the outcome of Bust! means that the attempt (hit) at a Super Blackjack was unsuccessful. The player had some form of a blackjack but unfortunately failed to create a Super Blackjack.\n\n- A hand that achieves the outcome of 21! means that the first two cards did not result in any form of a blackjack but the sum of the cards together results in the value of 21.\n\n- A hand that achieves the outcome of Unlucky! is either under or over the value of 21 with no sign of a blackjack at all.\n\nExamples:\n\n```\nA: blackjack_outcome(1010, 1011) => \"Classic Blackjack!\"\nB: blackjack_outcome(110, 1111) => \"Remixed Blackjack!\"\nC: blackjack_outcome(1010, 1011, 1001101) => \"Super Blackjack!\"\nD: blackjack_outcome(1010, 1011, 1000000) => \"Bust!\"\nE: blackjack_outcome(111, 111, 111) => \"21!\"\nF: blackjack_outcome(1010, 111, 111) => \"Unlucky!\"\nG: blackjack_outcome(101, 101, 11) => \"Unlucky!\"\nH: blackjack_outcome(1010, 111) => \"Unlucky!\"\n\nA: 1010 and 1011 => 10 + 11 == 21\nB: 110 and 1111 is equivalent to 6 + 15 == 21\nC: 1010, 1011, and 1001101 is equivalent to 10 + 11 + 77 == 98\nD: 1010, 1011, and 1000000 is equivalent to 10 + 11 + 64 == 85\nE: 111, 111, and 111 is equivalent to 7 + 7 + 7 == 21\nF: 1010, 111, and 111 is equivalent to 10 + 7 + 7 == 24\nG: 101, 101, and 11 is equivalent to 5 + 5 + 3 == 13\nH: 1010 and 111 is equivalent to 10 + 7 == 17\n```",
  "totalAttempts": 120,
  "totalCompleted": 20,
  "totalStars": 2,
  "voteScore": 17,
  "tags": [
    "Puzzles",
    "Mathematics",
    "Strings",
    "Games"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}