{
  "id": "5a1060d3502672a75d00013d",
  "name": "Who can still  win the Formula One World Championship?",
  "slug": "who-can-still-win-the-formula-one-world-championship",
  "category": "reference",
  "publishedAt": "2017-11-18T16:33:23.831Z",
  "approvedAt": "2017-11-19T02:38:24.710Z",
  "languages": [
    "javascript",
    "crystal"
  ],
  "url": "https://www.codewars.com/kata/5a1060d3502672a75d00013d",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2017-11-18T16:33:35.512Z",
  "createdBy": {
    "username": "jriall",
    "url": "https://www.codewars.com/users/jriall"
  },
  "approvedBy": {
    "username": "Voile",
    "url": "https://www.codewars.com/users/Voile"
  },
  "description": "## Situation\n\nIt's the final few races of the Formula One race season!!! The season has been hard fought, but who can still win mathematically win the World Championship?\n\n## Arguments\n\nYou are provided with two pieces of data as arguments. The first argument is an object containing a list of drivers and their current individuals points scored so far this season. Example below:\n\n```\n{\n  \"Hamilton\": 200,\n  \"Bottas\": 180,\n  \"Raikkonen\": 210\n}\n```\n\nThe second argument is the number of race remaining in the season. Number of races remaining will always be 7 or fewer, but greater than 0.\n\n## Task\n\nYour task is to find out who can still mathematically win the championship (no matter how unlikely in reality). In Formula One a driver scores 25 points for a win. Drivers score 0 points if they do not complete the race or finish lower than 10th. Points for other placings are irrelevant to this kata.\n\nReturn the drivers who can mathematically still win the championship in a string of the following format:\n\nIf one driver has an unassailable lead return ```\"X has already won the championship!\"```\n\nIf multiple drivers can win the championship, return ```\"X, Y and Z can still win the championship.\"```.  Drivers should be returned in alphabetical order.\n\n## Note\n\nThis kata does not assess the potential for tied scores at the end of the season. If a driver can theoretically only tie with other drivers at the top of the championship table, he should be considered a possible winner of the championship.\n\n\n![alt text](http://s2.quickmeme.com/img/a9/a99bbd7ee53dff9e28d4255b1c051732015cd38511a093c936f9cd966e7e0e9f.jpg \"Teh funniez\")",
  "totalAttempts": 595,
  "totalCompleted": 135,
  "totalStars": 4,
  "voteScore": 61,
  "tags": [
    "Fundamentals",
    "Algorithms",
    "Games"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}