{
  "id": "5a514690d39ec5ab30000119",
  "name": "The Park Ranger's Umbrella",
  "slug": "the-park-rangers-umbrella",
  "category": "algorithms",
  "publishedAt": "2018-01-06T22:01:48.256Z",
  "approvedAt": "2018-01-07T23:24:32.781Z",
  "languages": [
    "javascript"
  ],
  "url": "https://www.codewars.com/kata/5a514690d39ec5ab30000119",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2018-01-06T21:58:41.016Z",
  "createdBy": {
    "username": "isimon",
    "url": "https://www.codewars.com/users/isimon"
  },
  "approvedBy": {
    "username": "Voile",
    "url": "https://www.codewars.com/users/Voile"
  },
  "description": "Joe is a park ranger and he walks around outside all day.  He does not know when it will rain, so when he wakes up every morning he puts his umbrella in his backpack before he goes to work.  His day is divided into three sections the morning, afternoon, and evening.  When it rains he takes his umbrella out of his backpack and when it stops raining he puts it back.  Every day starts with his umbrella in his backpack, so when it rains in the morning he takes it out of his backpack. How many times does Joe take his umbrella out of his backpack?  You will receive an array of weather conditions.\n\nPossible weather conditions are sunny, cloudy, rainy and thunderstorm and Joe uses needs his umbrella when it rains, or there is a thunderstorm.\n\nDescription clarification.  Each day is made up of morning, afternoon, and evening, so every three values in the array is a full day.  Joe starts each day with his umbrella in his backpack regardless of the weather the previous evening.  When it rains or there is a thunderstorm he takes his umbrella out of his backpack and when it stops raining he puts it back.  How many times does Joe take his umbrella out of his backpack?\n\n```\n[rainy, rainy, thunderstorm, rainy, rainy, cloudy]   --> 2\n[rainy, cloudy, thunderstorm, rainy, cloudy, cloudy] --> 3\n```",
  "totalAttempts": 2062,
  "totalCompleted": 186,
  "totalStars": 5,
  "voteScore": 48,
  "tags": [
    "Algorithms",
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}