{
  "id": "5a6bdb36ba1bb58691000060",
  "name": "Mega Man Boss Order",
  "slug": "mega-man-boss-order",
  "category": "reference",
  "publishedAt": "2018-01-27T10:56:43.875Z",
  "approvedAt": "2018-01-28T15:02:21.877Z",
  "languages": [
    "javascript"
  ],
  "url": "https://www.codewars.com/kata/5a6bdb36ba1bb58691000060",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2018-01-27T01:51:50.658Z",
  "createdBy": {
    "username": "nathan-lapinski",
    "url": "https://www.codewars.com/users/nathan-lapinski"
  },
  "approvedBy": {
    "username": "Voile",
    "url": "https://www.codewars.com/users/Voile"
  },
  "description": "In the classic Mega Man games, you'd start the game with one weapon (called 'Buster'), and you'd have to defeat 8 robot bosses. Each time you defeated a robot boss, you'd acquire that boss's weapon to use in future fights against the other robot bosses.\n\nhttps://en.wikipedia.org/wiki/Mega_Man#Original_series\n[this link is purely optional]\n\nThere was a cycle among bosses, where each robot boss was weak to one of the other robot's weapons, so you'd have an easier time if you beat the bosses in a specific order so as to exploit their weaknesses (Mega Man 3 was weird, and didn't quite have a cycle). \nFor instance, in Mega Man 2, Bubble Man was weak to Metal Man's Metal Blade weapon, so it made sense to beat Metal Man and acquire the Metal Blade before facing Bubble Man. Kind of like rock, paper, scissors, but in robot form :)\n\nYour task in this kata is to find the 'easiest' boss order, given an array of boss objects.\n```javascript\nclass Boss {\n  constructor(name, weapon, weakness, difficulty) {\n    this.name = name; // string\n    this.weapon = weapon; // string\n    this.weakness = weakness; // string\n    this.difficulty = difficulty; // Integer in [1,8]\n  }\n}\n```\n\n\nEach Boss object has a name, a weapon, a weakness, and a difficulty rating. Whenever you beat a boss, you acquire their weapon to use against future bosses. If you have the weapon a boss is weak against, you can assume you'll beat that boss no matter what.\n\nHowever, since you start with only the Buster, which no boss is weak against, you'll always want to start with the boss with the lowest difficulty value (difficulty === 1). From there, you can completely ignore difficulty levels, and focus on exploiting weaknesses instead.\n\nGiven an array of boss objects, your task is to return an array containing the names of the bosses to fight, in 'easiest' order. 'Easiest' order means the following:\n\nYou always start with the boss with difficulty level === 1\n\nAfter the first boss, you only pick a boss if it's weak to a weapon that you have.\n\nFor example, given the following excerpt of robot bosses:\n```javascript\nlet masters = [\n {\n   name: 'Fire Man',\n   weapon: 'Fire',\n   weakness: 'Water',\n   difficulty: 5\n },\n {\n   name: 'Water Man',\n   weapon: 'Water',\n   weakness: 'Electricity',\n   difficulty: 6\n },\n {\n   name: 'Wood Man',\n   weapon: 'Leaf Shield',\n   weakness: 'Fire',\n   difficulty: 1\n },\n {\n   name: 'Electric Man',\n   weapon: 'Electricity',\n   weakness: 'Leaf Shield',\n   difficulty: 8\n }\n]\n```\n\nthe order in which you'd want to fight the bosses would be:\n```\n[\"Wood Man\", \"Electric Man\", \"Water Man\", \"Fire Man\"]\n```\n\nBecause Wood man has difficulty === 1, you start there. Defeating Wood Man gives you his Leaf Shield weapon. From there, Electric Man is weak to Leaf Shield, and defeating Electric Man gives you Electricity. Water Man is weak to Electricity, and Fire Man is weak to Water, and so on.\n\nSome things to keep in mind:\n\nThere will be only one robot boss with difficulty === 1. Always start with this robot master.\n\nIf you have the weapon a boss is weak againt, you can simply ignore their difficulty level. I.E. ignore difficulty levels after the first boss - they're used only because we have to start somewhere in the cycle.\n\nEach boss is weak to exactly one weapon\n\nNo two bosses are weak to the same weapon\n\nEach random test is isolated, so don't worry if you see the same boss appearing in different orders in different random tests.\n\nSolutions are unique. There is exactly one correct ordering to the boss order array in this kata. This is not true in the real games, but this is a simplification :)\n\nIt's up to you to choose how to keep track of weapons you've acquired.\nEnjoy, and please let me know if you have any suggestions!\n",
  "totalAttempts": 1237,
  "totalCompleted": 231,
  "totalStars": 17,
  "voteScore": 71,
  "tags": [
    "Arrays",
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}