{
  "id": "5a996f3d5084d73a7100040c",
  "name": "Death Star Construction",
  "slug": "death-star-construction",
  "category": "reference",
  "publishedAt": "2018-03-02T16:04:23.012Z",
  "approvedAt": "2018-04-19T13:50:50.451Z",
  "languages": [
    "javascript",
    "python"
  ],
  "url": "https://www.codewars.com/kata/5a996f3d5084d73a7100040c",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2018-03-02T15:35:26.213Z",
  "createdBy": {
    "username": "ygspassov",
    "url": "https://www.codewars.com/users/ygspassov"
  },
  "approvedBy": {
    "username": "JohanWiltink",
    "url": "https://www.codewars.com/users/JohanWiltink"
  },
  "description": "# Story\n\nThe construction of the new Death Star is almost complete. It only needs a certain amount of 3 materials – iron, steel, and chromium. The emperor wants the construction finished within a week because he senses an impending rebel attack and knows the battle station will be destroyed if it is not completed within this timeframe. He has already ordered enough material delivered to the station within a week. The problem is, the rebels are attacking the supply routes and there are different amounts of material arriving at the station each week. Will the station be ready in time or will it be destroyed?\n\n# Task\n\nThe required resources are:\n* 100 Gt of iron\n* 75 Gt of steel\n* 50 Gt of chromium\n\nThe input will consist of an array with 8 elements:\n* The first 7 elements are the shipments - 3-elements-long arrays where each number corresponds to the amount of material that was ordered (iron, steel, and chromium)\n* The last element is a number representing the day of the rebel attack (0-indexed) - any materials which should have been delivered that day will be lost, and later shipments will be cancelled due to the trading route becoming unsafe\n\nThe output will be one of the two possible string:\n* In case enough resources were delivered before the attack, return `\"The station is completed!\"`\n* Otherwise, return `\"The station is destroyed! It needed X iron, Y steel and Z chromium for completion.\"`, where `X`, `Y` and `Z` are the quantities of the respective material",
  "totalAttempts": 3462,
  "totalCompleted": 650,
  "totalStars": 21,
  "voteScore": 149,
  "tags": [
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 1,
    "suggestions": 0
  }
}