{
  "id": "5b190aa7803388ec97000054",
  "name": "Tram Capacity",
  "slug": "tram-capacity",
  "category": "algorithms",
  "publishedAt": "2018-06-07T11:39:37.869Z",
  "approvedAt": "2018-06-08T10:02:24.379Z",
  "languages": [
    "cpp",
    "crystal",
    "python",
    "ruby",
    "javascript",
    "haskell"
  ],
  "url": "https://www.codewars.com/kata/5b190aa7803388ec97000054",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2018-06-07T10:36:23.295Z",
  "createdBy": {
    "username": "sazzadshopno",
    "url": "https://www.codewars.com/users/sazzadshopno"
  },
  "approvedBy": {
    "username": "anter69",
    "url": "https://www.codewars.com/users/anter69"
  },
  "description": "Linear Kingdom has exactly one tram line. It has `n` stops, numbered from 1 to n in the order of tram's movement. At the i-th stop a<sub>i</sub> passengers exit the tram, while b<sub>i</sub> passengers enter it. The tram is empty before it arrives at the first stop.\n\n## Your task\n\nCalculate the tram's minimum capacity such that the number of people inside the tram never exceeds this capacity at any time. Note that at each stop all exiting passengers exit before any entering passenger enters the tram.\n\n\n## Example\n\n```\nstops : 4\ndescending : [0, 2, 4, 4]\nonboarding : [3, 5, 2, 0]\n# Should return 6\n```\n  \nExplanation:\n* The number of passengers inside the tram before arriving is 0.\n* At the first stop 3 passengers enter the tram, and the number of passengers inside the tram becomes 3.\n* At the second stop 2 passengers exit the tram (1 passenger remains inside). Then 5 passengers enter the tram. There are 6 passengers inside the tram now.\n* At the third stop 4 passengers exit the tram (2 passengers remain inside). Then 2 passengers enter the tram. There are 4 passengers inside the tram now.\n* Finally, all the remaining passengers inside the tram exit the tram at the last stop. There are no passenger inside the tram now, which is in line with the constraints.\n\nSince the number of passengers inside the tram never exceeds 6, a capacity of 6 is sufficient. Furthermore it is not possible for the tram to have a capacity less than 6. Hence, 6 is the correct answer.",
  "totalAttempts": 3481,
  "totalCompleted": 1300,
  "totalStars": 22,
  "voteScore": 218,
  "tags": [
    "Fundamentals",
    "Algorithms"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 1,
    "suggestions": 2
  }
}