{
  "id": "5baf21542d15ec9453000147",
  "name": "Megamind",
  "slug": "megamind",
  "category": "reference",
  "publishedAt": "2018-09-29T08:10:25.268Z",
  "approvedAt": "2018-10-27T23:42:18.290Z",
  "languages": [
    "cpp",
    "python",
    "ruby"
  ],
  "url": "https://www.codewars.com/kata/5baf21542d15ec9453000147",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2018-09-29T06:53:08.612Z",
  "createdBy": {
    "username": "sazzadshopno",
    "url": "https://www.codewars.com/users/sazzadshopno"
  },
  "approvedBy": {
    "username": "cliffstamp",
    "url": "https://www.codewars.com/users/cliffstamp"
  },
  "description": "Have you heard about <b>Megamind</b>? <b>Megamind</b> and <b>Metro Man</b> are two aliens who came to earth. <b>Megamind</b> wanted to destroy the earth, while <b>Metro Man</b> wanted to stop him and protect mankind. After a lot of fighting, <b>Megamind</b> finally threw <b>Metro Man</b> up into the sky. <b>Metro Man</b> was defeated and was never seen again. <b>Megamind</b> wanted to be a super villain. He believed that the difference between a villain and a super villain is nothing but presentation. <b>Megamind</b> became bored, as he had nobody or nothing to fight against since <b>Metro Man</b> was gone. So, he wanted to create another hero against whom he would fight for recreation. But accidentally, another villain named <b>Hal Stewart</b> was created in the process, who also wanted to destroy the earth. Also, at some point <b>Megamind</b> had fallen in love with a pretty girl named <b>Roxanne Ritchi</b>. This changed him into a new man. Now he wants to stop <b>Hal Stewart</b> for the sake of his love. So, the ultimate fight starts now.\n\n* Megamind has unlimited supply of guns named <b>Magic-48</b>. Each of these guns has `shots` rounds of magic spells.\n* Megamind has perfect aim. If he shoots a magic spell it will definitely hit Hal Stewart. Once hit, it decreases the energy level of Hal Stewart by `dps` units.\n* However, since there are exactly `shots` rounds of magic spells in each of these guns, he may need to swap an old gun with a fully loaded one. This takes some time. Let’s call it swapping period. \n* Since Hal Stewart is a mutant, he has regeneration power. His energy level increases by `regen` unit during a swapping period. \n* Hal Stewart will be defeated immediately once his energy level becomes zero or negative. \n* Hal Stewart initially has the energy level of `hp` and Megamind has a fully loaded gun in his hand.\n* Given the values of `hp`, `dps`, `shots` and `regen`, find the minimum number of times Megamind needs to shoot to defeat Hal Stewart. If it is not possible to defeat him,  return `-1` instead.\n\n# Example\nSuppose, `hp` = 13, `dps` = 4, `shots` = 3 and `regen` = 1. There are 3 rounds of spells in the gun. Megamind shoots all of them. Hal Stewart’s energy level decreases by 12 units, and thus his energy level becomes 1. Since Megamind’s gun is now empty, he will get a new gun and thus it’s a swapping period. At this time, Hal Stewart’s energy level will increase by 1 unit and will become 2. However, when Megamind shoots the next spell, Hal’s energy level will drop by 4 units and will become −2, thus defeating him. So it takes 4 shoots in total to defeat Hal Stewart. However, in this same example if Hal’s regeneration power was 50 instead of 1, it would have been impossible to defeat Hal.\n",
  "totalAttempts": 1542,
  "totalCompleted": 123,
  "totalStars": 17,
  "voteScore": 42,
  "tags": [
    "Fundamentals",
    "Games"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}