{
  "id": "5c6a8b36ca80ec4da319071b",
  "name": "[BUG] XCOM-401: Hand-held scanner does not recognize hazardous materials",
  "slug": "bug-xcom-401-hand-held-scanner-does-not-recognize-hazardous-materials",
  "category": "bug_fixes",
  "publishedAt": "2024-12-04T09:06:01.207Z",
  "approvedAt": "2024-12-05T17:01:46.046Z",
  "languages": [
    "javascript",
    "haskell"
  ],
  "url": "https://www.codewars.com/kata/5c6a8b36ca80ec4da319071b",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2019-02-18T10:38:46.768Z",
  "createdBy": {
    "username": "hobovsky",
    "url": "https://www.codewars.com/users/hobovsky"
  },
  "approvedBy": {
    "username": "dfhwze",
    "url": "https://www.codewars.com/users/dfhwze"
  },
  "description": "You are an intern working in the software development department of the X-COM agency, responsible for combating a large-scale invasion of extraterrestrials. Your task for today is detailed in the bug report below:\n\n------\n\n## [BUG] XCOM-401: Hand-held hazardous materials scanner does not recognize self-resonant Elerium compounds\n\n**Type:**      Bug ðŸª³  \n**Severity:**  **FATAL** â˜ ï¸â˜ ï¸â˜ ï¸   \n**Component:** Hazardous Materials Scanner  \n**Reporter:**  `cjohnson`  \n**Assignee:**  _Assigned to you_  \n\n------\n\n_Automatically created from an e-mail sent to `bugtraq@xcom.com` by `cavethegreat@mymail.com`:_  \n\n> HOW THE HECK DID THIS HAPPEN?!?! How did we lose an airship, a crew of trained agents, a psionic, millions of dollars in equipment, and invaluable research material only because some stupid scanner flashed a green diode instead of red? WHO DESIGNED THIS JUNK?! I want their head on a silver plate, and I want the device fixed ASAP! Whoever manages to create a fix applicable for already shipped scanners gets a ðŸ’°ðŸ’° hefty bonus ðŸ’°ðŸ’°. But if not, then for Heaven's sake, do something so we can at least replace the broken crðŸ’©p with new pieces!!! HOW DIFFICULT CAN IT BE TO GET LEDs TO WORK?!?!  \n>\n> Best Regards,  \n>   Cave Johnson III Jr.  \n>   CEO of Aperture Science  \n>   Head of Technical Engineering Department at X-COM  \n\n------\n\n### ðŸ–‡ï¸ Attachments\n\n#### ðŸ“Ž Manual for Hand-Held Hazardous Materials Scanner, Chapter III: \"Field Analysis of Elerium-Dilithium Compounds\"\n\nSamples of Elerium-Dilithium compounds found at operation sites consist of two equal parts: an Elerium isotope (energy source) with bogon number `B_elerium`, and a Dilithium isotope (regulator and inhibitor) with bogon number `B_dilithium`. Typical values of bogon numbers for both substances are usually found in range of approx. 280-300. The relationship between the bogon numbers of both isotopes determines the compound's properties:  \n- If the bogon number of the Elerium isotope in the compound is larger than the accompanying Dilithium isotope (i.e., `B_elerium > B_dilithium`), the emission of energy is greater than its inhibition.  \n- If the difference between the bogon numbers of the isotopes (i.e., `B_dilithium - B_elerium`) is odd, the compound contains unpaired bogon particles, making it unstable. Compounds with an even difference in bogon numbers have no unpaired bogon particles, making them stable.  \n\nHandling instructions for scanned samples are provided in the table below:\n\n| Energy           | Stability      | LED  | Hazard  | Handling                                                                                          |\n|-------------------|----------------|------|---------|--------------------------------------------------------------------------------------------------|\n| Inhibited         | Stable         | Green | None    | The compound is safe to handle. Bring it to the base if there is free capacity; otherwise, leave it on-site. |\n| Not inhibited     | Stable         | Green | Low     | The compound is stable with increased energy output. It can be used as fuel for Elerium-capable airships. Refuel on-site if necessary; otherwise, bring it to the base. |\n| Inhibited         | Unstable       | Green | Medium  | The compound is unstable but has reduced energy output. It can be used as ammo, explosives, or other weapons. Handle with extreme caution, using both hands. Transport to the base in safe containers. |\n| Not inhibited     | Unstable       | Red   | EXTREME | The compound is highly energetic, extremely unstable, and likely to induce self-resonance, resulting in rapid energy release. DO NOT TOUCH. LEAVE ON-SITE and notify headquarters of the location. Secure civilian areas. DO NOT TRANSPORT by any means. |\n\n#### ðŸ“Ž Manual for Hand-Held Hazardous Materials Scanner, Chapter IX: \"Firmware update guidelines\"\n\nUpdating the firmware of scanner devices that have already been shipped is highly challenging. A new version of the firmware can be uploaded to an already programmed device _only if_ the source code of the updated firmware differs from the current version by _no more than one character_ (including whitespace, comments, and newlines), and both versions must be of the same length. If these conditions are not met, the update can only be applied to newly manufactured hardware.\n\n------\n\nOnce this ticket is resolved, you can pick another open ticket from the [backlog](https://www.codewars.com/collections/xcom-backlog).",
  "totalAttempts": 274,
  "totalCompleted": 113,
  "totalStars": 2,
  "voteScore": 62,
  "tags": [
    "Debugging"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 1
  }
}