{
  "id": "5cde4e3f52910d00130dc92c",
  "name": "Football - Yellow and Red Cards",
  "slug": "football-yellow-and-red-cards",
  "category": "reference",
  "publishedAt": "2019-05-18T13:25:13.076Z",
  "approvedAt": "2019-05-25T09:59:07.053Z",
  "languages": [
    "python",
    "javascript",
    "ruby",
    "julia",
    "c"
  ],
  "url": "https://www.codewars.com/kata/5cde4e3f52910d00130dc92c",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2019-05-17T06:01:35.924Z",
  "createdBy": {
    "username": "RazNaot",
    "url": "https://www.codewars.com/users/RazNaot"
  },
  "approvedBy": {
    "username": "FArekkusu",
    "url": "https://www.codewars.com/users/FArekkusu"
  },
  "description": "Most football fans love it for the goals and excitement. Well, this Kata doesn't.\nYou are to handle the referee's little notebook and count the players who were sent off for fouls and misbehavior.\n\nThe rules:\nTwo teams, named \"A\" and \"B\" have 11 players each; players on each team are numbered from 1 to 11.\nAny player may be sent off the field by being given a red card.\nA player can also receive a yellow warning card, which is fine, but if he receives another yellow card, he is sent off immediately (no need for a red card in that case). \nIf one of the teams has less than 7 players remaining, the game is stopped immediately by the referee, and the team with less than 7 players loses. \n\nA `card` is a string with the team's letter ('A' or 'B'), player's number, and card's color ('Y' or 'R') - all concatenated and capitalized.\ne.g the card `'B7Y'` means player #7 from team B received a yellow card.\n\nThe task: Given a list of cards (could be empty), return the number of remaining players on each team at the end of the game (as a tuple of 2 integers, team \"A\" first).\nIf the game was terminated by the referee for insufficient number of players, you are to stop the game immediately, and ignore any further possible cards.\n\nNote for the random tests: If a player that has already been sent off receives another card - ignore it. ",
  "totalAttempts": 14457,
  "totalCompleted": 892,
  "totalStars": 68,
  "voteScore": 195,
  "tags": [
    "Lists",
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}