{
  "id": "5d48eed05d7d3c001e8bc2e3",
  "name": "Class Loader Bomb",
  "slug": "class-loader-bomb",
  "category": "games",
  "publishedAt": "2019-08-06T03:44:13.240Z",
  "approvedAt": null,
  "languages": [
    "java"
  ],
  "url": "https://www.codewars.com/kata/5d48eed05d7d3c001e8bc2e3",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2019-08-06T03:06:56.246Z",
  "createdBy": {
    "username": "phantamanta44",
    "url": "https://www.codewars.com/users/phantamanta44"
  },
  "description": "# Meanwhile, in JVM Land...\n\nThe class loader war is raging. You, an elite bomb specialist for the UCLF (URLClassLoader Forces), are deployed on the field in the JUnit Plateau. You're scouring through the remains of a ruined village when one of your squad mates notices a peculiar ticking sound emanating from a nearby heap of rubble. Carefully, you and your squad lift several large pieces to uncover the last thing you want to see: a fork bomb!\n\nTime slows to a crawl as your object lifetime flashes before your eyes. You remember in perfect detail the gravelly voice of your instructor, guiding you through the steps of defusing a bomb.\n\nFirst, you need to determine the fuse mechanism. Closely examining the fuse circuitry in the bomb, you discover what appears to be a primitive class loader verification device: **the bomb will explode if its class loader is the same as that of some other class**.\n\nNext, you'll need to figure out how to infiltrate and disarm the fuse circuit. Fortunately, you have your trusty bytecode injector on hand, with which you are able to inject a hook method `void defuse()` from which you can begin your work.\n\nYou pull out your pocket copy of the Java Language Specification and start to think. You only have so much time before the bomb destroys everything in a two-gigabyte radius...",
  "totalAttempts": 127,
  "totalCompleted": 8,
  "totalStars": 4,
  "voteScore": 14,
  "tags": [
    "Puzzles"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}