{
  "id": "5d617c2fa5e6a2001a369da2",
  "name": "Queue Battle",
  "slug": "queue-battle",
  "category": "algorithms",
  "publishedAt": "2019-08-25T04:54:55.895Z",
  "approvedAt": "2020-07-22T16:09:56.128Z",
  "languages": [
    "javascript",
    "go",
    "python",
    "kotlin",
    "ruby"
  ],
  "url": "https://www.codewars.com/kata/5d617c2fa5e6a2001a369da2",
  "rank": {
    "id": -4,
    "name": "4 kyu",
    "color": "blue"
  },
  "createdAt": "2019-08-24T18:04:31.850Z",
  "createdBy": {
    "username": "docgunthrop",
    "url": "https://www.codewars.com/users/docgunthrop"
  },
  "approvedBy": {
    "username": "G_kuldeep",
    "url": "https://www.codewars.com/users/G_kuldeep"
  },
  "description": "<!--Queue Battle-->\n\n<blockquote style=\"max-width:400px;min-width:200px;border-color:#777;background-color:#111;font-family:Tahoma,Verdana,serif\"><strong>“\"Forward!\", he cried from the rear<br/>\nAnd the front rank died<br/>\nThe general sat and the lines on the map<br/>\nMoved from side to side”</strong><br/><p style=\"text-align:right;font-family:serif\"><i>Us and Them</i> -- Pink Floyd</p></blockquote>\n\n<p>A few army battalions from warring nations have met on an even battlefield. Each nation has one battalion present and all battalions have an equal number of soldiers. Every soldier is armed with one rifle and unlimited ammunition. Every soldier also has perfect shooting accuracy. And all armies follow the rules of engagement below.</p>\n\n<h2 style='color:#f88'>Rules of Engagement</h2>\n<p><b>1.</b> Each army battalion forms its own straight line queue<br/>\n<b>2.</b> Each line is formed such that the head of each queue faces the head of the opposing army queue to its left (or when there are only two remaining armies, both queues face toward each other)<br/>\n<b>3.</b> All queue heads maintain equal distance from their respective targets<br/>\n<span style='color:#0c0'><b>4.</b></span> There is a <code>1</code> second delay for each queue head to fire his weapon (time taken to lift weapon, aim, then fire)<br/>\n<span style='color:#0c0'><b>5.</b></span> If a queue head gets hit by any bullets during that 1 second delay (including at the exact moment the head is expected to shoot), he falls before he can fire his rifle. Otherwise, he shoots his rifle and immediately walks back to the end of his queue.<br/>\n<span style='color:#8df;'>Note that the head will receive all bullets that reach his position during that round.</span><br/>\n<span style='color:#0c0'><b>6.</b></span> The next soldier in queue then takes his place as head at the start of the next round. If there is only one soldier remaining in a queue, he will stand in place and shoot his rifle every round until he falls or emerges victorious<br/>\n<b>7.</b> An army is eliminated when all its soldiers have fallen. When an elimination occurs, the eliminator changes their target to the next army queue in sequence at the start of the next round.<br/>\n<span style='color:#d84'>\n<b>8.A.</b></span> If an elimination occurs during the round, then all remaining armies reposition themselves at the start of the next round and repeat the cycle from step <code>2</code>. <span style='color:#8df;'>All bullets still in flight at the end of the round will miss all their targets when the repositioning occurs.</span><br/>\n<span style='color:#d84'>\n<b>8.B</b></span> If no elimination occurs in the round, start again from step <code>4</code>.<br/><br/>\n\nThe Rules of Engagement are followed until there are <code>0</code> or <code>1</code> surviving armies.<br/>\nEach round (i.e. queue shift) has a one second duration and the heads of each queue shoot at the same time<br/>\n\n<h2 style='color:#f88'>Weapons</h2>\n\nAll nations purchase their munitions from the same supplier, Discount Rifles and Bullets, Inc. (aka DRABI)<br/>\nAll DRABI rifles have perfect firing accuracy. However, because many different machines are used to manufacture the rifles, rifles may or may not have different bullet speeds.\n\nYou have a master list of bullet speeds for each rifle and you also know the initial arrangement of all queues in battle. With those resources, you seek to find out which, if any, army survives.\n\n\n<h2 style='color:#f88'>Input</h2>\n\nYour function will receive anywhere from `3` to `9` arguments:\n- The first argument will always be positive integer representing the `distance` between each queue head and his target\n- Any additional arguments will each be given as an array/tuple of positive integers; these arrays each represent an army battalion. Each `i`th value in a given array represents the bullet speed for the `i`th soldier's rifle in that battalion's queue. The bullet speed is measured as `distance / second`.\n\n\n<h2 style='color:#f88'>Output</h2>\n<p>Return the number of the surviving army, given as its argument position.\nAlso return an array/tuple of that army's surviving soldiers, by index position from its original list. This list should be sorted in queue order, starting with the queue head at time of victory.<br/>\nIf all battalions are wiped out and there are no survivors, return <code>-1</code> and an empty array/tuple.</p>\n\n\n<h2 style='color:#f88'>Test Example</h2>\n\n<img src='https://i.imgur.com/RFWZ83d.png'>\n\nThe image above references the example given below.\nIn our example, we are given `3` armies that form their respective queues. Each head (green pointed indicators) faces and fires at the opponent head to the left.\nIn the tests, each queue head shoots at the head of the next queue that follows, and completes the loop with the last queue shooting at the first.\n\nThe image below represents the queues after army `C` is eliminated. Note they change formation and face each other while always maintaining the same distance.\n\n<img src='https://i.imgur.com/pVClMJl.png'>\n\n```go\n// in Go the first argument is given as a uint32 value\n// subsequent arguments are given as arrays of uint32 values\nvar A = []uint32{98,112,121,95,63}\nvar B = []uint32{120,94,90,88,30}\nvar C = []uint32{116,144,45,200,32}\n\n// the function should return two values: an int and an array of uint32 values\n// In our example, the first army emerges as the sole survivor, and the remaining queue for that army consists of only the 3rd soldier\nQueueBattle(300,A,B,C) // returns 0,[]uint32{2}\n```\n```python\n# in Python the first argument is given as a positive int\n# subsequent arguments are given as tuples of positive ints\nA = (98,112,121,95,63)\nB = (120,94,90,88,30)\nC = (116,144,45,200,32)\n\n# the function should return a tuple of two elements: an integer and a tuple of integers\n# In our example, the first army emerges as the sole survivor, and the remaining queue for that army consists of only the 3rd soldier\nqueue_battle(300,A,B,C) # returns the tuple (0,(2,))\n```\n```javascript\n// in JavaScript the first argument is given as a positive integer\n// subsequent arguments are given as arrays of positive integers\nconst A = [98,112,121,95,63];\nconst B = [120,94,90,88,30];\nconst C = [116,144,45,200,32];\n\n// the function should return an array of two elements: an integer and an array of integers\n// In our example, the first army emerges as the sole survivor, and the remaining queue for that army consists of only the 3rd soldier\nqueueBattle(300,A,B,C); // returns the array [0,[2]]\n```\n```kotlin\n// in Kotlin the first argument is given as a positive int\n// subsequent arguments are given as IntArrays of equal size\nval a = intArrayOf(98,112,121,95,63)\nval b = intArrayOf(120,94,90,88,30)\nval c = intArrayOf(116,144,45,200,32)\n\n// the function should return a Pair containing an int and an IntArray\n// In our example, the first army emerges as the sole survivor, and the remaining queue for that army consists of only the 3rd soldier\nqueueBattle(300,a,b,c) // returns Pair(0, intArrayOf(2))\n```\n\n<details style='background:#111'>\n<summary style='color:#8df'><strong>Click here for a step-by-step of the first four rounds of our example test</strong></summary><p>\n\nWe'll refer to units of distance as DU (distance units)<br/>\n\n<strong style='color:#cc0'>Round 1</strong><br/>\nAfter initial 1 second delay, each queue head fires, then goes to the back of their respective queue.\n\n<strong style='color:#cc0'>Round 2</strong><br/>\nThe next soldier for each queue fires their weapon after a 1 second delay. At the moment each soldier fires, there are already 3 bullets in flight:<br/>\n- Bullet <code>0</code>: traveling at <code>98</code> DU per second, it has already traveled for 1 second and is now <code>202</code> DU away from its target (the head of queue <code>B</code>)\n- Bullet <code>1</code>: traveling at <code>120</code> DU per second, it is <code>180</code> DU away from its target.\n- Bullet <code>2</code>: traveling at <code>116</code> DU per second, it is <code>184</code> DU away from its target.\n\n<strong style='color:#cc0'>Round 3</strong><br/>\nAt the moment when the next queue heads fire, there are 6 bullets in flight (not including the bullets fired this round).<br/>\nThe 1st round of bullets have now traveled <code>196</code>, <code>240</code>, and <code>232</code> DU, respectively.<br/>\nThe 2nd round of bullets have traveled <code>112</code>, <code>94</code>, and <code>144</code> DU, respectively.<br/>\n\n<strong style='color:#cc0'>Round 4</strong><br/>\nFirst blood is drawn during this round.<br/>\nBefore the head of queue <code>C</code> can fire, he is hit by the first bullet shot by queue <code>B</code>. The head of queue <code>A</code> is also shot before he can fire.<br/>\nThe only head that fires his rifle is from queue <code>B</code>.<br/>\nAt this point, there are 7 bullets in flight, excluding the bullet shot this round.<br/>\nThe first bullet shot by queue <code>A</code> has now traveled <code>294</code> DU, and is therefore <code>6</code> DU away from its target. It will reach its target in round 5, before the queue head can fire.\n\n</p>\n</details>\n\n<p>In our example, we saw the new positioning when going from <code>3</code> to <code>2</code> queues. Other tests will have a random number of queues (up to a max of <code>8</code>).<br/>\nThe following diagrams serve as a visual guide to show other battle positions formed depending on the number of active queues.</p>\n\n<img src='https://i.imgur.com/qk791nn.png'>\n<img src='https://i.imgur.com/XuMmBzt.png'>\n\n<h2 style='color:#f88'>Technical Details</h2>\n\n- All tests will be valid\n- Test constraints:\n\t- `2 <= number of queues <= 8`\n\t- `8 <= bullet speed < 2e6`\n\t- `80 <= distance < 1e6`\n\t- `bullet speed >= distance/10`\n\t- `5 <= queue length < 2000`\n- Use Python 3.6+ for the Python translation\n- In JavaScript, `module` and `require` are disabled\n- Full Test Suite: `10` fixed tests and `150` random tests\n\n\n<p>If you enjoyed this kata, be sure to check out <a href='https://www.codewars.com/users/docgunthrop/authored' style='color:#9f9;text-decoration:none'>my other katas</a></p>",
  "totalAttempts": 689,
  "totalCompleted": 118,
  "totalStars": 106,
  "voteScore": 47,
  "tags": [
    "Arrays",
    "Puzzles",
    "Games",
    "Algorithms"
  ],
  "contributorsWanted": false,
  "unresolved": {
    "issues": 0,
    "suggestions": 2
  }
}