{
  "id": "603928e6277a4e002bb33d5a",
  "name": "Binary relation optimization",
  "slug": "binary-relation-optimization",
  "category": "algorithms",
  "publishedAt": "2021-02-26T19:46:36.731Z",
  "approvedAt": "2021-02-27T11:14:24.216Z",
  "languages": [
    "python",
    "javascript",
    "julia",
    "ruby"
  ],
  "url": "https://www.codewars.com/kata/603928e6277a4e002bb33d5a",
  "rank": {
    "id": -5,
    "name": "5 kyu",
    "color": "yellow"
  },
  "createdAt": "2021-02-26T16:59:18.398Z",
  "createdBy": {
    "username": "FArekkusu",
    "url": "https://www.codewars.com/users/FArekkusu"
  },
  "approvedBy": {
    "username": "user9644768",
    "url": "https://www.codewars.com/users/user9644768"
  },
  "description": "## Theory\n\nBinary relation is a system which encodes relationship between elements of 2 sets of elements. If a pair `(x, y)` is present in a binary relation, it means that the element `x` from the first set is related to the element `y` from the second set.\n\nOne of the spheres where binary relations are used is decision support systems where they define partial ordering between elements of a set. If a pair `(x, y)` is present in a binary relation, it means that the option `x` is better than the option `y`.\n\nBinary relation optimization is a process of searching for a set of options which are (in some way) better than other options in that binary relation.\n\n## Task\n\nGiven a binary relation, you have to perform an optimization on it. In this case, find a list of options which are collectively better than all the other options. Such options satisfy the following 2 criteria:\n\n* all the options included in the result are not directly related to each other\n* for each option not included in the result there must be at least one better option which is included in the result\n\nThe binary relation will be provided in the form of an adjacency matrix - a matrix `m` where a non-zero element `m[x][y]` means that the option `x` is better than the option `y`. (You can also interpret it as an adjacency matrix of a graph, where the better vertex `x` has a unidirectional connection to the worse vertex `y`).\n\nAssume the options are numbered from `0` to `n`, and directly mapped to the adjacency matrix (the first row specifies the relations of the option `0`, the second row specifies the relations of the option `1`, and so on). Your solution should return a sorted list of options which are optimal for the given binary relation.\n\n### Example (as a matrix, and a graph equivalent to it)\n\n```\n[\n    [0, 0, 1, 0, 0, 0, 0, 0],\n    [0, 0, 0, 1, 0, 0, 1, 0],\n    [0, 0, 0, 0, 1, 0, 0, 0],\n    [0, 0, 0, 0, 0, 1, 0, 0],\n    [0, 0, 0, 0, 0, 0, 0, 1],\n    [0, 0, 0, 0, 0, 0, 1, 0],\n    [0, 0, 0, 0, 0, 0, 0, 1],\n    [0, 0, 0, 0, 0, 0, 0, 0]\n]\n\n\n( 0 )  --->  ( 2 )  --->  ( 4 )  ----------------------\n                                                      |\n                                                      V\n( 1 )  --->  ( 3 )  --->  ( 5 )  --->  ( 6 )  --->  ( 7 )\n  |                                      ^\n  |                                      |\n  ----------------------------------------\n```\n\nThe optimal options for this binary relation are `[0, 1, 4, 5]`:\n\n* The options `0` and `1` are not worse than any other option - included\n* The options `2`, `3`, and `6` are directly related to `0` and `1` which have been found to be a part of the solution, hence they don't satisfy the first criteria - ignored\n* The options `4` and `5` are not related to any of the elements of the solution, hence they satisfy the first criteria - included\n* The option `7` is directly related to `4` which has been found to be a part of the solution, hence it doesn't satisfy the first criteria - ignored\n\nThis solution also satisfies the second criteria, as options `2`, `3`, `6`, and `7` are all reachable from options `0`, `1`, `4`, or `5`.",
  "totalAttempts": 677,
  "totalCompleted": 76,
  "totalStars": 18,
  "voteScore": 31,
  "tags": [
    "Algorithms",
    "Graph Theory"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}