{
  "id": "60b3818568849a001958b96a",
  "name": "Intelligent Password Cracking",
  "slug": "intelligent-password-cracking",
  "category": "algorithms",
  "publishedAt": "2021-05-30T22:13:12.193Z",
  "approvedAt": null,
  "languages": [
    "python"
  ],
  "url": "https://www.codewars.com/kata/60b3818568849a001958b96a",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2021-05-30T12:13:57.620Z",
  "createdBy": {
    "username": "Emilostuff",
    "url": "https://www.codewars.com/users/Emilostuff"
  },
  "description": "<h2>Introduction</h2>\n\nDear <i>LulzHack4r</i>,\n\nRecently a fresh leak of passwords was discovered. It is a list with a lot of password hashes (identified as MD5 hashes) and a corresponding e-mail. We have been trying to crack the passwords using brute force methods, but to no luck.\n\nSo our new tactic is a more directed approach; we will try to guess the passwords based on common patterns and acquired knowledge. More precisely we will use the fact that a lot of people's passwords are based on names or places significant to them ...\n- maybe with <u>a capitalized letter or two</u> in there, otherwise lowercase. \n- often followed by <u>one or two digits</u>.\n- ... sometimes (also) followed by <u>a special character</u> such as one of these: '!@#$%&?'\n\nSounds simple enough? Well, these names and places could be a lot of different things, so it's not exactly straight forward. \n\nLuckily our team has been searching the web and social media for names of family members, friends and pets as well as cities, areas and other keywords that might be connected to the owner of the given e-mail adress. This insight could potentially help us crack some uf the passwords.\n\n<h2>Task</h2>\n\nYour job is to write a function that receives an MD5 hash and a list of connected keywords and returns the correct password if it can be found using the criterias described above – otherwise return None.\n\nKeywords less then 6 characters are sometimes repeated twice, so remember to check for that as well. Also, a password doesn't contain spaces, so be sure to check your input.\n\nWe wish you good luck! \n\n<h2>Examples</h2>\n\nHere are some examples of passwords you should be able to find, given that our team has provided the correct keywords:\n```python\n'michael78'\n'EliZabeth#'\n'jerryJerry99!'\n'Darlington@'\n'CopenhageN'\n'precious'\n'aNNabelle01'\n'SouthampTon41#'\n```\n\n<h2>Extra</h2>\nA lot of the inspiration to this kata came from <a href=\"https://www.youtube.com/watch?v=7U-RbOKanYs\", style=\"color:#ff9933\">this video</a>. It is a great explanation of the topic and quite entertaining too.",
  "totalAttempts": 100,
  "totalCompleted": 20,
  "totalStars": 6,
  "voteScore": 41,
  "tags": [
    "Security",
    "Algorithms"
  ],
  "contributorsWanted": false,
  "unresolved": {
    "issues": 1,
    "suggestions": 0
  }
}