{
  "id": "62969396fc636500531832a4",
  "name": "N-Hybrid Inheritance",
  "slug": "n-hybrid-inheritance",
  "category": "games",
  "publishedAt": "2022-06-07T22:05:38.989Z",
  "approvedAt": "2024-11-09T13:37:41.070Z",
  "languages": [
    "python"
  ],
  "url": "https://www.codewars.com/kata/62969396fc636500531832a4",
  "rank": {
    "id": -5,
    "name": "5 kyu",
    "color": "yellow"
  },
  "createdAt": "2022-05-31T22:15:50.433Z",
  "createdBy": {
    "username": "ColderThanSeptember",
    "url": "https://www.codewars.com/users/ColderThanSeptember"
  },
  "approvedBy": {
    "username": "dfhwze",
    "url": "https://www.codewars.com/users/dfhwze"
  },
  "description": "'The Punnett square is a square diagram that is used to predict the genotypes of a particular cross or breeding experiment. It is named after Reginald C. Punnett, who devised the approach in 1905. The diagram is used by biologists to determine the probability of an offspring having a particular genotype. The Punnett square is a tabular summary of possible combinations of maternal alleles with paternal alleles.' - Wikipedia\n\nWhen mating a mother (Bb) and a father (Bb), the offspring genotype is predicted by finding every possible combination of alleles from the parents. As shown in the diagram below the four possible outcomes are BB, Bb, Bb and bb. This is known as Monohybrid Inheritance as only a single gene (or letter) is being utilised\n\n```\n┌─┬──┬──┐\n│ │B │b │\n├─┼──┼──┤\n│B│BB│Bb│\n├─┼──┼──┤\n│b│Bb│bb│\n└─┴──┴──┘\n```\n\nA capital letter implies that the allele for the gene is dominant and a non capital letter implies that the allele for the gene is recessive. If the B allele is lets say brown eyes and the b allele is lets say blue eyes. If the alleles of a person are BB, they will have brown eyes. Similarly if the alleles of a person are bb, they will have blue eyes. However if the alleles of a person are Bb they have brown eyes as the dominant B or brown allele will 'dominate' over the recessive b or blue allele.\n\nFurthermore this type of inheritance can be extended for multiple genes. If there are two different genes, this is known as dihybrid inheritance. For example for a mother with the alleles RrAa and a father with the alleles RrAa, their offspring will have 16 possible genotypes, shown in the Punnett square below.\n\n```\n┌──┬────┬────┬────┬────┐\n│  │RA  │Ra  │rA  │ra  │\n├──┼────┼────┼────┼────┤\n│RA│RRAA│RRAa│RrAA│RrAa│\n├──┼────┼────┼────┼────┤\n│Ra│RRAa│RRaa│RrAa│Rraa│\n├──┼────┼────┼────┼────┤\n│rA│RrAA│RrAa│rrAA│rrAa│\n├──┼────┼────┼────┼────┤\n│ra│RrAa│Rraa│rrAa│rraa│\n└──┴────┴────┴────┴────┘\n```\n\nYour task if to find the probability of an offspring expressing certain alleles depending upon the genetic makeup of both parents rounded to 18 decimal points. The input will consist of the the Father's alleles, the Mothers alleles and the string of expressed alleles of the offspring. \n\nFor example if the Father's alleles are Bb and the Mother's alleles are Bb and the offspring's potential allele expression is b, the probability is 0.25 or 1/4 as 1 out of the 4 squares above express the allele b.\n\nFurthermore if the Father's alleles are RrAa and the Mother's alleles are RrAa and the offspring potential allele expression is RA, the probability is 0.5625 or 9/16 as 9 out of the 16 squares above express the alleles RA.\n\nNote that the input string of the mother and the father will always have the same length and that the offspring input string will always be half that. The maximum amount of pairs of alleles in this Kata is 5.\n",
  "totalAttempts": 208,
  "totalCompleted": 49,
  "totalStars": 7,
  "voteScore": 39,
  "tags": [
    "Probability"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}