{
  "id": "62bf879e8e54a4004b8c3a92",
  "name": "Extreme Hat Game",
  "slug": "extreme-hat-game",
  "category": "games",
  "publishedAt": "2022-07-03T16:59:50.380Z",
  "approvedAt": "2022-10-17T11:37:37.151Z",
  "languages": [
    "haskell",
    "python"
  ],
  "url": "https://www.codewars.com/kata/62bf879e8e54a4004b8c3a92",
  "rank": {
    "id": -5,
    "name": "5 kyu",
    "color": "yellow"
  },
  "createdAt": "2022-07-01T23:47:42.423Z",
  "createdBy": {
    "username": "porkfreezer",
    "url": "https://www.codewars.com/users/porkfreezer"
  },
  "approvedBy": {
    "username": "Kacarott",
    "url": "https://www.codewars.com/users/Kacarott"
  },
  "description": "[Do the simpler version first!](https://www.codewars.com/kata/618647c4d01859002768bc15)\n\nIn this generalized version of the riddle, each 'player' has a hat and must guess what color it is. The players are lined up such that they can see the hats of everyone in front of them, but not their own hat or those of the players behind them. Each player must guess the color of their own hat, taking turns from back to front. In order to win, only one guess may be wrong.\n\nThe team will be told which colors of hats will be present (but not how many of each color) and given time to develop a strategy before they get their hats.\n\nYour task is to create the team's strategy by writing a function that returns the guess for a player based on the information they have.\n\n### Inputs\n  - a list of all colors of hat (possibly) present.\n  \n    ```if:haskell\n    **Colors can be any Eq type; not just Strings.**\n    ```\n  - a list of previous guesses, starting from the back (empty for the first player).\n  - a list of the hats the player can see, starting with the one directly in front of them (empty for the last player).\n\n### Output\n  - the guess, which should be one of the elements from the list of colors passed in\n\nAll inputs in the test cases will follow the rules of the riddle. Your solution *should* work for any number of colors, but the test cases will only go up to 5 colors and 100 players. Tests assume the first person to guess is wrong, since it is impossible to know what color hat they have.\n\n\n",
  "totalAttempts": 221,
  "totalCompleted": 51,
  "totalStars": 12,
  "voteScore": 45,
  "tags": [
    "Riddles"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}