{
  "id": "62c5c7d138f0cf002f577a15",
  "name": "100 prisoners riddle (Neutral guard)",
  "slug": "100-prisoners-riddle-neutral-guard",
  "category": "games",
  "publishedAt": "2022-07-06T20:41:56.887Z",
  "approvedAt": null,
  "languages": [
    "java"
  ],
  "url": "https://www.codewars.com/kata/62c5c7d138f0cf002f577a15",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2022-07-06T17:35:13.618Z",
  "createdBy": {
    "username": "beyaz.frambuaz",
    "url": "https://www.codewars.com/users/beyaz.frambuaz"
  },
  "description": "This kata is part of a series:\n- [100 prisoners riddle (Neutral guard)](https://www.codewars.com/kata/62c5c7d138f0cf002f577a15)\n- [100 prisoners riddle (Benevolent guard)](https://www.codewars.com/kata/62c74680c529230064eeabe0)\n- [100 prisoners riddle (Insidious guard)](https://www.codewars.com/kata/62c8014af6617400623b9512)\n\n# Background\nThis is a famous riddle, check out this [wiki](https://en.wikipedia.org/wiki/100_prisoners_problem) article or this neat [youtube](https://youtu.be/iSNsgj1OCLA) video if you are curious.\n\n100 death row prisoners numbered `0-99` are offered a chance to survive. There is a room with 100 boxes numbered `0-99`. Tickets with prisoners' numbers are placed randomly inside the boxes. In order to get pardon for all 100 prisoners each prisoner needs to enter the room and find their ticket in any `50` boxes of their choosing. If even one prisoner fails - they all fail. Prisoners can only communicate before they enter the room and leave the room in the same state as when they entered.\n\nSince the solution is publically available - it is merely a setup for this kata. The basic idea is that each prisoner has 1/2 chance for success, but all 100 prisoners would have a collective chance of each finding their ticket as (1/2)^100 which is not very optimistic. An optimal strategy is for each prisoner to \n1. find a box with their number on it\n2. if they find their ticket inside - they won and the search is over\n3. otherwise the box contains another prisoner's ticket and this number is used to repeat the steps until the prisoner finds their ticket or runs out of 50 attempts\n\nThis strategy ensures that when you start with your number you are guaranteed to be on the sequence that ends with that ticket. This simple strategy provides a 31.18% chanse for all prisoners to find their ticket.\n\n# Task\nYou are in the shoes of a **neutral** guard who likes to take their mind off the misery of the human condition in prison by calculating things in their head. You know the arrangement of the tickets in the boxes and want to figure out whether the next 100 prisoners have a chance to get pardoned or not before the first one even enters the room.\n### Input\nYou will get an array of 100 integers `0-99` placed in random order (e.g. `[43,0,98,44,...,32,1,77]`). Each integer will appear only once. There is no need for any validations.\n### Output\nReturn a `true` of `false` whether all 100 prisoners can find their tickets using the above strategy.",
  "totalAttempts": 80,
  "totalCompleted": 20,
  "totalStars": 3,
  "voteScore": 26,
  "tags": [
    "Puzzles",
    "Logic",
    "Algorithms",
    "Riddles"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}