{
  "id": "6375587af84854823ccd0e90",
  "name": "Block Letter Printer",
  "slug": "block-letter-printer",
  "category": "algorithms",
  "publishedAt": "2022-11-16T22:13:33.564Z",
  "approvedAt": "2022-12-03T12:56:48.108Z",
  "languages": [
    "python",
    "ruby",
    "java",
    "javascript",
    "rust",
    "typescript",
    "cpp",
    "scala",
    "kotlin",
    "coffeescript",
    "swift"
  ],
  "url": "https://www.codewars.com/kata/6375587af84854823ccd0e90",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2022-11-16T21:39:06.473Z",
  "createdBy": {
    "username": "Galvlbit",
    "url": "https://www.codewars.com/users/Galvlbit"
  },
  "approvedBy": {
    "username": "Blind4Basics",
    "url": "https://www.codewars.com/users/Blind4Basics"
  },
  "description": "Write a function that accepts a string consisting only of ASCII letters and space(s) and returns that string in block letters of 5 characters width and 7 characters height, with one space between characters.\n\n### Rules\n\n* The block letters should consist of corresponding capital letters.\n* It's irrelevant whether input consists of lower or upper case letters.\n* Any leading and/or trailing spaces in input should be ignored.\n* Empty strings or such containing only spaces should return an empty string.\n* The remaining spaces (between letters and/or words) are to be treated as any other character. This means that there will be six spaces in output for a space in input, or a multiple of six, if there were more spaces - plus the one from preceding character!\n* Trailing spaces should be removed in the resulting string (and also in its' substrings!).\n* In order to facilitate debugging, test failure messages mangle the output: spaces are replaced with the bullet character `U+2022`, while end-of-line characters `\\n` are visible.\n\n### Preloaded Map\n\nTo ease your work and reduce the amount of hardcoding in your solution, there is a preloaded map/dictionary named `alpha` / `ALPHA` (depending on your language) that associates a lowercase character (including the space character) to a collection of the 7 string segments that make up the character from top to bottom. See the initial code in your language for more details.\n\n### Example\n\nThe input string `\"heLLo WorLD\"` should result in an output that looks like this:\n\n```\nH   H EEEEE L     L      OOO        W   W  OOO  RRRR  L     DDDD\nH   H E     L     L     O   O       W   W O   O R   R L     D   D\nH   H E     L     L     O   O       W   W O   O R   R L     D   D\nHHHHH EEEEE L     L     O   O       W W W O   O RRRR  L     D   D\nH   H E     L     L     O   O       W W W O   O R R   L     D   D\nH   H E     L     L     O   O       W W W O   O R  R  L     D   D\nH   H EEEEE LLLLL LLLLL  OOO         W W   OOO  R   R LLLLL DDDD\n```\n\nAs most of the characters can be printed in many different ways (think of Q, F or W), here is what they're expected to look like:\n```\n AAA  BBBB   CCC  DDDD  EEEEE FFFFF  GGG  H   H IIIII JJJJJ K   K L     M   M N   N  OOO  PPPP   QQQ  RRRR   SSS  TTTTT U   U V   V W   W X   X Y   Y ZZZZZ\nA   A B   B C   C D   D E     F     G   G H   H   I       J K  K  L     MM MM NN  N O   O P   P Q   Q R   R S   S   T   U   U V   V W   W X   X Y   Y     Z\nA   A B   B C     D   D E     F     G     H   H   I       J K K   L     M M M N   N O   O P   P Q   Q R   R S       T   U   U V   V W   W  X X   Y Y     Z\nAAAAA BBBB  C     D   D EEEEE FFFFF G GGG HHHHH   I       J KK    L     M   M N N N O   O PPPP  Q   Q RRRR   SSS    T   U   U V   V W W W   X     Y     Z\nA   A B   B C     D   D E     F     G   G H   H   I       J K K   L     M   M N   N O   O P     Q Q Q R R       S   T   U   U V   V W W W  X X    Y    Z\nA   A B   B C   C D   D E     F     G   G H   H   I       J K  K  L     M   M N  NN O   O P     Q  QQ R  R  S   S   T   U   U  V V  W W W X   X   Y   Z\nA   A BBBB   CCC  DDDD  EEEEE F      GGG  H   H IIIII JJJJ  K   K LLLLL M   M N   N  OOO  P      QQQQ R   R  SSS    T    UUU    V    W W  X   X   Y   ZZZZZ\n```\n\n\n<font color=\"gold\"><i>Please leave a rating if you liked this kata!</i></font>\n\n```if:python\nAfter completing this kata you might want to check out the [\\[code golf\\]](https://www.codewars.com/kata/6391ead97f85a7bac7fd1c1b) version as well.\n```\n",
  "totalAttempts": 4471,
  "totalCompleted": 889,
  "totalStars": 92,
  "voteScore": 147,
  "tags": [
    "Strings",
    "ASCII Art",
    "Algorithms"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}