{
  "id": "63d4b700bce90f0024a9ca19",
  "name": "Joyful Transpiler",
  "slug": "joyful-transpiler",
  "category": "games",
  "publishedAt": "2023-01-31T03:35:37.415Z",
  "approvedAt": "2024-02-15T02:37:04.076Z",
  "languages": [
    "python"
  ],
  "url": "https://www.codewars.com/kata/63d4b700bce90f0024a9ca19",
  "rank": {
    "id": -5,
    "name": "5 kyu",
    "color": "yellow"
  },
  "createdAt": "2023-01-28T05:47:44.723Z",
  "createdBy": {
    "username": "potzko",
    "url": "https://www.codewars.com/users/potzko"
  },
  "approvedBy": {
    "username": "lachesism",
    "url": "https://www.codewars.com/users/lachesism"
  },
  "description": "# Background\nAfter being inspired by Marie Kondo's teachings on minimalism, you've decided to apply her principles to your computer science work. You've noticed that while keyboard has 104 keys your hands only have ten fingers, and two palms. and so you've made the decision to write code that contains no more than 12 unique characters. Your goal is to help others find the same joy and ergonomic benefits you have found in writing minimalist code.\n\n# Task\nWrite a Python function joy that takes in a string containing valid, but unjoyful Python code and returns a string containing equivalent, minimalist code with no more than 12 unique characters.  \nyour code should contain no more then 12 unique characters\n\n# Input\nA string of python code (len(code) < 10^6), representing the input unjoyful Python code.\n# Output\nA string representing the equivalent python code, minimalist code that contains no more than 12 unique characters.\nExample\n```python\na = 1 + 2 + 3 + 4 + 5 + 6 + 7 + 8 + 9\n```\nhas thirteen chars explicitly: '1','2','3','4','5','6','7','8','9',' ','=','+',and 'a'\nhere is an example of equivalent joyful code:\n```python\na = 45\n```\nthis code only has 5 chars explicitly: '4','5',' ','=', and 'a'\n\n# Notes\n* Spaces, new lines, and tabs are considered characters in the code, but end of file is not.\n* Your code should have no more than 12 unique characters and as such might be difficult to read, please post your auxilery code in a comment to your answer\n* if you think you are cheating, you are not\n* For an extra challenge you may want to get the solution under 10 unique chars :)",
  "totalAttempts": 267,
  "totalCompleted": 19,
  "totalStars": 5,
  "voteScore": 27,
  "tags": [
    "Puzzles",
    "Restricted"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}