{
  "id": "6452bf8c332961000fbedcb5",
  "name": "Prepare for the olympic games ... Skating",
  "slug": "prepare-for-the-olympic-games-dot-dot-dot-skating",
  "category": "algorithms",
  "publishedAt": "2023-07-23T14:14:26.780Z",
  "approvedAt": "2023-11-22T17:36:20.666Z",
  "languages": [
    "cpp"
  ],
  "url": "https://www.codewars.com/kata/6452bf8c332961000fbedcb5",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2023-05-03T20:09:48.869Z",
  "createdBy": {
    "username": "eurydice5717",
    "url": "https://www.codewars.com/users/eurydice5717"
  },
  "approvedBy": {
    "username": "E-One",
    "url": "https://www.codewars.com/users/E-One"
  },
  "description": "Skating on the Lake\n\nThis year's figure skating event is hosted by India, whose famous Loktak Lake has become completely frozen with the cooling of the climate.\n\nThe judging rules for the skating event have not changed: each judge gives a technical score between 0 and 10. Of the 12 judges, only 9 are randomly selected by a computer, and it is the average of their 9 scores that will give the final score of the skater's performance.\n\nIn order to create a fair competition, you want to produce a model that calculates the impact of random draw bad luck on the potential score of a performance.\n\nBased on the score given by each of the 12 judges, give the minimum, average, median and maximum score that can be obtained after the random draw. The process is assumed to be uniform, so each draw of 9 judges is equiprobable.\n\nInput data: a list of the 12 notes given by the judges, floating point with one digit after the decimal point.\n\nRequired output: a tuple of 4 numbers: respectively the minimum, average, median and maximum score that the skater is expected to obtain.\n\nExample\n\nFor the input {6.7,4.2,4.3,7.0,0.0,2.8,3.9,1.3,6.9,6.0,7.3,3.2},\nthe expected answer is {3.6,4.4666,4.4333,5.5}.\n\nExplanation:\n- The worst possible score is 3.6, obtained by taking the average of the following 9 judges: 6.7, 4.2, 4.3, 0.0, 2.8, 3.9, 1.3, 6.0, 3.2\n- Of ALL the possible scores, the average of scores is 4.4666... and their median is 4.4333...\n- The best possible score is 5.5, obtained by taking the average of the following 9 judges: 6.7, 4.2, 4.3, 7.0, 3.9, 6.9, 6.0, 7.3, 3.2\n\n_Have fun!\n\nNotes:\\\n- a tolerance of 10^-3 will be applied to each result, it is **NOT** another weird stuff about rounding or truncating...\\\n- 100 fixed tests, 5000 random tests\\\n- extra challenge: can you use STL algorithms and... no for loops ?\n",
  "totalAttempts": 128,
  "totalCompleted": 35,
  "totalStars": 4,
  "voteScore": 27,
  "tags": [
    "Algorithms"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}