{
  "id": "6486f17524f76806ad0b0b56",
  "name": "Employees and managers: part 2 - reloaded",
  "slug": "employees-and-managers-part-2-reloaded",
  "category": "reference",
  "publishedAt": "2023-06-12T11:08:54.698Z",
  "approvedAt": "2023-06-28T10:19:55.318Z",
  "languages": [
    "sql"
  ],
  "url": "https://www.codewars.com/kata/6486f17524f76806ad0b0b56",
  "rank": {
    "id": -5,
    "name": "5 kyu",
    "color": "yellow"
  },
  "createdAt": "2023-06-12T10:20:37.271Z",
  "createdBy": {
    "username": "bornForThis",
    "url": "https://www.codewars.com/users/bornForThis"
  },
  "approvedBy": {
    "username": "dfhwze",
    "url": "https://www.codewars.com/users/dfhwze"
  },
  "description": "You have been provided with a PostgreSQL database that contains an `employees` table. The `employees` table has the following structure:\n\n* `id`: an integer column that uniquely identifies each employee.\n* `name`: a text column that contains the name of the employee.\n* `manager_id`: an integer column that identifies the manager of each employee. The `manager_id` corresponds to an `id` in the same employees table. This means that our table has a recursive relationship with itself - an employee can be a manager to other employees. It is nullable: top managers do not have managers above them.\n\nThe task is exactly the same as in the part 2, namely:\n```\nYou are required to create a SQL query that generates a report that includes each employee's id, name, and a column named management_chain that presents the full hierarchy of managers above that employee, from the employee's immediate manager to the top manager, in a single string.\n\nEach manager in the hierarchy should be represented by their name and id in parentheses. The immediate manager should appear first in the management_chain, followed by their manager, and so forth until the top manager.\n\nEach manager in the management_chain should be separated by \" -> \".\n\nThe query should return the following columns:\n\n`id`: The ID of the employee.\n`name`: The name of the employee.\n`management_chain`: A text string representing the chain of the employee's managers, starting with their immediate manager and continuing all the way up to the top-level manager. Each manager in the chain should be represented as their name followed by their ID in parentheses, and different managers should be separated by ' -> '. If an employee is a top-level manager, this column should be an empty string, not NULL.\n\nNotes:\n\n* Assume that the hierarchy depth is unknown and could be arbitrarily large.\n* Result should be ordered by id in asc order\n* Please note that the organization's management hierarchy does not have cyclic relationships. In other words, it is guaranteed that there will be no situations where an employee's chain of managers loops back on itself (e.g., A's manager is B, B's manager is C, and C's manager is A).\n```\nBut now I want you to `not` use recursive CTE's for this same question. Can you do it fully [I-TE-RA-TI-VUH](https://youtu.be/OTfp2_SwxHk?t=169)?\n\nGood luck!\n\n### Desired Output\n\nThe desired output should look like this:\n```\nid  |  name             | management_chain                         |\n----+-------------------+------------------------------------------|\n 1  |  Odell Cummerata  |                                          | \n 2  |  Myriam Jones     | Odell Cummerata (1)                      |\n 3  |  Jarod Walsh      | Odell Cummerata (1) -> Myriam Jones (2)  |\n...\n```\n",
  "totalAttempts": 590,
  "totalCompleted": 58,
  "totalStars": 10,
  "voteScore": 21,
  "tags": [
    "SQL",
    "Databases",
    "Restricted"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 1,
    "suggestions": 0
  }
}