{
  "id": "6495c7f5a994a6001dbbc64f",
  "name": "The Magic Trick To Guess  Number Of People ",
  "slug": "the-magic-trick-to-guess-number-of-people",
  "category": "games",
  "publishedAt": "2023-06-23T18:58:34.184Z",
  "approvedAt": null,
  "languages": [
    "python"
  ],
  "url": "https://www.codewars.com/kata/6495c7f5a994a6001dbbc64f",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2023-06-23T16:27:33.847Z",
  "createdBy": {
    "username": "airshawn",
    "url": "https://www.codewars.com/users/airshawn"
  },
  "description": "The Magic Trick To Guess Number Of People :\n\n&nbsp; &nbsp; This is a magic trick my teacher used to perform during math class.\n\n&nbsp; &nbsp; I personally find it fascinating.\n\n&nbsp; &nbsp; Here's how the trick goes:\n\n&nbsp; &nbsp; First, the teacher asks the students to choose between scissors or paper and make the corresponding hand gesture when the teacher leaves the classroom.\n\n&nbsp; &nbsp; Then the teacher walks out of the room, and one student calculates the total number of fingers raised by the class.\n\n&nbsp; &nbsp; After that, the teacher comes back in and asks for the total number of fingers.\n\n&nbsp; &nbsp; Finally, after a moment of thought, the theacher reveals the number of students who chose scissors and the number of students who chose paper.\n\n&nbsp; &nbsp; This really impressed us students.\n\nTask:\n\n&nbsp; &nbsp; Your task is to recreate the wonder of this magic trick.\n\n&nbsp; &nbsp; I will give you two integers, where the first integer represents the number of fingers and the second integer represents the total number of students in the class.\n\n```python\nthe_magic_trick_to_guess_the_number_of_people(39, 12) -> (7, 5)\n# Directions: Scissors have 2 fingers and paper has 5 fingers, so scissors * 7 students + paper * 5 students = 12 students.\n\n```\n&nbsp; &nbsp; You will return a tuple to me, where the first element represents the number of people who chose scissors, and the second element represents the number of people who chose paper.\n\nWe welcome all codewarriors to leave comments on areas they would like to improve or maintain.\n\n--Good luck codewarriors--",
  "totalAttempts": 25,
  "totalCompleted": 6,
  "totalStars": 0,
  "voteScore": 1,
  "tags": [
    "Mathematics",
    "Puzzles"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 1,
    "suggestions": 0
  }
}