{
  "id": "6496dbe08673b33ddae5c733",
  "name": "Developer of the Day",
  "slug": "developer-of-the-day",
  "category": "reference",
  "publishedAt": "2023-06-24T12:34:43.010Z",
  "approvedAt": "2023-07-16T11:25:12.883Z",
  "languages": [
    "sql"
  ],
  "url": "https://www.codewars.com/kata/6496dbe08673b33ddae5c733",
  "rank": {
    "id": -4,
    "name": "4 kyu",
    "color": "blue"
  },
  "createdAt": "2023-06-24T12:04:48.776Z",
  "createdBy": {
    "username": "bornForThis",
    "url": "https://www.codewars.com/users/bornForThis"
  },
  "approvedBy": {
    "username": "dfhwze",
    "url": "https://www.codewars.com/users/dfhwze"
  },
  "description": "In the product IT company, the \"Developer of the Day\" (DoD) is responsible for handling hotfixes in production for that day. This responsibility rotates among the developers to ensure fair distribution of the task.\n\nYou are working with the backend team which has been chosen to supply the DoD on a rotating basis. The team lead has asked for a fair schedule to be generated: a list of developers from the backend team, ordered by their age in descending order (from youngest to oldest). The schedule should run for the working days (Monday to Friday) in the months of July, August, and September of 2023. Every team member should become the Developer of the Day in a cyclical manner, starting from the youngest member of the team. \n\nFor example, if there were 5 developers in the team, the first one in the list (the youngest) would become the DoD on the 3rd of July (because it is first working day in July). Then, in consecutive working days, the other four would also take turns, and then the cycle would repeat until the end of September.\n\nWe have `employees` with the the following columns:\n\n* `employee_id`: A unique integer identifier for each employee.\n* `full_name`: A string representing the employee's full name.\n* `team`: A string that specifies which team the employee is part of. The team can be one of the following four: \"backend\", \"frontend\", \"devops\", or \"design\".\n* `birth_date`: A date that represents the employee's birthdate.\n\nThe report should return the following columns:\n\n* `date`: This column should represent the date of the day in 2023 when the developer is designated as the Developer of the Day (DoD). The dates should fall within the months of July, August, and September and should only include working days, i.e., Monday to Friday. The datatype of this column should be date, and it should not include a time component.\n\n* `day_of_week`: This column should represent the day of the week corresponding to the date column. The values in this column should be the English names of the weekdays, such as Monday, Tuesday, etc.\n\n* `employee_id`: This column should represent the unique identifier (ID) of the developer who is designated as the DoD for the day. This ID should match the id of the developer in employees table.\n\n* `full_name`: This column should represent the full name of the developer who is designated as the DoD for the day. \n\n##### Notes:\n\n*  Let's assume for this task that there are no developers with the same `birth_date` - tests are written to ensure that no two employees have the same birth date. \n\nGLHF! \n\n### Desired Output\n\nThe desired output should look like this:\n\n<table><!----><tr><th>date</th><th>day_of_week</th><th>employee_id</th><th>full_name</th></tr><tr><td>2023-07-03</td><td>Monday   </td><td>29</td><td>Carl Smith</td></tr><tr><td>2023-07-04</td><td>Tuesday  </td><td>25</td><td>Yara Smith</td></tr><tr><td>2023-07-05</td><td>Wednesday</td><td>21</td><td>Ursula Smith</td></tr></table>\n...",
  "totalAttempts": 1753,
  "totalCompleted": 210,
  "totalStars": 22,
  "voteScore": 52,
  "tags": [
    "SQL",
    "Databases"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 1,
    "suggestions": 0
  }
}