{
  "id": "64b2b04e22ad520058ce22bd",
  "name": "Prime Path Finder",
  "slug": "prime-path-finder",
  "category": "algorithms",
  "publishedAt": "2023-07-15T17:05:08.676Z",
  "approvedAt": "2023-07-17T18:34:02.802Z",
  "languages": [
    "python"
  ],
  "url": "https://www.codewars.com/kata/64b2b04e22ad520058ce22bd",
  "rank": {
    "id": -5,
    "name": "5 kyu",
    "color": "yellow"
  },
  "createdAt": "2023-07-15T14:42:22.237Z",
  "createdBy": {
    "username": "Tördi",
    "url": "https://www.codewars.com/users/T%C3%B6rdi"
  },
  "approvedBy": {
    "username": "dfhwze",
    "url": "https://www.codewars.com/users/dfhwze"
  },
  "description": "**Intro:**\nHear ye, hear ye! Brave programmers, wizards of the digital realm, I beseech thee to embark upon a quest of prime numbers and mystic algorithms! Prepare thine trusty Python 3.11 swords, for we shall traverse the mystical graph and unveil the **shortest path** betwixt two four-digit prime numbers, but thou shalt also face a series of a hundred randomized trails, culminating in a grand total of 112!\n\n**Primary Objective:**\nFear not, for I shall guide thee in this odyssey of code! Thou shalt construct a grand function, `find_shortest_path`, which shall accept two noble prime numbers as its champions: `start` and `end`. This function, upon completion, shall bestow upon thee a list of integers, revealing the sacred sequence of numbers thou shalt visit on thy journey. Be sure to include both the starting and ending numbers in thy blessed list.\n\n**Example:**\nAs an example, let us consider the enigma of the numbers `1033` and `8179`. The path to enlightenment shall unfold thusly: `[1033, 1733, 3733, 3739, 3779, 8779, 8179]`. Take heed, for **each number along the path is prime and changes but a single digit at a time.** Nay, worry not, for thou may assumeth that the numbers we provide shall forever be **four-digit prime numbers**. \n\n**Rules:**\n* A valid path is comprised of steps, where each step requireth the changing of a single digit in the current number. The digit may be transformed into any other digit betwixt 0 and 9, ye see?\n* But beware! The resulting number must also remain a four-digit prime number, for we seek only those graced by the divinities of numbers.\n* And remember, only one digit may be altered in each step, and let us forsake the vile leading zeros, for they are an abomination in our realm.\n\n*Now, go forth, noble programmer! May the spirits of the ancients guide thy code and lead thee to victory!*\n\n\nps. Thanks to all of the people who created suggestions, found issues in the code, and overall helped with the development of this kata",
  "totalAttempts": 295,
  "totalCompleted": 84,
  "totalStars": 15,
  "voteScore": 48,
  "tags": [
    "Graph Theory",
    "Number Theory",
    "Algorithms",
    "Data Structures",
    "Graphs"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}