{
  "id": "64b92cbc34d6f90e60fbc6b5",
  "name": " Days to Reach a Cumulative Transaction Threshold: part 2",
  "slug": "days-to-reach-a-cumulative-transaction-threshold-part-2",
  "category": "reference",
  "publishedAt": "2023-07-20T12:48:00.841Z",
  "approvedAt": "2023-09-20T18:39:40.561Z",
  "languages": [
    "sql"
  ],
  "url": "https://www.codewars.com/kata/64b92cbc34d6f90e60fbc6b5",
  "rank": {
    "id": -4,
    "name": "4 kyu",
    "color": "blue"
  },
  "createdAt": "2023-07-20T12:46:52.062Z",
  "createdBy": {
    "username": "bornForThis",
    "url": "https://www.codewars.com/users/bornForThis"
  },
  "approvedBy": {
    "username": "dfhwze",
    "url": "https://www.codewars.com/users/dfhwze"
  },
  "description": "You are a data analyst for a streaming service provider that operates on a tiered subscription model. Understanding user behavior to optimize this model is crucial. One specific area of interest is to monitor the spending pattern of users from the time they join the platform. This will help identify how long it typically takes for users to reach certain spending thresholds, and in turn, informs strategies for tier adjustments.\n\nThey are particularly interested in finding out how long it takes for customers from different countries to reach a certain transaction threshold. This information will help them understand market dynamics better and devise localized strategies.\n\nYou are given a transactions table with the following columns:\n\n* `id`(integer): the transaction's unique identifier\n* `user_id`(integer): the unique identifier of the user who made the transaction\n* `country`(string): the country from which the transaction was made\n* `date`(date): the date of the transaction\n* `amount`(integer): the amount of the transaction\n\nYour task is to write a SQL query that retrieves transactions for each user where the cumulative amount for that specific user from the first his/her transaction in the system to the row where, when arranged by transaction `id` in ascending order, reaches or exceeds a limit of 15\n\nWhile `id`, `date` and `amount` should be displayed for every row of result set, the query should only display the `user_id` and `country` in the last row of each user's data (with all other rows being NULL).\n\nIn addition to columns from `transactions` table, the result set should include a column `days_to_reach_threshold` which indicates the number of days it took for each user to reach the cumulative transaction amount of 15. In the same logic with `user_id` and `country`, this value should be displayed only in the last row for each user (where all other rows are NULL).\n\nFinally, the result set should also include a column `avg_country_days_to_reach_threshold` which shows the average of `days_to_reach_threshold` for all users from the same country. This value should be rounded to the nearest integer and also should be displayed only in the last row for each user (where all other rows are NULL).\n\nThe final result set should be ordered by user_id and id in ascending order. When user_id is NULL (i.e., not the last row of each user's data), these rows should be sorted to the end.\n\nGLHF!\n\n### Notes:\n\n* all users in the given dataset have exceeded this threshold of 15 in their total transaction amount.\n* it is guaranteed that the transactions are in chronological order for each user.\n* it is guaranteed that all transactions for each user are from the same country\n\n### Desired Output\n\nThe desired output should look like this:\n\n<table><!----><tr><th>id</th><th>user_id</th><th>country</th><th>date</th><th>amount</th><th>days_to_reach_threshold</th><th>avg_country_days_to_reach_threshold</th></tr><tr><td>1</td><td></td><td></td><td>2020-01-01</td><td>1</td><td></td><td></td></tr><tr><td>2</td><td></td><td></td><td>2020-03-01</td><td>2</td><td></td><td></td></tr><tr><td>3</td><td></td><td></td><td>2020-04-30</td><td>3</td><td></td><td></td></tr><tr><td>4</td><td></td><td></td><td>2020-06-29</td><td>4</td><td></td><td></td></tr><tr><td>5</td><td>1</td><td>Spain</td><td>2020-08-28</td><td>5</td><td>240</td><td>180</td></tr><tr><td>11</td><td></td><td></td><td>2020-01-31</td><td>7</td><td></td><td></td></tr><tr><td>12</td><td></td><td></td><td>2020-03-31</td><td>6</td><td></td><td></td></tr><tr><td>13</td><td>2</td><td>Spain</td><td>2020-05-30</td><td>5</td><td>120</td><td>180</td></tr></table>\n...",
  "totalAttempts": 817,
  "totalCompleted": 94,
  "totalStars": 5,
  "voteScore": 30,
  "tags": [
    "SQL",
    "Databases"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}