{
  "id": "64d6448bbd43570065737c36",
  "name": "Order Error Rate Over the Past Hour",
  "slug": "order-error-rate-over-the-past-hour",
  "category": "reference",
  "publishedAt": "2023-08-13T08:23:13.676Z",
  "approvedAt": "2023-09-20T18:34:27.952Z",
  "languages": [
    "sql"
  ],
  "url": "https://www.codewars.com/kata/64d6448bbd43570065737c36",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2023-08-11T14:24:11.465Z",
  "createdBy": {
    "username": "bornForThis",
    "url": "https://www.codewars.com/users/bornForThis"
  },
  "approvedBy": {
    "username": "dfhwze",
    "url": "https://www.codewars.com/users/dfhwze"
  },
  "description": "You work in an online retail company that uses two tables to track order processing and error handling. The first table, `order_processing`, keeps track of all the orders. The second table, `order_errors`, tracks any errors that occurred while processing these orders. Both tables have the same schema:\n\n* `id` (integer) - primary Key\n* `order_id` (integer) - The identifier of the order.\n* `order_time` (datetime) - Timestamp indicating when the order was processed/had an error.\n\nNow, the business wants to know the percentage of orders in the last hour that resulted in an error. They want to monitor this closely to ensure that the order processing system is working efficiently and to identify any potential issues.\n\nWrite a SQL query that calculates the percentage of orders that resulted in an error in the last hour.  \"last hour\" refers to the most recent 60-minute period leading up to the current time excluding the exact boundary of 1 hour. You will need to count the number of entries in both `order_processing` and `order_errors` that have an `order_time` within this period and use these counts to calculate the error percentage.\n\nThe result should be a single value representing the error percentage, with the alias `error_percentage`, of `numeric` datatype and it should be rounded to two decimal places.\n\nNotes: \n\n1) You must ensure that division by zero does not occur in the query. If the count from `order_processing` is zero, the result should be NULL\n\n2) The 1-hour interval is exclusive, meaning that records with an order_time exactly 1 hour before the current time should not be included in the counts.\n\nGLHF!",
  "totalAttempts": 1308,
  "totalCompleted": 140,
  "totalStars": 11,
  "voteScore": 34,
  "tags": [
    "SQL",
    "Databases"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 1
  }
}