{
  "id": "64fededdee2e8b02b1149642",
  "name": "Customer Rebates Based on Total Orders for September 2023",
  "slug": "customer-rebates-based-on-total-orders-for-september-2023",
  "category": "reference",
  "publishedAt": "2023-09-11T09:50:14.566Z",
  "approvedAt": "2023-10-28T18:01:52.852Z",
  "languages": [
    "sql"
  ],
  "url": "https://www.codewars.com/kata/64fededdee2e8b02b1149642",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2023-09-11T09:33:17.335Z",
  "createdBy": {
    "username": "bornForThis",
    "url": "https://www.codewars.com/users/bornForThis"
  },
  "approvedBy": {
    "username": "dfhwze",
    "url": "https://www.codewars.com/users/dfhwze"
  },
  "description": "You are provided with two PostgreSQL tables: `rebates` and `orders`. The `rebates` table contains information about the percentage of rebate given to customers based on their total purchase amount. The `orders` table stores data about customer orders, including the order amount and the date the order was placed.\n\n`rebates`: \n\n* `id` (integer) - Unique identifier for the rebate entry.\n* `rebate_percentage` (float) - The percentage of rebate that applies.\n* `min_purchase` (integer) - The minimum total purchase amount to qualify for the given rebate.\n\n`orders`:\n\n* `id` (integer) - Unique identifier for the order.\n* `customer_id` (integer) - Identifier for the customer who placed the order.\n* `order_amount` (integer) - The amount of the order.\n* `order_date` (date) - The date the order was placed.\n\nYour task is to write an SQL query that calculates the total amount of orders for each customer for September 2023 and determines the corresponding rebate percentage they are eligible for based on their total orders.\n\nObjectives:\n\n1) Calculate the sum of order amounts for each customer for orders placed in September 2023 (Assuming that the orders table contains various orders with order_date spanning different months and years, and order_amount varying between orders).\n2) Determine the appropriate rebate percentage for each customer based on the calculated total order amount.\n3) Exclude customers who do not have orders in September 2023 or whose total orders in September 2023 are below the lowest min_purchase in the rebates table.\n\nA result set should contain the following columns:\n\n1) `customer_id` (integer) - The ID of the customer.\n2) `total_orders` (integer) - The total sum of the orders made by the customer in September 2023.\n3) `rebate_percentage` (float) - The rebate percentage applicable to the customer based on their total orders in September 2023.\n\nand be sorted by `customer_id` in descending order.\n\nNotes:\n\n* The rebates table contains random but strictly increasing rebate_percentage and min_purchase values. There are no overlaps, meaning each customer is eligible for exactly one rebate based on their total purchase amount.\n\nGLHF!\n",
  "totalAttempts": 1120,
  "totalCompleted": 139,
  "totalStars": 12,
  "voteScore": 46,
  "tags": [
    "SQL",
    "Databases"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}