{
  "id": "650d7aa9fc2cd80018e3c210",
  "name": " Identifying Codewars' Bad Kata Authors",
  "slug": "identifying-codewars-bad-kata-authors",
  "category": "reference",
  "publishedAt": "2023-09-22T12:08:13.078Z",
  "approvedAt": "2023-09-23T20:32:45.713Z",
  "languages": [
    "sql"
  ],
  "url": "https://www.codewars.com/kata/650d7aa9fc2cd80018e3c210",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2023-09-22T11:29:45.185Z",
  "createdBy": {
    "username": "bornForThis",
    "url": "https://www.codewars.com/users/bornForThis"
  },
  "approvedBy": {
    "username": "dfhwze",
    "url": "https://www.codewars.com/users/dfhwze"
  },
  "description": "### Background Story\n\nCodewars has always been the go-to platform for coding enthusiasts to challenge themselves, share their solutions, and learn from one another. It was a haven for those who wanted to enhance their coding skills and engage in friendly competition.\n\nOver time, Codewars saw a surge of new users joining its platform. With more users came more content, and this was mostly seen as a positive trend. However, as the proverb goes, \"Not all that glitters is gold.\" With this influx of content, the platform started seeing a series of poorly designed katas that didn't meet the community's standards. These katas were quickly dubbed \"bad katas.\"\n\nA bad kata, by community definition, is one that has received at least three votes but holds an average score of less than 0.7. The voting system on Codewars is simple but effective: 1 for \"very satisfied,\" 0.5 for \"somewhat satisfied,\" and 0 for \"not satisfied.\"\n\nThe platform's leadership noticed that a small group of users was disproportionately responsible for creating these low-quality katas. They felt that simply retiring those katas is not enough and they need to implement a system that would help maintain the platform's quality standards. The decision was made: authors who had created five or more bad katas would have their kata creation privileges revoked.  The underlying principle is straightforward: \"If you cannot consistently create quality content, and yet wish to continue contributing, then you must invest in the platform through a premium 'Codewars Red.'\"\n\n###  Task Description:\n\nWe have 2 tables:\n\n`kata_authors`:\n\n1) `user_id` (integer) - Represents the unique identifier for a user.\n2) `kata_id` (integer) - Represents the unique identifier for a kata.\n\n`kata_votes`:\n\n1) `kata_id` (integer) - Represents the unique identifier for a kata. This is linked to the `kata_id` in the kata_authors table.\n2)  `vote` (float) - Represents the vote given to a kata. Can only be one of three values:\n    * 1: \"very satisfied\"\n    * 0.5: \"somewhat satisfied\"\n    * 0: \"not satisfied\"\n    \n    \nYour task is to create a SQL query to identify bad kata authors.\n\nA bad kata is defined as one which:\n\n1) Has received at least three votes.\n2) Has an average vote of strictly less than 0.7.\n\nWe want to identify authors who have created 5 or more bad katas. \n\nThe output should List user IDs (`user_id`) and the count of their bad katas (`bad_kata_count`). And be ordered first by the count of bad katas in descending order. In case of a tie -  by user ID in descending order.\n\nGLHF!\n\n\n### Desired Output\n\nThe desired output should look like this:\n\n<table><!----><tr><th>user_id</th><th>bad_kata_count</th></tr><tr><td>34</td><td>6</td></tr><tr><td>23</td><td>5</td></tr></table>\n...\n\n\n\n\n\n\n\n\n\n",
  "totalAttempts": 2804,
  "totalCompleted": 279,
  "totalStars": 13,
  "voteScore": 73,
  "tags": [
    "SQL",
    "Databases"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}