{
  "id": "65717e92f926c7554819fb80",
  "name": "Unmasking the Narcissists of Codewars",
  "slug": "unmasking-the-narcissists-of-codewars",
  "category": "reference",
  "publishedAt": "2023-12-07T08:15:46.541Z",
  "approvedAt": "2023-12-16T12:24:25.688Z",
  "languages": [
    "sql"
  ],
  "url": "https://www.codewars.com/kata/65717e92f926c7554819fb80",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2023-12-07T08:13:06.776Z",
  "createdBy": {
    "username": "bornForThis",
    "url": "https://www.codewars.com/users/bornForThis"
  },
  "approvedBy": {
    "username": "dfhwze",
    "url": "https://www.codewars.com/users/dfhwze"
  },
  "description": "###  Background Story:\n\nCodewars, a renowned coding challenge platform, has recently faced a peculiar dilemma. The management team noticed a growing number of complaints from the community regarding certain users — referred to as \"narcissistic coders.\" These individuals have a tendency to consistently vote for their own solutions, skewing the visibility and credibility of solutions on the platform. This self-promotion tactic not only obscured genuinely brilliant solutions from top developers but also began to affect the overall user experience and learning environment on Codewars.\n\nDetermined to uphold the integrity of the platform and its community, the management decided to implement a two-pronged strategy:\n\n1) Enhanced User Experience - \"Omit Self-Voters\" Feature:\n    * To directly address community concerns, Codewars introduced a new feature in the solution section of each Kata (coding challenge).\n    * This feature is a checkbox labeled \"Omit Self-Voters.\" When checked, it filters out solutions from users who self-voted their solution, regardless of the number of votes their solution has received.\n    * This gives users the option to focus on solutions that have garnered genuine community approval, promoting a more authentic and merit-based recognition of coding skills.\n    \n2) Identifying and Labeling Narcissistic Coders:\n    * To further discourage the practice of self-voting and promote transparency, Codewars embarked on an initiative to identify narcissistic coders using data analytics.\n    * The criteria for labeling a user as a narcissist are specific: they must have solved at least 30 katas, with self-votes on at least 25% of their solutions.\n    * Once identified, these users receive a distinct badge on their profile, subtly indicating their penchant for self-voting. This badge serves as a gentle nudge towards healthier community engagement and discourages the practice of self-promotion.\n \nThis strategic approach aims to foster a more constructive and collaborative environment on Codewars. By empowering users to filter out self-voted solutions and openly identifying those who engage in this practice, Codewars hopes to encourage a culture of genuine skill showcase and mutual support, ensuring that the spotlight shines brightest on truly deserving solutions and their creators.\n\n###  Task Description:\n\nWrite a PostgreSQL query to identify narcissistic coders based on specific criteria for the implementation of the Narcissist Badge feature.\n\nKey Definitions:\n\n* Kata: A coding challenge on the Codewars platform.\n* Solution: A user's submission for a kata. Note that users can submit multiple solutions for the same kata.\n* The focus is on the number of distinct katas a user has successfully solved, not just the total number of attempts or submissions.\n\nCriteria for Narcissistic Coders:\n\n1) Users who have successfully solved at least 30 distinct katas.\n2) Users for whom the percentage of distinct katas with at least one self-vote is at least 25% of all the distinct katas they have solved.\n\nDatabase Schema:\n\n`users`:\n\n* `user_id` (primary key, integer): Unique identifier for each user.\n* `username` (string): Username of the user.\n\n`solutions`: \n\n* `solution_id` (primary key, integer): Unique identifier for each solution.\n* `user_id` (foreign key, integer): Identifier linking the solution to a user.\n* `kata_id` (integer): Identifier of the Kata for which the solution is provided.\n\n`votes`: \n\n* `vote_id` (primary key, integer): Unique identifier for each vote.\n* `solution_id` (foreign key, integer): Identifier linking the vote to a specific solution.\n* `voter_user_id` (integer): Identifier of the user who cast the vote.\n\nDevelop a PostgreSQL query that selects users meeting the narcissistic coder criteria, displaying their:\n\n1) `user_id`,\n2) `username`, \n3) The percentage of distinct katas in which they have self-voted their solutions, calculated as: (Number of distinct katas with at least one self-vote by the user / Total number of distinct katas solved by the user) * 100 (`self_vote_percentage`), rounded to two decimal places.\n\nThe results should be sorted by `user_id` in descending order.\n\nGLHF!\n\n",
  "totalAttempts": 738,
  "totalCompleted": 87,
  "totalStars": 8,
  "voteScore": 45,
  "tags": [
    "SQL",
    "Databases"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}