{
  "id": "65a024af6063fb0ac8c0f0b5",
  "name": "Three-cushion billiards",
  "slug": "three-cushion-billiards",
  "category": "reference",
  "publishedAt": "2024-01-11T18:42:15.359Z",
  "approvedAt": "2024-01-19T10:12:34.275Z",
  "languages": [
    "javascript",
    "python",
    "sql",
    "coffeescript"
  ],
  "url": "https://www.codewars.com/kata/65a024af6063fb0ac8c0f0b5",
  "rank": {
    "id": -7,
    "name": "7 kyu",
    "color": "white"
  },
  "createdAt": "2024-01-11T17:26:07.218Z",
  "createdBy": {
    "username": "dfhwze",
    "url": "https://www.codewars.com/users/dfhwze"
  },
  "approvedBy": {
    "username": "Kees de Vreugd",
    "url": "https://www.codewars.com/users/Kees%20de%20Vreugd"
  },
  "description": "## Description\n\n Three-cushion billiards, also called three-cushion carom, is a form of carom billiards. The object of the game is to carom the cue ball off both object balls while contacting the rail cushions at least three times before contacting the second object ball.\n- The table consists of 4 cushions (north, east, south and west)\n- There are 3 balls (white, yellow, red)\n- The cue ball is the ball that the player starts with (white and yellow are allowed to be picked)\n- The object balls are the 2 remaining balls that the player did not pick to start with (red is always one of these balls)\n- <a href=\"https://en.wikipedia.org/wiki/Three-cushion_billiards\">wiki link</a>\n\n#### The billiards table\n```\n           n\n   +----------------+\n   |                |\n   |                |\n   |        R       |\n   |                |\n w |                | e\n   |                |\n   |                |\n   |                |\n   |      W Y       |\n   |                |\n   +----------------+\n            s\n```\n\n---\n\n## Task\n\nGiven an encoded string representing the collisions of the cue ball with object balls and cushions, return a boolean indicating whether a point was scored. You may assert the player hits a valid cue ball (white or yellow).\n\n#### Input\n\nThe input consists of a combination of zero, one or more occurences of the following chars:\n- <code>'w', 'e', 'n', 's'</code> - west, east, north and south cushion\n- <code>'W', 'Y', 'R'</code> - white, yellow and red ball\n\n#### Output\n- return a boolean indicating whether a point is scored\n\n#### Conditions to score a point\n- The cue ball must have made contact with the cushions at least three times before contacting the second object ball for the first time. \n- Both object balls must be hit at least once.\n\n#### Additional info\n- The cue ball may contact the cushions before or after hitting the first object ball.\n- The cue ball does not have to contact three different cushions as long as it has been in contact with any cushion at least three times in total. \n- Using a specific technique (a massé shot), it is possible to hit the same cushion multiple times in succession, curving the cue ball.\n- It is allowed that both object balls collide a number of times, this is not encoded in the input and can be ignored altogether\n\n----\n\n### Examples\n\n#### Scoring a point\n\n```\ninput       description\n------------------------------------------------------------------------------\n\"YnesR\"     white ball is cue ball, first hits yellow ball, \n            then 3 cushions, finally red ball\n \n\"RnesY\"     white ball is cue ball, first hits red ball, \n            then 3 cushions, finally yellow ball\n \n\"WnesR\"     yellow ball is cue ball, first hits white ball, \n            then 3 cushions, finally red ball\n \n\"wWnsR\"     yellow ball is cue ball, first hits a cushion,\n            then white ball, 2 more cushions, finally red ball\n \n\"wnWsR\"     yellow ball is cue ball, first hits 2 cushions,\n            then white ball, 1 more cushion, finally red ball\n \n\"wnsWR\"     yellow ball is cue ball, first hits 3 cushions,\n            then white ball, finally red ball\n \n\"YneswR\"    white ball is cue ball, first hits yellow ball, \n            then 4 cushions, finally red ball\n \n\"YnesRs\"    white ball is cue ball, first hits yellow ball, \n            then 3 cushions, then red ball, finally another cushion\n \n\"YnesYR\"    white ball is cue ball, first hits yellow ball, \n            then 3 cushions, then yellow ball again, finally red ball\n \n\"wnwYR\"     white ball is cue ball, first hits 3 cushions (one cushion twice),\n            then white ball, finally red ball\n \n\"wwwYR\"     white ball is cue ball, first hits 3 cushions (one cushion trice),\n            then white ball, finally red ball\n \n```\n\n#### No score\n\n```\ninput       description\n------------------------------------------------------------------------------\n\"YneRw\"     there are only 2 cushions hit before hitting the second object \n            ball (red)\n \n\"wYnwY\"     the yellow ball is hit twice, but the red ball was not hit\n \n\"neR\"       only the red ball was hit, no other object ball\n \n\"\"          a total miscue, causing no collisions after hitting the cue ball\n\n\"YRnnenRY\"  more than 3 cushions were hit, but not before hitting the\n            second object ball for the first time (red)\n \n\"eRWewsnW\"  more than 3 cushions were hit, but not before hitting the\n            second object ball for the first time (white)\n```\n---\nGood luck, have fun",
  "totalAttempts": 1116,
  "totalCompleted": 210,
  "totalStars": 18,
  "voteScore": 89,
  "tags": [
    "Fundamentals",
    "Games"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}