{
  "id": "65a9ea2f107aa74241b1c645",
  "name": "My To-Do List ",
  "slug": "my-to-do-list",
  "category": "reference",
  "publishedAt": "2024-01-19T03:22:09.998Z",
  "approvedAt": null,
  "languages": [
    "javascript"
  ],
  "url": "https://www.codewars.com/kata/65a9ea2f107aa74241b1c645",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2024-01-19T03:19:11.354Z",
  "createdBy": {
    "username": "Ramy-hakeem",
    "url": "https://www.codewars.com/users/Ramy-hakeem"
  },
  "description": "To-Do List Implementation\nYour goal is to create a To-Do List class that enables basic task management. The class should provide the following functionalities:\n\n1. Adding a Task\nImplement the add_task(task: str) method that adds a new task to the To-Do List. Tasks are represented by alphanumeric strings, and they may contain spaces. Ensure that the class is case-sensitive when handling task names.\n\n2. Marking a Task as Done\nCreate the mark_done(task: str) method to mark a specific task as done. This operation involves removing the task from the active list. If the provided task is not found in the list, the method should throw an error indicating that the task was not found.\n\n3. Retrieving Remaining Tasks\nImplement the get_tasks() -> List[str] method to retrieve a list of remaining tasks in the order they were added. The list should include tasks that have not been marked as done.\n\nConstraints\nTask names are alphanumeric and may contain spaces.\nTask names are case-sensitive.\n\nnote\nYour implementation should handle various scenarios, including adding tasks, marking tasks as done (with potential errors), and retrieving the list of remaining tasks. Ensure the class functions correctly in a case-sensitive manner and accommodates alphanumeric task names with spaces.",
  "totalAttempts": 42,
  "totalCompleted": 4,
  "totalStars": 0,
  "voteScore": -1,
  "tags": [
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 2,
    "suggestions": 0
  }
}