{
  "id": "65cb42c2e2b49c4a063c39a1",
  "name": "Customers with Urgently Expiring Certificates",
  "slug": "customers-with-urgently-expiring-certificates",
  "category": "reference",
  "publishedAt": "2024-02-14T10:48:40.471Z",
  "approvedAt": "2024-02-19T05:44:45.776Z",
  "languages": [
    "sql"
  ],
  "url": "https://www.codewars.com/kata/65cb42c2e2b49c4a063c39a1",
  "rank": {
    "id": -6,
    "name": "6 kyu",
    "color": "yellow"
  },
  "createdAt": "2024-02-13T10:21:54.536Z",
  "createdBy": {
    "username": "bornForThis",
    "url": "https://www.codewars.com/users/bornForThis"
  },
  "approvedBy": {
    "username": "dfhwze",
    "url": "https://www.codewars.com/users/dfhwze"
  },
  "description": "You are working with a database for a company that manages certifications for its customers. The company needs to identify customers who have certificates expiring within the next 14 days and do not have any other certificates that expire later. This information is crucial for sending timely reminders to customers for renewals.\n\nWe have `customers` table:\n\n* `id` (int): primary key.\n* `ssn` (string): The social security number of the customer. Serves as a unique identifier.\n* `name` (string): The name of the customer.\n\nand `certs` table:\n\n* `id` (int): primary key.\n* `cert_num` (string): The unique number of the certificate.\n* `ssn` (string): The social security number of the customer to whom the certificate belongs. This is a foreign key referencing the Customers table.\n* `cert_start` (date): The start date of the certificate's validity.\n* `cert_finish` (date): The expiration date of the certificate.\n\nConstruct an SQL query that selects the appropriate data from these tables. The query should:\n\n1) Identify certificates that are expiring within the next 14 days from the `current_date`.\n2) For each customer, the query should include every certificate that is expiring within the next 14 days. This means a single customer might have multiple certificates listed in the results if all of them are expiring within the 14-day window.\n3) Exclude customers who have any other certificates with expiration dates beyond this 14-day window.\n4) Order the results by the customer's name then by customer's SSN, and finally by certificate number - all in ascending order.\n\nExpected Result Columns:\n\n1) `name`: The name of the customer.\n2) `ssn`: The social security number of the customer.\n3) `cert_num`: The number of the certificate.\n4) `cert_start`: The start date of the certificate's validity.\n5) `cert_finish`: The expiration date of the certificate.\n\nGLHF!",
  "totalAttempts": 850,
  "totalCompleted": 171,
  "totalStars": 7,
  "voteScore": 37,
  "tags": [
    "SQL",
    "Databases"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}