{
  "id": "660595d3bd866805d00ec4af",
  "name": "Longest Mountain Pass",
  "slug": "longest-mountain-pass",
  "category": "algorithms",
  "publishedAt": "2024-03-28T18:03:55.786Z",
  "approvedAt": "2024-03-30T21:07:50.567Z",
  "languages": [
    "python",
    "javascript",
    "cpp",
    "rust",
    "java",
    "julia"
  ],
  "url": "https://www.codewars.com/kata/660595d3bd866805d00ec4af",
  "rank": {
    "id": -5,
    "name": "5 kyu",
    "color": "yellow"
  },
  "createdAt": "2024-03-28T16:07:47.125Z",
  "createdBy": {
    "username": "mozkomor05",
    "url": "https://www.codewars.com/users/mozkomor05"
  },
  "approvedBy": {
    "username": "JohanWiltink",
    "url": "https://www.codewars.com/users/JohanWiltink"
  },
  "description": "You are an adventurous hiker planning to traverse a mountain range. The mountain range is represented by an array of integers, where each element corresponds to the height of a mountain at that position. Your goal is to find the longest mountain pass you can take based on your initial energy level.\n\n## Problem Description\n\n- You are given an array of mountains, where each element represents the height of the mountain.\n- A mountain pass is defined as a subarray of the mountain array. The length of a mountain pass is the length of the subarray.\n- You have an initial energy level `E`.\n- You start at any initial index of your choice.\n- Going up a mountain (i.e., moving from a lower height to a higher height) costs you energy equal to the difference in heights.\n- Going down a mountain or staying at the same height does not cost you any energy.\n- You can only move to the mountains on your right (i.e., the next index).\n\nYour task is to find the longest mountain pass you can take based on your initial energy level. Return the length of the longest mountain pass and the initial index from where you should start.\n\n\n## Input\n\n- `mountains`: An array of integers representing the heights of the mountains.\n- `E`: An integer representing your initial energy level.\n\n**Note:** The length of the mountain array can be very large, up to `10^7`.\n\n\n## Output\n\nReturn a tuple `(max_length, start_index)`, where:\n- `max_length`: The length of the longest mountain pass you can take.\n- `start_index`: The initial index from where you should start the mountain pass.\n\nIf there are multiple mountain passes with the same length, return the one with the smallest initial index.\n",
  "totalAttempts": 2254,
  "totalCompleted": 164,
  "totalStars": 42,
  "voteScore": 61,
  "tags": [
    "Algorithms",
    "Arrays"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}