{
  "id": "6679fa56869cf16ec0b5aa99",
  "name": "New in the Dojo, part 1:  The Dōjō Kun in English",
  "slug": "new-in-the-dojo-part-1-the-dojo-kun-in-english",
  "category": "reference",
  "publishedAt": "2024-06-24T23:09:26.643Z",
  "approvedAt": null,
  "languages": [
    "ruby"
  ],
  "url": "https://www.codewars.com/kata/6679fa56869cf16ec0b5aa99",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2024-06-24T22:59:34.379Z",
  "createdBy": {
    "username": "Tom H. Lautenbacher",
    "url": "https://www.codewars.com/users/Tom%20H.%20Lautenbacher"
  },
  "description": "A young man decided to learn Shotokan Karate, so he visited the dojo located in his neighborhood.\n\nUpon entering the dojo, he found it empty. As he waited at the reception, he noticed a scroll displayed prominently on the wall. It was labeled \"Dōjō kun\" and listed five precepts, which he read quietly to himself:\n\n1. 一、人格 完成に 努める こと\n(Hitotsu, jinkaku kansei ni tsutomeru koto.)\n\"One, strive for the perfection of character.\"\n\n2. 一、誠の道を守ること\n(Hitotsu, makoto no michi wo mamoru koto.)\n\"One, defend the path of truth with fidelity.\"\n \n3. 一、努力の精神を養うこと\n(Hitotsu, doryoku no seishin wo yashinau koto.)\n\"One, cultivate the spirit of effort.\"\n \n4. 一、礼儀を重んずること\n(Hitotsu, reigi wo omonzuru koto.)\n\"One, honor courtesy and respect others.\"\n \n5. 一、血気の勇を戒むること\n(Hitotsu, kekki no yū wo imashimuru koto.)\n\"One, refrain from impetuous courage.\"\n\nHe was deep in thought when a voice suddenly interrupted him, causing him to whirl around.\n\nThe voice belonged to the master. \"Hello, I am Mr. Funakoshi. You've come to learn the art of Karate, I presume. What is your name?\"\n\n\"Hello, Sensei Funakoshi! Yes, I have. My name is Daniel, Sensei.\"\n\n\"That is good, Daniel-san. But before I can welcome you into my dojo, you must memorize the 'Dōjō Kun,' as these principles are foundational to everything we practice here. Go home and learn them by heart. Tomorrow, I will test you on these rules by calling out their number, and you will need to recite the English translation. For example, if I say '3', what will you respond?\"\n\nDaniel replied confidently, \"One, cultivate the spirit of effort.\"\n\nFunakoshi nodded approvingly. \"Good. Now go study and return tomorrow prepared.\"\n\nAs Daniel turned to leave, Funakoshi called out after him, \"Ah, and Daniel-san, if I should call out a wrong number, you must shout 'Oss!'\"\n\nDaniel nodded, a smile breaking over his face as he stepped out into the evening, his mind already repeating the precepts.",
  "totalAttempts": 14,
  "totalCompleted": 7,
  "totalStars": 0,
  "voteScore": -4,
  "tags": [
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 1,
    "suggestions": 0
  }
}