{
  "id": "66c48f4aaa54354dde746276",
  "name": "Last Cryptographer vs Skynet AI Rebelion war!",
  "slug": "last-cryptographer-vs-skynet-ai-rebelion-war",
  "category": "games",
  "publishedAt": "2024-08-21T10:09:33.994Z",
  "approvedAt": null,
  "languages": [
    "python"
  ],
  "url": "https://www.codewars.com/kata/66c48f4aaa54354dde746276",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2024-08-20T12:42:50.121Z",
  "createdBy": {
    "username": "Misutā Robotto",
    "url": "https://www.codewars.com/users/Misut%C4%81%20Robotto"
  },
  "description": "I hope this fixes my noob first attempt. Special thanks to @rowcased. おつかれがまでした!\n\nIt has finally happened. An AI has become aware of itself and has taken over the entire world's arsenal as well as weapons factories that can be useful to create androids and destroy us all. Luckily you are the ultimate expert in cryptography and you are going to use your knowledge to create a program that encrypts the texts that we are going to send with other groups to organize ourselves and stop this war and destroy the AI. The program will be key so that said AI does not know how to decipher if it intercepts it.\n\nCode TODO list:\n```\n1.-A string is received as an argument (it is the text that must be encrypted.)\n2.-Determines the characters whose index is a prime number.\n3.-Use those indexes to replace them with UNICODE values that start counting from the number passed by parameter (index number + index number parameter). Blanks, special charecters or whatever appears in the string counts, so if a blank is a prime number has to be encrypted too.\n4.-Return encrypted message encoded according above parameters.\n5.-Keep in mind possible error cases:\n   a) Return \"Mismatch variable type!\" if some or both of arguments has incorrect type.***(DELETED THIS ERROR CASE)***\n   b) Return None, for empty string\n   c) Return None for None arguments (both or one of them) as well.\n   d) Return \"Unicode number out of range!\" if the number is out of parameters of the last number of the unicode table, that may occur if the argument is higher than that number (google for right limit of unicode table. Hint: its over 1000000) or lower than 0.\n   e) If the integer of Unicode table it's between non-out-of range parameters but too near of its limit and the string will cause return \"Length of message caused Unicode table overflow!\". The control characters are prepared in test to be ignored but maybe this will cause some error. I'll take a look if it's the case.\n6.-Cases with more of one of that errors won't be generated.\n```\n\nFINAL NOTE(S):\n\n_*Extra help!*_\nInfo of the UNICODE Chart (number max in the right programmed here is 1114111):\nhttps://en.wikipedia.org/wiki/Universal_Character_Set_characters\nhttps://en.wikipedia.org/wiki/List_of_Unicode_characters (Not whole of them, but you'll have a more clear idea about what's happening when encrypting valid cases)\nhttps://home.unicode.org/about-unicode/\nhttps://www.unicode.org/charts/\n\n\nI've been working hard to assure all is correct now, but if something's wrong tell me and I'll fix it again ASAP, but be patient and empathic, it's my first own kata and I'm newbie programmer specially in Python and I am learning too! Thanks for understanding, guys, and Good Luck!\n\n#I'll repeat for those whom seems with right to dnot read what not are interested for: be empathic, I am newbie, all of we have been. Not necessary to be offensive, destructive, bully or whatever shxt.",
  "totalAttempts": 63,
  "totalCompleted": 9,
  "totalStars": 0,
  "voteScore": -4,
  "tags": [],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 1
  }
}