{
  "id": "554b18a65b08c1851300013e",
  "name": "Simple Blackjack",
  "slug": "simple-blackjack",
  "category": "reference",
  "publishedAt": "2015-05-21T18:06:20.963Z",
  "approvedAt": null,
  "languages": [
    "javascript"
  ],
  "url": "https://www.codewars.com/kata/554b18a65b08c1851300013e",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2015-05-07T07:47:50.682Z",
  "createdBy": {
    "username": "NiklasE",
    "url": "https://www.codewars.com/users/NiklasE"
  },
  "description": "As a man walked into the saloon, he saw a table for Blackjack. As he settled, disappointment was creeping to his face as he shouted WHERE IS THE GAME? The bartender was shaken by this, because he knew how mad this well-known troublemaker would get.\n\nSomeone must help him. YOU must help him!\n\nCreate a simple Blackjack game for this troublemaker so he can play a single game of Blackjack. (You know, just to quench his thirst for a card game)\n\nThe bartender gives you a soiled piece of paper, which reads as follows:\n\nHouse rules of Blackjack\n------------------------\n* At the beginning of the game the player receives two cards and after that the dealer receives two cards. The player's cards are dealt face up, while the dealer has one face down and one face up (you should deal one card to the dealer's hand and keep one elsewhere)\n* Dealer has to take cards until the sum of the cards is seventeen or more\n* Face cards are counted as ten points (kings, queens and jacks)\n* Ace is worth eleven points if it does not cause player/dealer to bust. Otherwise it should be counted as one point. (note: for simplicity the value should be decided when the ace is dealt)\n* Player wins if he or she does not bust and have a total that is higher than the dealer's\n* Best lu~~~~*the soiled paper is torn from the bottom*\n\nBasics of Blackjack\n-----\n* Scoring higher than 21 results in a loss (busting / going bust).\n* Higher score (sum of hand) wins\n* After dealing the initial cards it is player's turn. When the player has finished drawing cards, it is dealer's turn to draw cards (if the player did not bust). *Remember to add the face down card too (dealt in the beginning of the game).*\n\nNotes\n-----\n* There is a deck function which returns you an array of **numbers**. (Usage: new deck())\n  * 1 is the A, and  11, 12, 13 are J, Q, K.\n* playGame function has a parameter (number) which should be used to determine whether the player should take another card or not. E.g. if the sum of player's hand is 17 and the given parameter is 17, you shouldn't deal another card.\n* [Basic knowledge about Blackjack](http://en.wikipedia.org/wiki/Blackjack)\n",
  "totalAttempts": 378,
  "totalCompleted": 15,
  "totalStars": 5,
  "voteScore": 8,
  "tags": [
    "Games",
    "Fundamentals"
  ],
  "contributorsWanted": false,
  "unresolved": {
    "issues": 4,
    "suggestions": 1
  }
}