{
  "id": "593da1ddacdf048c93000023",
  "name": "Paragraph Setting: Align Left",
  "slug": "paragraph-setting-align-left",
  "category": "algorithms",
  "publishedAt": "2017-06-11T23:06:30.225Z",
  "approvedAt": "2020-11-01T01:36:43.182Z",
  "languages": [
    "javascript",
    "python"
  ],
  "url": "https://www.codewars.com/kata/593da1ddacdf048c93000023",
  "rank": {
    "id": -4,
    "name": "4 kyu",
    "color": "blue"
  },
  "createdAt": "2017-06-11T20:02:37.708Z",
  "createdBy": {
    "username": "discotechne",
    "url": "https://www.codewars.com/users/discotechne"
  },
  "approvedBy": {
    "username": "JohanWiltink",
    "url": "https://www.codewars.com/users/JohanWiltink"
  },
  "description": "Write a code that takes some text (argument 1) and processes it into a paragraph one line at a time. The lines should break as near as possible to the maximum line length (argument 2), breaking words if needed and inserting a hyphen to indicate where a word has been broken. \n\nFollow these rules:\n- Spaces and punctuation, including inserted hyphens, should be included in line length.  \n- There should be no spaces at the start or end of a line. Any such spaces should be removed and so not included in line length.  \n- Any punctuation adjoining the start or end of a word should not be detached from the word by a line break.  \n- Any added hyphens must be at least two alphanumeric characters from both the start and the end of the word being broken (or from the nearest hyphen, for words that are already hyphenated). If this is not possible, the line should instead be broken either  \n  0. at the previous white space, or  \n  0. if the word is already hyphenated and the hyphen lies before the maximum line length, after that hyphen (but not before such hyphens).\n\n\nFor the purpose of this exercise, it can be assumed that:\n\n- the maximum line length will never be less than 15 characters;  \n- any input text will be standard prose throughout, and will not contain any accented characters ( e.g. `é` );  \n- any input text will use spaced en-dashes for parenthesis, rather than non-spaced em-dashes (see http://www.dashhyphen.com/en-dash/);  \n- there will be no long stretches of non-alphanumeric characters in the input text (although quotation marks, including for nested quotations, should be accounted for), and no multiple spaces; `\"` and \"'\" serve as quotation marks. \n- underscores are included in alphanumeric characters.",
  "totalAttempts": 1662,
  "totalCompleted": 99,
  "totalStars": 19,
  "voteScore": 22,
  "tags": [
    "Algorithms"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 1,
    "suggestions": 2
  }
}