{
  "id": "611c51c08e730e00328a42f1",
  "name": "Shady merchant !",
  "slug": "shady-merchant",
  "category": "reference",
  "publishedAt": "2021-08-18T00:18:39.628Z",
  "approvedAt": null,
  "languages": [
    "javascript"
  ],
  "url": "https://www.codewars.com/kata/611c51c08e730e00328a42f1",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2021-08-18T00:18:09.074Z",
  "createdBy": {
    "username": "Otiston",
    "url": "https://www.codewars.com/users/Otiston"
  },
  "description": "[ENGLISH]\nToto is trying to win some money by selling some marble, but when Toto gets to the merchant he offers only two choice :\n- either buy one marble for the actual value \n- either buy all the marble for 1$ each\n\nHelp Toto, make the right choice to win as much money as possible per marble bag. \nEach bag is an array composed of the value of each marble.\nIf it's better for Toto to sell only the most expensive marble the function should return \"vendre une bille\"\nIF it's better for Toto to sell all the bag for 1$ each then the function should return \"tout vendre\"\nIf there is no difference between selling all the marble and selling only the most expensive one then Toto will prefer to sell only one marble therefor the function should return \"vendre une bille\"\n\nAs an exemple if toto get a bag of marble with the value [1,4,3,2,1,4,3] he can get 4$ by selling the most expensive one, and 7$ by selling all of them for 1$ each, therefor the function should return \"tout vendre\"\nand so [1,3,2,12,4] should return \"vendre une bille\" and [1,1,4,3] gets Toto as much by selling all of them or just the most expensive one so the function should return \"vendre une bille\"\n\n\n\n[FRANCAIS]\nToto essaye de gagner un peu d'argent en revendant ses billes, cependant quand il arrive chez le marchant ce dernier lui propose alors deux choix :\n- soit il lui achete une seul bille pour la valeur réel de la bille\n- soit il lui achete toutes ses billes pour 1€ chaqu'une\n\nAide Toto a gagner le plus d'argent possible, pour chaque sac de bille vous disposez d'un array composer de la valeur de chaqu'une des billes.\nSi Toto doit tout vendre alors vous retourner la phrase \"tout vendre\", si c'est plus rentable pour lui de vendre une seul bille alors vous retourner la phrase \"vendre une bille\"\n\nexemple :\nToto a un sac de bille qui ont pour valeur [1,4,3,2,1,4,3] s'il vend une seule bille alors il gagnera au maximum 4€ si jamais il vend toutes les billes pour 1€ chaqu'une alors il gagnera 7€ il doit donc \"tout vendre\"\n\nexemple 2:\nToto a un sac de bille qui ont pour valeur [1,1,4,3] s'il vend une seule bille alors il gagnera au maximum 4€ et s'il vend toutes les billes pour 1€ chaqu'une il gagnera aussi 4€ dans ce cas Toto prefere ne se séparer que d'une seul bille il doit donc \"vendre une bille\"\n\nexemple 3:\nToto a un sac de bille qui ont pour valeur [1,3,2,12,4] s'il vend une seule alors il gagnera au maximum 12€ et s'il vend toutes les billes pour 1€ chaqu'une il gagnera 5€ il doit donc \"Vendre une bille\"\n\nPour cette exercice, le prix des billes est toujours un entier > 0 et le sac de bille n'est jamais vide.",
  "totalAttempts": 30,
  "totalCompleted": 16,
  "totalStars": 0,
  "voteScore": -3,
  "tags": [
    "Fundamentals"
  ],
  "contributorsWanted": false,
  "unresolved": {
    "issues": 2,
    "suggestions": 0
  }
}