{
  "id": "626196b822d52c00165e64af",
  "name": "Go rank (EGF)",
  "slug": "go-rank-egf",
  "category": "reference",
  "publishedAt": "2022-04-21T18:01:21.847Z",
  "approvedAt": null,
  "languages": [
    "python"
  ],
  "url": "https://www.codewars.com/kata/626196b822d52c00165e64af",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2022-04-21T17:39:04.800Z",
  "createdBy": {
    "username": "nutpen",
    "url": "https://www.codewars.com/users/nutpen"
  },
  "description": "In the game of Go players have a rank like here in Codewars. There are kyu levels going up to 1 kyu and then dan levels starting at 1 dan going up to 9 dan (or 7 dan). In order to track a person's go rank, the European Go Federation (EGF) has implemented an ELO-like system, where each rank corresponds to a rating. (see also https://www.europeangodatabase.eu/EGD/EGF_rating_system.php)\n\nThey set a level of 20 kyu at a rating of 100. A rank difference of 1 is equal to a rating difference of 100. So, 19 kyu equals 200, 18 kyu equals 300, ... 1 kyu equals 2000, 1 dan equals 2100, ...\n\nNegative ratings exist down to a value of -900, where they are capped. (The rating is capped, the rank does not need a capping.)\n\nIf your rating is somewhere in-between, you round it towards the nearest multiple of 100 to find out your rank, e.g. a rating of 270 equals a rank of 18 kyu. A rating ending exactly on 50 will always be rounded up, e.g. a rating of 2050 equals a rank of 1 dan.\n\nYour task is to write a function which converts the rating of a player to a rank. Inputs will always be a number (negative and floating point possible). The return value should be a string representing the rank in the format number+rank type shortened, e.g. 3 kyu = \"3k\". See test cases for more examples.\n\nHappy coding.",
  "totalAttempts": 172,
  "totalCompleted": 18,
  "totalStars": 0,
  "voteScore": -3,
  "tags": [
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 2,
    "suggestions": 0
  }
}