{
  "id": "6390e9260c8dbb89e8d0734c",
  "name": "Rational Root Theorem",
  "slug": "rational-root-theorem",
  "category": "algorithms",
  "publishedAt": "2022-12-07T19:33:07.570Z",
  "approvedAt": null,
  "languages": [
    "python"
  ],
  "url": "https://www.codewars.com/kata/6390e9260c8dbb89e8d0734c",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2022-12-07T19:27:34.861Z",
  "createdBy": {
    "username": "ThatOneGuyWhoCodes",
    "url": "https://www.codewars.com/users/ThatOneGuyWhoCodes"
  },
  "description": "The Rational Root Theorem, also known as Rational Root Test, is used in algebra to find all rational roots of a single variable polynomial equation in standard form.\n\nOften writen as P/Q, you take the factors of the constant and divide them by the factors of the leading coefficient. After that you run all the quotients through the equation, and whenever you get 0 as your answer, the quotient used is a root of the equation.\n\nA factoring function has already been created for you.\n```factor(num)```\n\nYour job is to create an function that when given the coefficients of the equation, split by spaces with 0s marked where there is an absense of x^nth, can return an list consisting of\n\n  1) list of rational roots,\n  2) Could there be any irrational roots?(boolean),\n  3) Are there multiple of a found root?(boolean)\n\nWays to identify the 2nd and 3rd indexes are\n\n2nd index:\n\n  1) If an equation has one root consisting of square root, but there are no square roots visible in the eqution, it will have a root of the positive and negative value of the root.\n  2) If an equation has one complex root, but there are no i's in the equation, it will have another complex root of the opposite sign\n  \n3rd index:\n\n  1) If the amout of roots you get is and odd number less than the degree of the equation, due to the previous rules you cannot have a irrational root, meaning that you have multiple of a root\n  \nExtra Rules:\n  1) Do not use NumPy\n  \nIf you are still confused about the rational root theorem, please check here\nhttps://www.britannica.com/science/rational-root-theorem",
  "totalAttempts": 73,
  "totalCompleted": 13,
  "totalStars": 1,
  "voteScore": 0,
  "tags": [
    "Algebra",
    "Algorithms"
  ],
  "contributorsWanted": false,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}