{
  "id": "63d9089ef518cc003e98167b",
  "name": "Air Conditioner Selection with a Minimum 1st Investment Cost",
  "slug": "air-conditioner-selection-with-a-minimum-1st-investment-cost",
  "category": "reference",
  "publishedAt": "2023-01-31T12:27:37.374Z",
  "approvedAt": null,
  "languages": [
    "dart"
  ],
  "url": "https://www.codewars.com/kata/63d9089ef518cc003e98167b",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2023-01-31T12:25:02.206Z",
  "createdBy": {
    "username": "NeBicim1NikBu",
    "url": "https://www.codewars.com/users/NeBicim1NikBu"
  },
  "description": "You are a air-conditioning guys and you need to select the air-conditioners based on the total area of the space with a minimal cost.\n\nYou have below air conditioners in your stock with a selling price;\n\n*  9.000 Btu/h =>   650,- USD\n* 12.000 Btu/h =>   850,- USD\n* 18.000 Btu/h => 1.000,- USD\n\nYour task is first to calculate the area based on given length and width of the room. \n\nYou have a fixed calculation method to get the total cooling need of the room by multipliyin of the area by 160 Btu/h.\n\nFor example; \n* Room width is 6 meter , room length is 10 meter.\n* You need to calculate the total area of the room which is 6 x 10 = 60 m2.\n* Total cooling need of the room is 60 x 160 = 9.600 Btu/h.\n* You need to offer 1 pcs 9.000 Btu/h unit with a price of 650 USD.\n\nRules ;\n* 5< Room width <20 and 5< Room length <30 integer values.\n* Total cooling capacity of the units should not be less then %10 of total cooling needs of the room.\n* You will be fined by the municipality for exceeding of the total cooling need of the room by giving over total cooling capacity of the units by 0.05 USD for each 1 Btu/h. This value will be invoiced to the customer so you need to consider to add this penalty to your total cost. (For example: Total need of the cooling of the space is 11.500 Btu/h and you have an offer of 1 x 12.000 Btu/h unit with 850 USD cost. So you have 12000-11500 = 500 Btu/h over cooling & you will pay 500 x 0.05 = 25 USD additional penalty cost. Then your total cost will be 850 + 25 = 875 USD). You need to round the unit to get integer value.\n* You need to consider minimum first investment cost in case the selection of multiple units ( Think about if the total cost of 2 x 9.000 Btu/h units is cheaper then 1 x 18.000 Btu/h unit? ).\n* You need to return a list with quantites of the each model and total investment cost at the end (For example : {\"9.000 Btu/h\":1,\"12.000 Btu/h\":0,\"18.000 Btu/h\":0,\"Total Cost\":650}. This will help your warehouse guy to ship the necessary units and your finance will invoice the correct amount.\n\nHelp our planet to keep your cooling at minimum to keep the temperature increase at least by 1.5 C....Be careful with Global Warming..\n\nBest luck..\n\n\n\n\n\n\n",
  "totalAttempts": 59,
  "totalCompleted": 6,
  "totalStars": 0,
  "voteScore": -4,
  "tags": [
    "Fundamentals",
    "Mathematics",
    "Algorithms"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 3,
    "suggestions": 0
  }
}