{
  "id": "63e8d88b45f03a0024b1f44d",
  "name": "1 Princess and 2 ROBOCATS",
  "slug": "1-princess-and-2-robocats",
  "category": "games",
  "publishedAt": "2023-02-14T10:38:51.221Z",
  "approvedAt": null,
  "languages": [
    "python"
  ],
  "url": "https://www.codewars.com/kata/63e8d88b45f03a0024b1f44d",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2023-02-12T12:16:11.358Z",
  "createdBy": {
    "username": "user902000",
    "url": "https://www.codewars.com/users/user902000"
  },
  "description": "The story will be about a petite cute princess, located in a tower, with two ROBOCAT-guards, that flying nearby\n\nThe movement of ROBOCATS is programmed with a bunch of letters, each of which is responsible for moving in one direction. Movement in any direction occur per unit of distance and take a unit of time. Because ROBOCATS have to check sometimes the princess too, the sequence of movements in the program always leads the ROBOCATS back to the tower (At the start, both ROBOCATS are in the tower too). When the program comes to the last position (that is  when ROBOCAT appears at the beginning position), it immediately starts again as if it never ended.\n\nMore precisely about movement program:\n\n- f,b – movement along one axis\n- l,r – movement along second axis\n- u,d – movement along third axis\n\n- *f – forward\n- *b – backward\n- *l – leftward\n- *r – rightward\n- *u – upward\n- *d –downward\n\nBut it happens that the princess wants to play with the ROBOCATS and then at the same moment the ROBOCATS fly to the tower along the shortest path, maybe even diagonally, moving from position currently occupied. This moment comes after the amount of time specified by the third part of the input.\n\nYour task (better consider it like the order of the princess) is to write a program, that will determines, which of the ROBOCATS Arrives to the princess first after a specified number of time units\n\n*The actions take place in 3d space\n\nInput: str,str,int:\n\n    1,2)Movement program for the first and second ROBOCATS\n  \n    3)The number of unit of time that have passed since the program was launched\n\nOutput: str:\n\n    1)First arriving ROBOCAT (c1 or c2) or c1c2 if the ROBOCATS arrive at the same time\n\nEnjoy /ᐠ｡.｡ᐟ\\\n",
  "totalAttempts": 157,
  "totalCompleted": 16,
  "totalStars": 1,
  "voteScore": 15,
  "tags": [
    "Algorithms",
    "Puzzles"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}