{
  "id": "649982ce79648d000edfb358",
  "name": "Grandma's TV",
  "slug": "grandmas-tv",
  "category": "reference",
  "publishedAt": "2023-06-26T15:19:04.001Z",
  "approvedAt": null,
  "languages": [
    "cpp",
    "python",
    "rust"
  ],
  "url": "https://www.codewars.com/kata/649982ce79648d000edfb358",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2023-06-26T12:21:35.087Z",
  "createdBy": {
    "username": "Sommeba",
    "url": "https://www.codewars.com/users/Sommeba"
  },
  "description": "While assisting your grandma with cleaning, she mentions her deteriorating eyesight and the challenges she faces seeing her TV clearly. Curious, you power on the ancient, dust-covered box and are horrified by the abysmal resolution and number of dead pixels on the screen. Amidst the disheartening sight, you notice a few things. First, every dead pixel is on the far right side of the screen and is not counted towards the length of that row. Second, at least one entire row of pixels has stood the test of time. Determined to help your grandma, you take your findings and start writing a program that does the following: Given the television screen's ```monitor```, which is represented as a jagged array of numbers, and the ```resolution```, which is the recommended resolution for a clear picture, determine the original resolution of the TV, and if this resolution is greater than or quivalent to the recommended ```resolution```, then return ```true```, because grandma needs new glasses. If the original resolution is less than ```resolution```, then return ```false``` because grandma needs a new TV.\n\n* You can determine the original resolution by multiply the length of the pixels that have with stood the test of time by the width of the TV\n",
  "totalAttempts": 62,
  "totalCompleted": 25,
  "totalStars": 1,
  "voteScore": 13,
  "tags": [
    "Arrays"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}