{
  "id": "656d965a89b24a05e2c5f027",
  "name": "A More Practical Hello World",
  "slug": "a-more-practical-hello-world",
  "category": "reference",
  "publishedAt": "2023-12-04T09:08:49.211Z",
  "approvedAt": null,
  "languages": [
    "python"
  ],
  "url": "https://www.codewars.com/kata/656d965a89b24a05e2c5f027",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2023-12-04T09:05:30.225Z",
  "createdBy": {
    "username": "Martyn-Pearson",
    "url": "https://www.codewars.com/users/Martyn-Pearson"
  },
  "description": "## Introduction\n\nYour friend, a keen traveller, heard how you aced coding \"Hello World\", but pointed out that as the only people who arrive in the world are babies and aliens, it's practical use is quite limited. Unless of course we've been coding some sort of interplanetary arrival system all these years...\n\nHe's asked you to write some code to remind him how to say hello to the countries he visits.\n\n## Your Task\n\nComplete the method `hello_country` such that when given a country name, it tells your friend how to say hello to that country. To help you out they've provided you with a dictionary (via preloaded), `GREETINGS`. For each country in the dictionary the key is the country name and the value is a tuple consisting of two items - \"hello\" translated to the appropriate language, and the name of the country in that language. For example, the entry for France is as follows:\n\n```python\n\"France\" : (\"Bonjour\", \"la France\")\n```\n\nYou should return the greeting and the country name separated with a space - even if normally the local language would not have such spacing.\n\nHowever, there is a problem. Your friend might visit countries for which the greetings are not known. In which case, they become a typical tourist, and they speak in English more loudly. If you are passed a country to `hello_country` which is not in `GREETINGS`, simply say hello to the country in upper case, with an exclamation mark at the end, denoting to your friend that they need to shout.\n\n## Examples\nAs we saw above, according to the greetings your friend shared with you, in France, \"hello\" is \"Bonjour\", and in French, France is refered to as \"la France\". Therefore:\n\n```python\nhello_country(\"France\") # ==> \"Bonjour la France\"\n```\n\nFor an unknown country, your friend needs to shout out their hello:\n```python\nhello_country(\"Madeupland\") # ==> \"HELLO MADEUPLAND!\"\n```\n\n## Endnote\nIf truth be told, your friend's foreign language skills aren't great, so they did just grab them from an online translation tool. But hopefully they'll help them look like they have at least made an effort.\n\n",
  "totalAttempts": 51,
  "totalCompleted": 16,
  "totalStars": 0,
  "voteScore": 6,
  "tags": [
    "Fundamentals"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 0
  }
}