{
  "id": "65a45d91fcc06d67a7635305",
  "name": "A Sheep for a Wood",
  "slug": "a-sheep-for-a-wood-1",
  "category": "games",
  "publishedAt": "2024-01-14T22:48:57.710Z",
  "approvedAt": null,
  "languages": [
    "rust"
  ],
  "url": "https://www.codewars.com/kata/65a45d91fcc06d67a7635305",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2024-01-14T22:17:53.196Z",
  "createdBy": {
    "username": "pearcebasmanm",
    "url": "https://www.codewars.com/users/pearcebasmanm"
  },
  "description": "Original Kata: https://www.codewars.com/kata/641a3ef9a54409455ea8ba68/discuss/rust\nAll credit goes to CalebWAC, I just refactored it to use enums and am still figuring out how to popose that edit to the original.\n\nCatan is a game where players collect resources to build cities, settlements, and roads in order to gain enough points. Trading is a significant mechanic in the game, allowing players to build even if they don't initially have the right resources.\n\nCities, settlements, and roads each have their own resource requirements to be built. You will be given a hand of resources and the hands of two other player's resources. Your job is to determine if you can build the specified structure by using the resources in your hand and trading with other players.\n\nFor example, a city requires two stones and three wheat. If you have two stones, two wheat, and one sheep, while another player has a wheat, it would be possible to build a city by trading your sheep for the other player's wheat. For the purpose of this exercise, one card must be given away for gaining another card.\n\nThere are five types of resources in Catan:\n\n* Sheep\n* Wood\n* Brick\n* Stone\n* Wheat\n\nEach structure has its own requirements for building:\n\n* City: 2 Stone, 3 Wheat\n* Settlement: 1 Brick, 1 Wood, 1 Wheat, 1 Sheep\n* Road: 1 Brick, 1 Wood",
  "totalAttempts": 35,
  "totalCompleted": 3,
  "totalStars": 0,
  "voteScore": -1,
  "tags": [],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 1,
    "suggestions": 0
  }
}