{
  "id": "65d7143ee2b49c97113c427e",
  "name": "Sub-Atomic Craziness",
  "slug": "sub-atomic-craziness",
  "category": "reference",
  "publishedAt": "2024-02-22T09:30:58.793Z",
  "approvedAt": null,
  "languages": [
    "python"
  ],
  "url": "https://www.codewars.com/kata/65d7143ee2b49c97113c427e",
  "rank": {
    "id": null,
    "name": null,
    "color": null
  },
  "createdAt": "2024-02-22T09:30:38.290Z",
  "createdBy": {
    "username": "anusha.j",
    "url": "https://www.codewars.com/users/anusha.j"
  },
  "description": "## Background\n\nJack's chemistry teacher has been very impressed with his work and has made him her teaching assistant. As an assistant, he has been assigned the role of checking test papers, but the worst part is...there's no answer key!\n\nJack, knowing that as a human he is bound to make mistakes, decides to write a function to help him check papers. However, he unfortunately lacks the knowledge required to successfully write this function.\n\nWill you help him?\n\n## Task\n\nWrite a function help_jack which accepts the following parameters:\n\n1) number of protons in the element (p) -> integer\n2) number of neutrons in the element (n) -> integer\n\nAnd it should return the following:\n\n1) The atomic number of the element -> integer\n2) The atomic mass of the element -> integer\n3) The electronic configuration of the element (in K,L,M,N shells) -> list\n4) The valency of the element -> integer\n\nIf the protons and neutrons are both zero, then the atom does not exist. So you should return \"Atom does not exist\".\n\nInteresting fact: Andreas von Antropoff coined the term *\"Neutronium\"* for an atom made up of no protons and no electrons, only neutrons. \n\nSo, if the protons are zero, but neutrons are not zero, return **\"Neutronium\"**.\n\n## Notes\n\n1) All the information should be returned in the following form:\n\n(atomic no., atomic mass, [electronic configuration], valency)\n\n2) For valency, do not worry about the signs, only the magnitude.\n\ni.e, return valency of oxygen as 2, not -2\n\n3) **Only the first 20 elements will be tested to avoid exceptions.** Up till the first 20 elements, electrons are filled in a step-wise manner.\n\n## Hints\n\n1) In an atom, the number of protons is always equal to the number of electrons.\n\n2) The atomic mass of an element is defined as the sum of the number of protons and neutrons present in the atom (collectively known as nucleons)\n\n3) The electronic configuration is the number of electrons present in each shell of an atom. For the first 20 elements, only 4 shells are required (K, L, M, and N). \n\n4) The innermost shell (K) can have atmost 2 electrons, while the rest can have 8 (for the first 20 elements **only**).\n\n5) An atom is said to be stable when it aquires the maximum number of electrons in its outer shell.\n\nFor example, phosphorus has 15 electrons. These electrons can be represented in shells like this: K: 2, L: 8, M:7. In order to become stable, phosphorus must gain **one** electron. This is also known as its **valency**.\n\n",
  "totalAttempts": 180,
  "totalCompleted": 26,
  "totalStars": 0,
  "voteScore": 26,
  "tags": [
    "Logic"
  ],
  "contributorsWanted": true,
  "unresolved": {
    "issues": 0,
    "suggestions": 1
  }
}